books/程序员的自我修养.org
#+SETUPFILE: ~/.emacs.d/themes/org-html-themes/setup/theme-readtheorg.setup
#+OPTIONS: \n:t
#+OPTIONS: ^:nil
#+OPTIONS: tex:t
#+STARTUP: latexpreview
#+OPTIONS: tex:dvipng
#+HTML_MATHJAX: align: left indent: 5em tagside: left font: Neo-Euler
#+attr_html: :width 300px
#+attr_latex: :width 300px
#+ATTR_ORG: :width 300

#+TITLE: 程序员的自我修养 - 基于X86的linux

* 第一章 温故而知新
PC机:
- 高速的北桥芯片，用作CPU 内存 显卡通信
- 低速的南桥芯片，用作磁盘 USB 键鼠通信，汇总后连接到北桥

系统软件
- 操作系统
- 编译器，汇编器，链接器

interface
- underlayer 定义接口
- upperlayer 使用接口

APP -> (API) -> Running Lib -> (System call 0x80 softtware interrupt) -> Kernel -> (Hardware Spec) -> Hardware

机械磁盘使用LBA来防止磁道密度由内到外变稀疏的问题

虚拟内存
- 地址空间不隔离     <- 分段 或 分页
- 内存使用效率低     <- 分页
- 程序运行的址不确定 <- 分段 或 分页

共享内存 - 不同进程的虚拟页映射到同一个物理页

页权限属性，只有操作系统可能设置，保护进程

线程LWP:
- 线程ID
- PC指针
- 寄存器集合、堆栈
- 共享内存空间和进程级资源(文件和信号)

| 私有       | 共享         |
|------------+--------------|
| 局部变量   | 全局变量     |
| 函数参数   | 堆           |
| TLS        | 函数静态变量 |
| 寄存器数据 | 代码         |
|            | 文件，信号   |

进程调度
- 优先级 Priority Schedule
- 轮询   Round Robin

| 系统调用 | 作用                                 |
|----------+--------------------------------------|
| fork     | 复制当前进程                         |
| exec     | 使用新的可执行映像覆盖当前可执行映像 |
| clone    | 创建子进程并从指定位置开始执行       |

二元信号量和互斥锁的区别：互斥锁mutex要求acquire和release是一个线程
条件变量作用类似栅栏==wait until

优化
- 编译器优化
- CPU优化，动态调度, *不过我记得X86关掉了这个*
#+begin_src C++
volatile T* pInst = 0;
T* GetInst() {
    if(pInst == NULL) {
        lock();
        if (pInst == NULL)
            pInst = new T;
        unlock();
    }
}
/*问题出在pInst = new T, 如果是先返回对象再调用构造函数，那么有可能第二个线程拿到的没构造函数初始化过的对象*/
#+end_src

* 第二章 静态链接

| Name        | Tool         |
|-------------+--------------|
| Propressing | gcc -E (cpp) |
| Compilation | gcc -S (cc1) |
| Assemmbly   | gcc -c (as)  |
| Linking     | gcc (ld)     |

编译器前端：机器无关的中间代码
编译器后端: 目标机器代码

符号随着汇编语言的普及被迅速使用

链接：
- 地址和空间分配
- 符号决议
- 重定位

