程序员的自我修养.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-10-19 一 23:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>程序员的自我修养 - 基于X86的linux</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="xuali2" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">程序员的自我修养 - 基于X86的linux</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgd4bc341">1. 第一章 温故而知新</a></li>
<li><a href="#org124a6f9">2. 第二章 静态链接</a></li>
<li><a href="#org46867fc">3. 第三章 目标文件</a>
<ul>
<li><a href="#org555d07b">3.1. ELF文件结构</a></li>
</ul>
</li>
<li><a href="#org0f78f46">4. 第四章 静态链接</a>
<ul>
<li><a href="#org6a34959">4.1. 重定位</a></li>
<li><a href="#org8bd3340">4.2. 重定位表</a></li>
<li><a href="#org69c1ab0">4.3. 链接控制脚本</a></li>
</ul>
</li>
<li><a href="#org661cd46">5. 第五章 WindowPE/COFF</a></li>
<li><a href="#orgc6b49ce">6. 第六章 可执行方主席件的装载与进程</a>
<ul>
<li><a href="#org1da1e70">6.1. 进程虚存空间分布</a></li>
</ul>
</li>
<li><a href="#org2d03b84">7. 第七章 动态链接</a>
<ul>
<li><a href="#org26c82c1">7.1. 地址无关代码(fPIC)</a></li>
<li><a href="#org8a72a29">7.2. 延迟绑定(Procedure Linkage Table)</a></li>
<li><a href="#org4e3a628">7.3. 动态链接器</a></li>
</ul>
</li>
<li><a href="#org79ee3c9">8. 第八章 共享库的组织</a></li>
<li><a href="#org73a0099">9. 第九章 Windows下的动态链接</a></li>
<li><a href="#org17befdf">10. 第十章 内存</a>
<ul>
<li><a href="#org1f26e32">10.1. 栈</a></li>
<li><a href="#org16cd02e">10.2. 堆与内存管理</a></li>
</ul>
</li>
<li><a href="#orgcf66636">11. 第十一章 运行库</a>
<ul>
<li><a href="#orgdc1316f">11.1. glibc启动文件</a></li>
<li><a href="#org1f19bdc">11.2. IO缓冲</a></li>
</ul>
</li>
<li><a href="#orgae8c2df">12. 第十二章 系统调用与API</a></li>
<li><a href="#org3441e9e">13. 第十三章 运行库实现</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgd4bc341" class="outline-2">
<h2 id="orgd4bc341"><span class="section-number-2">1</span> 第一章 温故而知新</h2>
<div class="outline-text-2" id="text-1">
<p>
PC机:<br />
</p>
<ul class="org-ul">
<li>高速的北桥芯片，用作CPU 内存 显卡通信<br /></li>
<li>低速的南桥芯片，用作磁盘 USB 键鼠通信，汇总后连接到北桥<br /></li>
</ul>

<p>
系统软件<br />
</p>
<ul class="org-ul">
<li>操作系统<br /></li>
<li>编译器，汇编器，链接器<br /></li>
</ul>

<p>
interface<br />
</p>
<ul class="org-ul">
<li>underlayer 定义接口<br /></li>
<li>upperlayer 使用接口<br /></li>
</ul>

<p>
APP -&gt; (API) -&gt; Running Lib -&gt; (System call 0x80 softtware interrupt) -&gt; Kernel -&gt; (Hardware Spec) -&gt; Hardware<br />
</p>

<p>
机械磁盘使用LBA来防止磁道密度由内到外变稀疏的问题<br />
</p>

<p>
虚拟内存<br />
</p>
<ul class="org-ul">
<li>地址空间不隔离     &lt;- 分段 或 分页<br /></li>
<li>内存使用效率低     &lt;- 分页<br /></li>
<li>程序运行的址不确定 &lt;- 分段 或 分页<br /></li>
</ul>

<p>
共享内存 - 不同进程的虚拟页映射到同一个物理页<br />
</p>

<p>
页权限属性，只有操作系统可能设置，保护进程<br />
</p>

<p>
线程LWP:<br />
</p>
<ul class="org-ul">
<li>线程ID<br /></li>
<li>PC指针<br /></li>
<li>寄存器集合、堆栈<br /></li>
<li>共享内存空间和进程级资源(文件和信号)<br /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">私有</th>
<th scope="col" class="org-left">共享</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">局部变量</td>
<td class="org-left">全局变量</td>
</tr>

<tr>
<td class="org-left">函数参数</td>
<td class="org-left">堆</td>
</tr>

<tr>
<td class="org-left">TLS</td>
<td class="org-left">函数静态变量</td>
</tr>

<tr>
<td class="org-left">寄存器数据</td>
<td class="org-left">代码</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-left">文件，信号</td>
</tr>
</tbody>
</table>

<p>
进程调度<br />
</p>
<ul class="org-ul">
<li>优先级 Priority Schedule<br /></li>
<li>轮询   Round Robin<br /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">系统调用</th>
<th scope="col" class="org-left">作用</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">fork</td>
<td class="org-left">复制当前进程</td>
</tr>

<tr>
<td class="org-left">exec</td>
<td class="org-left">使用新的可执行映像覆盖当前可执行映像</td>
</tr>

<tr>
<td class="org-left">clone</td>
<td class="org-left">创建子进程并从指定位置开始执行</td>
</tr>
</tbody>
</table>

<p>
二元信号量和互斥锁的区别：互斥锁mutex要求acquire和release是一个线程<br />
条件变量作用类似栅栏==wait until<br />
</p>

<p>
优化<br />
</p>
<ul class="org-ul">
<li>编译器优化<br /></li>
<li>CPU优化，动态调度, <b>不过我记得X86关掉了这个</b><br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-C++"><span style="color: #F92672;">volatile</span> <span style="color: #66D9EF;">T</span>* <span style="color: #FD971F;">pInst</span> = 0;
<span style="color: #66D9EF;">T</span>* <span style="color: #A6E22E; font-size: 130%;">GetInst</span>() {
    <span style="color: #F92672;">if</span>(pInst == <span style="color: #AE81FF;">NULL</span>) {
        lock();
        <span style="color: #F92672;">if</span> (pInst == <span style="color: #AE81FF;">NULL</span>)
            pInst = <span style="color: #F92672;">new</span> <span style="color: #66D9EF;">T</span>;
        unlock();
    }
}
<span style="color: #75715E;">/*</span><span style="color: #E6DB74;">&#38382;&#39064;&#20986;&#22312;pInst = new T, &#22914;&#26524;&#26159;&#20808;&#36820;&#22238;&#23545;&#35937;&#20877;&#35843;&#29992;&#26500;&#36896;&#20989;&#25968;&#65292;&#37027;&#20040;&#26377;&#21487;&#33021;&#31532;&#20108;&#20010;&#32447;&#31243;&#25343;&#21040;&#30340;&#27809;&#26500;&#36896;&#20989;&#25968;&#21021;&#22987;&#21270;&#36807;&#30340;&#23545;&#35937;*/</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org124a6f9" class="outline-2">
<h2 id="org124a6f9"><span class="section-number-2">2</span> 第二章 静态链接</h2>
<div class="outline-text-2" id="text-2">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Tool</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Propressing</td>
<td class="org-left">gcc -E (cpp)</td>
</tr>

<tr>
<td class="org-left">Compilation</td>
<td class="org-left">gcc -S (cc1)</td>
</tr>

<tr>
<td class="org-left">Assemmbly</td>
<td class="org-left">gcc -c (as)</td>
</tr>

<tr>
<td class="org-left">Linking</td>
<td class="org-left">gcc (ld)</td>
</tr>
</tbody>
</table>

<p>
编译器前端：机器无关的中间代码<br />
编译器后端: 目标机器代码<br />
</p>

<p>
符号随着汇编语言的普及被迅速使用<br />
</p>

<p>
链接：<br />
</p>
<ul class="org-ul">
<li>地址和空间分配<br /></li>
<li>符号决议<br /></li>
<li>重定位<br /></li>
</ul>
</div>
</div>
