程序员的自我修养.html

<div id="outline-container-org46867fc" class="outline-2">
<h2 id="org46867fc"><span class="section-number-2">3</span> 第三章 目标文件</h2>
<div class="outline-text-2" id="text-3">
<p>
设计.text和.data的原因:<br />
</p>
<ul class="org-ul">
<li>指令和数据的权限不一样<br /></li>
<li>缓存体系,提高程序的局限性<br /></li>
<li>动态链接多进程共享同一个.text<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-C"><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">printf</span><span style="color: #AE81FF;">(</span><span style="color: #F92672;">const</span> <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">format</span>, ...<span style="color: #AE81FF;">)</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">global_init_var</span> = 84;
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">global_uninit_var</span>;

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">func1</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"%d\n"</span>, i<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span><span style="color: #66D9EF;">[]</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">static_var</span> = 85;
    <span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">static_var2</span>;

    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span> = 1;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span>;

    <span style="color: #A6E22E; font-weight: bold;">func1</span><span style="color: #66D9EF;">(</span>static_var + static_var2 + a + b<span style="color: #66D9EF;">)</span>;
    <span style="color: #F92672;">return</span> 0;
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
目标文件格式<br />
</p>
<ul class="org-ul">
<li>.text 代码段<br /></li>
<li>.data 初始化了的全局静态变量和局部静态变量, 8个字节<br /></li>
<li>.rodata const和只读字符串, 640a就是字符\和字符n，最后以0结尾<br /></li>
<li>global_uninit_var放在了COM段<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">readelf -h 2.o
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2<span style="color: #E6DB74;">'s complement, little endian</span>
<span style="color: #E6DB74;">  Version:                           1 (current)</span>
<span style="color: #E6DB74;">  OS/ABI:                            UNIX - System V</span>
<span style="color: #E6DB74;">  ABI Version:                       0</span>
<span style="color: #E6DB74;">  Type:                              REL (Relocatable file)</span>
<span style="color: #E6DB74;">  Machine:                           Intel 80386</span>
<span style="color: #E6DB74;">  Version:                           0x1</span>
<span style="color: #E6DB74;">  Entry point address:               0x0</span>
<span style="color: #E6DB74;">  Start of program headers:          0 (bytes into file)</span>
<span style="color: #E6DB74;">  Start of section headers:          812 (bytes into file)</span>
<span style="color: #E6DB74;">  Flags:                             0x0</span>
<span style="color: #E6DB74;">  Size of this header:               52 (bytes)</span>
<span style="color: #E6DB74;">  Size of program headers:           0 (bytes)</span>
<span style="color: #E6DB74;">  Number of program headers:         0</span>
<span style="color: #E6DB74;">  Size of section headers:           40 (bytes)</span>
<span style="color: #E6DB74;">  Number of section headers:         13</span>
<span style="color: #E6DB74;">  Section header string table index: 12</span>

<span style="color: #E6DB74;">readelf -S 2.o</span>
<span style="color: #E6DB74;">There are 13 section headers, starting at offset 0x32c:</span>

<span style="color: #E6DB74;">Section Headers:</span>
<span style="color: #E6DB74;">  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al</span>
<span style="color: #E6DB74;">  [ 0]                   NULL            00000000 000000 000000 00      0   0  0</span>
<span style="color: #E6DB74;">  [ 1] .text             PROGBITS        00000000 000034 000064 00  AX  0   0  1</span>
<span style="color: #E6DB74;">  [ 2] .rel.text         REL             00000000 000294 000028 08   I 10   1  4</span>
<span style="color: #E6DB74;">  [ 3] .data             PROGBITS        00000000 000098 000008 00  WA  0   0  4</span>
<span style="color: #E6DB74;">  [ 4] .bss              NOBITS          00000000 0000a0 000004 00  WA  0   0  4</span>
<span style="color: #E6DB74;">  [ 5] .rodata           PROGBITS        00000000 0000a0 000004 00   A  0   0  1</span>
<span style="color: #E6DB74;">  [ 6] .comment          PROGBITS        00000000 0000a4 00002d 01  MS  0   0  1</span>
<span style="color: #E6DB74;">  [ 7] .note.GNU-stack   PROGBITS        00000000 0000d1 000000 00      0   0  1</span>
<span style="color: #E6DB74;">  [ 8] .eh_frame         PROGBITS        00000000 0000d4 000064 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [ 9] .rel.eh_frame     REL             00000000 0002bc 000010 08   I 10   8  4</span>
<span style="color: #E6DB74;">  [10] .symtab           SYMTAB          00000000 000138 000100 10     11  11  4</span>
<span style="color: #E6DB74;">  [11] .strtab           STRTAB          00000000 000238 00005a 00      0   0  1</span>
<span style="color: #E6DB74;">  [12] .shstrtab         STRTAB          00000000 0002cc 00005f 00      0   0  1</span>
<span style="color: #E6DB74;">Key to Flags:</span>
<span style="color: #E6DB74;">  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),</span>
<span style="color: #E6DB74;">  L (link order), O (extra OS processing required), G (group), T (TLS),</span>
<span style="color: #E6DB74;">  C (compressed), x (unknown), o (OS specific), E (exclude),</span>
<span style="color: #E6DB74;">  p (processor specific)</span>

<span style="color: #E6DB74;">readelf -s 2.o</span>

<span style="color: #E6DB74;">Symbol table '</span>.symtab<span style="color: #E6DB74;">' contains 16 entries:</span>
<span style="color: #E6DB74;">   Num:    Value  Size Type    Bind   Vis      Ndx Name</span>
<span style="color: #E6DB74;">     0: 00000000     0 NOTYPE  LOCAL  DEFAULT  UND </span>
<span style="color: #E6DB74;">     1: 00000000     0 FILE    LOCAL  DEFAULT  ABS 2.c</span>
<span style="color: #E6DB74;">     2: 00000000     0 SECTION LOCAL  DEFAULT    1 </span>
<span style="color: #E6DB74;">     3: 00000000     0 SECTION LOCAL  DEFAULT    3 </span>
<span style="color: #E6DB74;">     4: 00000000     0 SECTION LOCAL  DEFAULT    4 </span>
<span style="color: #E6DB74;">     5: 00000000     0 SECTION LOCAL  DEFAULT    5 </span>
<span style="color: #E6DB74;">     6: 00000004     4 OBJECT  LOCAL  DEFAULT    3 static_var.1907</span>
<span style="color: #E6DB74;">     7: 00000000     4 OBJECT  LOCAL  DEFAULT    4 static_var2.1908</span>
<span style="color: #E6DB74;">     8: 00000000     0 SECTION LOCAL  DEFAULT    7 </span>
<span style="color: #E6DB74;">     9: 00000000     0 SECTION LOCAL  DEFAULT    8 </span>
<span style="color: #E6DB74;">    10: 00000000     0 SECTION LOCAL  DEFAULT    6 </span>
<span style="color: #E6DB74;">    11: 00000000     4 OBJECT  GLOBAL DEFAULT    3 global_init_var</span>
<span style="color: #E6DB74;">    12: 00000004     4 OBJECT  GLOBAL DEFAULT  COM global_uninit_var</span>
<span style="color: #E6DB74;">    13: 00000000    28 FUNC    GLOBAL DEFAULT    1 func1</span>
<span style="color: #E6DB74;">    14: 00000000     0 NOTYPE  GLOBAL DEFAULT  UND printf</span>
<span style="color: #E6DB74;">    15: 0000001c    72 FUNC    GLOBAL DEFAULT    1 main</span>

<span style="color: #E6DB74;">objdump -s -d 2.o</span>

<span style="color: #E6DB74;">2.o:     file format elf32-i386</span>

<span style="color: #E6DB74;">Contents of section .text:</span>
<span style="color: #E6DB74;"> 0000 5589e583 ec0883ec 08ff7508 68000000  U.........u.h...</span>
<span style="color: #E6DB74;"> 0010 00e8fcff ffff83c4 1090c9c3 8d4c2404  .............L$.</span>
<span style="color: #E6DB74;"> 0020 83e4f0ff 71fc5589 e55183ec 14c745f4  ....q.U..Q....E.</span>
<span style="color: #E6DB74;"> 0030 01000000 8b150400 0000a100 00000001  ................</span>
<span style="color: #E6DB74;"> 0040 c28b45f4 01c28b45 f001d083 ec0c50e8  ..E....E......P.</span>
<span style="color: #E6DB74;"> 0050 fcffffff 83c410b8 00000000 8b4dfcc9  .............M..</span>
<span style="color: #E6DB74;"> 0060 8d61fcc3                             .a..            </span>
<span style="color: #E6DB74;">Contents of section .data:</span>
<span style="color: #E6DB74;"> 0000 54000000 55000000                    T...U...        </span>
<span style="color: #E6DB74;">Contents of section .rodata:</span>
<span style="color: #E6DB74;"> 0000 25640a00                             %d..            </span>
<span style="color: #E6DB74;">Contents of section .comment:</span>
<span style="color: #E6DB74;"> 0000 00474343 3a202847 4e552920 382e332e  .GCC: (GNU) 8.3.</span>
<span style="color: #E6DB74;"> 0010 31203230 31393035 30372028 52656420  1 20190507 (Red </span>
<span style="color: #E6DB74;"> 0020 48617420 382e332e 312d3429 00        Hat 8.3.1-4).   </span>
<span style="color: #E6DB74;">Contents of section .eh_frame:</span>
<span style="color: #E6DB74;"> 0000 14000000 00000000 017a5200 017c0801  .........zR..|..</span>
<span style="color: #E6DB74;"> 0010 1b0c0404 88010000 1c000000 1c000000  ................</span>
<span style="color: #E6DB74;"> 0020 00000000 1c000000 00410e08 8502420d  .........A....B.</span>
<span style="color: #E6DB74;"> 0030 0558c50c 04040000 28000000 3c000000  .X......(...&lt;...</span>
<span style="color: #E6DB74;"> 0040 1c000000 48000000 00440c01 00471005  ....H....D...G..</span>
<span style="color: #E6DB74;"> 0050 02750043 0f03757c 06750c01 0041c543  .u.C..u|.u...A.C</span>
<span style="color: #E6DB74;"> 0060 0c040400                             ....            </span>

<span style="color: #E6DB74;">Disassembly of section .text:</span>

<span style="color: #E6DB74;">00000000 &lt;func1&gt;:</span>
<span style="color: #E6DB74;">   0:   55                      push   %ebp</span>
<span style="color: #E6DB74;">   1:   89 e5                   mov    %esp,%ebp</span>
<span style="color: #E6DB74;">   3:   83 ec 08                sub    $0x8,%esp</span>
<span style="color: #E6DB74;">   6:   83 ec 08                sub    $0x8,%esp</span>
<span style="color: #E6DB74;">   9:   ff 75 08                pushl  0x8(%ebp)</span>
<span style="color: #E6DB74;">   c:   68 00 00 00 00          push   $0x0</span>
<span style="color: #E6DB74;">  11:   e8 fc ff ff ff          call   12 &lt;func1+0x12&gt;</span>
<span style="color: #E6DB74;">  16:   83 c4 10                add    $0x10,%esp</span>
<span style="color: #E6DB74;">  19:   90                      nop</span>
<span style="color: #E6DB74;">  1a:   c9                      leave  </span>
<span style="color: #E6DB74;">  1b:   c3                      ret    </span>

<span style="color: #E6DB74;">0000001c &lt;main&gt;:</span>
<span style="color: #E6DB74;">  1c:   8d 4c 24 04             lea    0x4(%esp),%ecx</span>
<span style="color: #E6DB74;">  20:   83 e4 f0                and    $0xfffffff0,%esp</span>
<span style="color: #E6DB74;">  23:   ff 71 fc                pushl  -0x4(%ecx)</span>
<span style="color: #E6DB74;">  26:   55                      push   %ebp</span>
<span style="color: #E6DB74;">  27:   89 e5                   mov    %esp,%ebp</span>
<span style="color: #E6DB74;">  29:   51                      push   %ecx</span>
<span style="color: #E6DB74;">  2a:   83 ec 14                sub    $0x14,%esp</span>
<span style="color: #E6DB74;">  2d:   c7 45 f4 01 00 00 00    movl   $0x1,-0xc(%ebp)</span>
<span style="color: #E6DB74;">  34:   8b 15 04 00 00 00       mov    0x4,%edx</span>
<span style="color: #E6DB74;">  3a:   a1 00 00 00 00          mov    0x0,%eax</span>
<span style="color: #E6DB74;">  3f:   01 c2                   add    %eax,%edx</span>
<span style="color: #E6DB74;">  41:   8b 45 f4                mov    -0xc(%ebp),%eax</span>
<span style="color: #E6DB74;">  44:   01 c2                   add    %eax,%edx</span>
<span style="color: #E6DB74;">  46:   8b 45 f0                mov    -0x10(%ebp),%eax</span>
<span style="color: #E6DB74;">  49:   01 d0                   add    %edx,%eax</span>
<span style="color: #E6DB74;">  4b:   83 ec 0c                sub    $0xc,%esp</span>
<span style="color: #E6DB74;">  4e:   50                      push   %eax</span>
<span style="color: #E6DB74;">  4f:   e8 fc ff ff ff          call   50 &lt;main+0x34&gt;</span>
<span style="color: #E6DB74;">  54:   83 c4 10                add    $0x10,%esp</span>
<span style="color: #E6DB74;">  57:   b8 00 00 00 00          mov    $0x0,%eax</span>
<span style="color: #E6DB74;">  5c:   8b 4d fc                mov    -0x4(%ebp),%ecx</span>
<span style="color: #E6DB74;">  5f:   c9                      leave</span>
<span style="color: #E6DB74;">  60:   8d 61 fc                lea    -0x4(%ecx),%esp</span>
<span style="color: #E6DB74;">  63:   c3                      ret</span>

</pre>
</div>

<p>
更多的段<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">.rodata1</td>
<td class="org-left">read only data</td>
</tr>

<tr>
<td class="org-left">.comment</td>
<td class="org-left">compiler version</td>
</tr>

<tr>
<td class="org-left">.debug</td>
<td class="org-left">debug info</td>
</tr>

<tr>
<td class="org-left">.dynamic</td>
<td class="org-left">dynamic link info</td>
</tr>

<tr>
<td class="org-left">.hash</td>
<td class="org-left">symbol hash table</td>
</tr>

<tr>
<td class="org-left">.line</td>
<td class="org-left">file line for debug</td>
</tr>

<tr>
<td class="org-left">.note</td>
<td class="org-left">additional compiler info</td>
</tr>

<tr>
<td class="org-left">.strtab</td>
<td class="org-left">string table, symbol name</td>
</tr>

<tr>
<td class="org-left">.symtabl</td>
<td class="org-left">symbol table</td>
</tr>

<tr>
<td class="org-left">.shstrtab</td>
<td class="org-left">section string table, section name</td>
</tr>

<tr>
<td class="org-left">.plt .got</td>
<td class="org-left">dynamic jump table and global entry table</td>
</tr>

<tr>
<td class="org-left">.init .fini</td>
<td class="org-left">init and fini code</td>
</tr>
</tbody>
</table>

<p>
objcopy可以将任意文件放在elf里<br />
</p>


<div class="org-src-container">
<pre class="src src-bash">objcopy -I binary -O elf32-i386 -B i386 1.o 11.o
ojdump -ht 11.o

11.o:     file format elf32-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .data         00000534  00000000  00000000  00000034  2**0
                  CONTENTS, ALLOC, LOAD, DATA
SYMBOL TABLE:
00000000 l    d  .data  00000000 .data
00000000 g       .data  00000000 _binary_1_o_start
00000534 g       .data  00000000 _binary_1_o_end
00000534 g       *ABS*  00000000 _binary_1_o_size


readelf -h 11.o
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2<span style="color: #E6DB74;">'s complement, little endian</span>
<span style="color: #E6DB74;">  Version:                           1 (current)</span>
<span style="color: #E6DB74;">  OS/ABI:                            UNIX - System V</span>
<span style="color: #E6DB74;">  ABI Version:                       0</span>
<span style="color: #E6DB74;">  Type:                              REL (Relocatable file)</span>
<span style="color: #E6DB74;">  Machine:                           Intel 80386</span>
<span style="color: #E6DB74;">  Version:                           0x1</span>
<span style="color: #E6DB74;">  Entry point address:               0x0</span>
<span style="color: #E6DB74;">  Start of program headers:          0 (bytes into file)</span>
<span style="color: #E6DB74;">  Start of section headers:          1552 (bytes into file)</span>
<span style="color: #E6DB74;">  Flags:                             0x0</span>
<span style="color: #E6DB74;">  Size of this header:               52 (bytes)</span>
<span style="color: #E6DB74;">  Size of program headers:           0 (bytes)</span>
<span style="color: #E6DB74;">  Number of program headers:         0</span>
<span style="color: #E6DB74;">  Size of section headers:           40 (bytes)</span>
<span style="color: #E6DB74;">  Number of section headers:         5</span>
<span style="color: #E6DB74;">  Section header string table index: 4</span>

<span style="color: #E6DB74;">readelf -S 11.o</span>
<span style="color: #E6DB74;">There are 5 section headers, starting at offset 0x610:</span>

<span style="color: #E6DB74;">Section Headers:</span>
<span style="color: #E6DB74;">  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al</span>
<span style="color: #E6DB74;">  [ 0]                   NULL            00000000 000000 000000 00      0   0  0</span>
<span style="color: #E6DB74;">  [ 1] .data             PROGBITS        00000000 000034 000534 00  WA  0   0  1</span>
<span style="color: #E6DB74;">  [ 2] .symtab           SYMTAB          00000000 000568 000050 10      3   2  4</span>
<span style="color: #E6DB74;">  [ 3] .strtab           STRTAB          00000000 0005b8 000034 00      0   0  1</span>
<span style="color: #E6DB74;">  [ 4] .shstrtab         STRTAB          00000000 0005ec 000021 00      0   0  1</span>
<span style="color: #E6DB74;">Key to Flags:</span>
<span style="color: #E6DB74;">  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),</span>
<span style="color: #E6DB74;">  L (link order), O (extra OS processing required), G (group), T (TLS),</span>
<span style="color: #E6DB74;">  C (compressed), x (unknown), o (OS specific), E (exclude),</span>
<span style="color: #E6DB74;">  p (processor specific)</span>
<span style="color: #E6DB74;">[xuali2@sha-isbu-ed15n xuali2]$readelf -s 11.o</span>

<span style="color: #E6DB74;">Symbol table '</span>.symtab<span style="color: #E6DB74;">' contains 5 entries:</span>
<span style="color: #E6DB74;">   Num:    Value  Size Type    Bind   Vis      Ndx Name</span>
<span style="color: #E6DB74;">     0: 00000000     0 NOTYPE  LOCAL  DEFAULT  UND </span>
<span style="color: #E6DB74;">     1: 00000000     0 SECTION LOCAL  DEFAULT    1 </span>
<span style="color: #E6DB74;">     2: 00000000     0 NOTYPE  GLOBAL DEFAULT    1 _binary_1_o_start</span>
<span style="color: #E6DB74;">     3: 00000534     0 NOTYPE  GLOBAL DEFAULT    1 _binary_1_o_end</span>
<span style="color: #E6DB74;">     4: 00000534     0 NOTYPE  GLOBAL DEFAULT  ABS _binary_1_o_size</span>

</pre>
</div>

<p>
__attribute__((section("name"))) 修饰可以指定段<br />
</p>
</div>
