books/程序员的自我修养.org
** ELF文件结构

- 段表、字符串表等控制信息段都在文件后面
- REL 重定位文件 EXEC 可执行文件 DYN 共享目标文件
- 符号表里的值目标文件是 *段内偏移* ，可执行文件是 *虚拟地址*

| ELF Header           |
|----------------------|
| .text                |
|----------------------|
| .data                |
|----------------------|
| .bss                 |
|----------------------|
| ...                  |
|----------------------|
| section header table |
|----------------------|
| string tables        |
|----------------------|
| symbol tables        |
| ...                  |

特殊符号
| Name                                      | Description    |
|-------------------------------------------+----------------|
| __executable_start   | 程序最开始地址 |
| __etext&_etext&etext | 程序末尾地址   |
| _edata&edata                       | 数据段结束地址 |
| _end&end                           | 程序结束地址   |

符号修饰
- C++ 关键的概念是函数签名: 函数名+参数类型+所在类+命令空间，基于此生成符号名
- 导致不同编译器之间不能相互链接的主要原因是生成符号的规则不一样

extern C
- C++语法，修饰内的代码当作C语言代码处理，生成符号基于C语言规则
- 一个头文件同时支持C,C++
#+begin_src C

#ifdef __cplusplus
extern "C" {
#endif

void *memset(void *, int, size_t);

#ifdef __cplusplus
}
#endif
#+end_src

弱符号
- 强符号不可重复定义
- 强符号覆盖弱符号
- 弱符号选占用空间最大的一个，如果有多个同样空间的，随机?

弱引用
- 未定义默认为0
- 库中的弱符号可以被用户定义的强符号所覆盖
- 例: -lpthread决定glibc是单线程还是多线程版本，可以判断pthread_create是否为0来看是否为多线程版本，也可以直接看link的so库

调试信息
- ELF使用DWART(debug with arbitrary record format)
- Microsoft使用CodeView

