程序员的自我修养.html

<div id="outline-container-org555d07b" class="outline-3">
<h3 id="org555d07b"><span class="section-number-3">3.1</span> ELF文件结构</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>段表、字符串表等控制信息段都在文件后面<br /></li>
<li>REL 重定位文件 EXEC 可执行文件 DYN 共享目标文件<br /></li>
<li>符号表里的值目标文件是 <b>段内偏移</b> ，可执行文件是 <b>虚拟地址</b><br /></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">ELF Header</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">.text</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">.data</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">.bss</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">section header table</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">string tables</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-left">symbol tables</td>
</tr>

<tr>
<td class="org-left">&#x2026;</td>
</tr>
</tbody>
</table>

<p>
特殊符号<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">__executable_start</td>
<td class="org-left">程序最开始地址</td>
</tr>

<tr>
<td class="org-left">__etext&amp;_etext&amp;etext</td>
<td class="org-left">程序末尾地址</td>
</tr>

<tr>
<td class="org-left">_edata&amp;edata</td>
<td class="org-left">数据段结束地址</td>
</tr>

<tr>
<td class="org-left">_end&amp;end</td>
<td class="org-left">程序结束地址</td>
</tr>
</tbody>
</table>

<p>
符号修饰<br />
</p>
<ul class="org-ul">
<li>C++ 关键的概念是函数签名: 函数名+参数类型+所在类+命令空间，基于此生成符号名<br /></li>
<li>导致不同编译器之间不能相互链接的主要原因是生成符号的规则不一样<br /></li>
</ul>

<p>
extern C<br />
</p>
<ul class="org-ul">
<li>C++语法，修饰内的代码当作C语言代码处理，生成符号基于C语言规则<br /></li>
<li>一个头文件同时支持C,C++<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-C">
<span style="color: #F92672;">#ifdef</span> __cplusplus
<span style="color: #F92672;">extern</span> <span style="color: #E6DB74;">"C"</span> <span style="color: #AE81FF;">{</span>
<span style="color: #F92672;">#endif</span>

<span style="color: #66D9EF;">void</span> *<span style="color: #A6E22E; font-size: 130%;">memset</span><span style="color: #66D9EF;">(</span><span style="color: #66D9EF;">void</span> *, <span style="color: #66D9EF;">int</span>, <span style="color: #66D9EF;">size_t</span><span style="color: #66D9EF;">)</span>;

<span style="color: #F92672;">#ifdef</span> __cplusplus
<span style="color: #AE81FF;">}</span>
<span style="color: #F92672;">#endif</span>
</pre>
</div>

<p>
弱符号<br />
</p>
<ul class="org-ul">
<li>强符号不可重复定义<br /></li>
<li>强符号覆盖弱符号<br /></li>
<li>弱符号选占用空间最大的一个，如果有多个同样空间的，随机?<br /></li>
</ul>

<p>
弱引用<br />
</p>
<ul class="org-ul">
<li>未定义默认为0<br /></li>
<li>库中的弱符号可以被用户定义的强符号所覆盖<br /></li>
<li>例: -lpthread决定glibc是单线程还是多线程版本，可以判断pthread_create是否为0来看是否为多线程版本，也可以直接看link的so库<br /></li>
</ul>

<p>
调试信息<br />
</p>
<ul class="org-ul">
<li>ELF使用DWART(debug with arbitrary record format)<br /></li>
<li>Microsoft使用CodeView<br /></li>
</ul>
</div>
</div>
</div>
