程序员的自我修养.html

<div id="outline-container-org0f78f46" class="outline-2">
<h2 id="org0f78f46"><span class="section-number-2">4</span> 第四章 静态链接</h2>
<div class="outline-text-2" id="text-4">
<div class="org-src-container">
<pre class="src src-C"><span style="color: #75715E;">/* </span><span style="color: #E6DB74;">gcc -m32 -c a.c b.c -Wno-implicit-function-declaration </span><span style="color: #75715E;">*/</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">ld a.o b.o -e main -o ab -m elf_i386 </span><span style="color: #75715E;">*/</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">a.c </span><span style="color: #75715E;">*/</span>
<span style="color: #F92672;">extern</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">shared</span>;

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span> = 100;
    <span style="color: #A6E22E; font-weight: bold;">swap</span><span style="color: #66D9EF;">(</span>&amp;a, &amp;shared<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">b.c </span><span style="color: #75715E;">*/</span>
<span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">shared</span> = 1;

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">swap</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> *<span style="color: #FD971F;">a</span>, <span style="color: #66D9EF;">int</span> *<span style="color: #FD971F;">b</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    *a ^= *b ^= *a ^= *b ;
<span style="color: #AE81FF;">}</span>

</pre>
</div>

<p>
两步链接Two-pass Linking:<br />
</p>
<ul class="org-ul">
<li>空间与地址分配<br /></li>
</ul>
<p>
指的是可执行文件中的空间<br />
</p>
<ul class="org-ul">
<li>符号解析与重定位<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">gcc -m32 -c a.c -Wno-implicit-function-declaration
readelf -S a.o
There are 12 section headers, starting at offset 0x218:

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .text             PROGBITS        00000000 000034 000039 00  AX  0   0  1
  [ 2] .rel.text         REL             00000000 0001a8 000010 08   I  9   1  4
  [ 3] .data             PROGBITS        00000000 00006d 000000 00  WA  0   0  1
  [ 4] .bss              NOBITS          00000000 00006d 000000 00  WA  0   0  1
  [ 5] .comment          PROGBITS        00000000 00006d 00002d 01  MS  0   0  1
  [ 6] .note.GNU-stack   PROGBITS        00000000 00009a 000000 00      0   0  1
  [ 7] .eh_frame         PROGBITS        00000000 00009c 000044 00   A  0   0  4
  [ 8] .rel.eh_frame     REL             00000000 0001b8 000008 08   I  9   7  4
  [ 9] .symtab           SYMTAB          00000000 0000e0 0000b0 10     10   8  4
  [10] .strtab           STRTAB          00000000 000190 000016 00      0   0  1
  [11] .shstrtab         STRTAB          00000000 0001c0 000057 00      0   0  1
Key to Flags:
  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),
  L (link order), O (extra OS processing required), G (group), T (TLS),
  C (compressed), x (unknown), o (OS specific), E (exclude),
  p (processor specific)

gcc -m32 -c b.c -Wno-implicit-function-declaration
readelf -S b.o
There are 11 section headers, starting at offset 0x1ec:

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .text             PROGBITS        00000000 000034 000039 00  AX  0   0  1
  [ 2] .data             PROGBITS        00000000 000070 000004 00  WA  0   0  4
  [ 3] .bss              NOBITS          00000000 000074 000000 00  WA  0   0  1
  [ 4] .comment          PROGBITS        00000000 000074 00002d 01  MS  0   0  1
  [ 5] .note.GNU-stack   PROGBITS        00000000 0000a1 000000 00      0   0  1
  [ 6] .eh_frame         PROGBITS        00000000 0000a4 000038 00   A  0   0  4
  [ 7] .rel.eh_frame     REL             00000000 000190 000008 08   I  8   6  4
  [ 8] .symtab           SYMTAB          00000000 0000dc 0000a0 10      9   8  4
  [ 9] .strtab           STRTAB          00000000 00017c 000011 00      0   0  1
  [10] .shstrtab         STRTAB          00000000 000198 000053 00      0   0  1
Key to Flags:
  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),
  L (link order), O (extra OS processing required), G (group), T (TLS),
  C (compressed), x (unknown), o (OS specific), E (exclude),
  p (processor specific)

ld  a.o b.o -o ab -m elf_i386   <span style="color: #75715E;"># </span><span style="color: #E6DB74;">*&#27880;&#24847;&#65292;&#36816;&#34892;&#20250;&#20986;&#38169;*</span>
readelf -S ab
There are 8 section headers, starting at offset 0x11b4:

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .text             PROGBITS        08048094 000094 000072 00  AX  0   0  1
  [ 2] .eh_frame         PROGBITS        08048108 000108 000064 00   A  0   0  4
  [ 3] .data             PROGBITS        0804a000 001000 000004 00  WA  0   0  4
  [ 4] .comment          PROGBITS        00000000 001004 00002c 01  MS  0   0  1
  [ 5] .symtab           SYMTAB          00000000 001030 000100 10      6   9  4
  [ 6] .strtab           STRTAB          00000000 001130 000048 00      0   0  1
  [ 7] .shstrtab         STRTAB          00000000 001178 00003a 00      0   0  1
Key to Flags:
  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),
  L (link order), O (extra OS processing required), G (group), T (TLS),
  C (compressed), x (unknown), o (OS specific), E (exclude),
  p (processor specific)

objdump -h a.o

a.o:     file format elf32-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         00000039  00000000  00000000  00000034  2**0
                  CONTENTS, ALLOC, LOAD, RELOC, READONLY, CODE
  1 .data         00000000  00000000  00000000  0000006d  2**0
                  CONTENTS, ALLOC, LOAD, DATA
  2 .bss          00000000  00000000  00000000  0000006d  2**0
                  ALLOC
  3 .comment      0000002d  00000000  00000000  0000006d  2**0
                  CONTENTS, READONLY
  4 .note.GNU-stack 00000000  00000000  00000000  0000009a  2**0
                  CONTENTS, READONLY
  5 .eh_frame     00000044  00000000  00000000  0000009c  2**2
                  CONTENTS, ALLOC, LOAD, RELOC, READONLY, DATA
objdump -h b.o

b.o:     file format elf32-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         00000039  00000000  00000000  00000034  2**0
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  1 .data         00000004  00000000  00000000  00000070  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  2 .bss          00000000  00000000  00000000  00000074  2**0
                  ALLOC
  3 .comment      0000002d  00000000  00000000  00000074  2**0
                  CONTENTS, READONLY
  4 .note.GNU-stack 00000000  00000000  00000000  000000a1  2**0
                  CONTENTS, READONLY
  5 .eh_frame     00000038  00000000  00000000  000000a4  2**2
                  CONTENTS, ALLOC, LOAD, RELOC, READONLY, DATA

objdump -h ab

ab:     file format elf32-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         00000072  08048094  08048094  00000094  2**0
                  CONTENTS, ALLOC, LOAD, READONLY, CODE
  1 .eh_frame     00000064  08048108  08048108  00000108  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, DATA
  2 .data         00000004  0804a000  0804a000  00001000  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  3 .comment      0000002c  00000000  00000000  00001004  2**0
                  CONTENTS, READONLY
</pre>
</div>
</div>
