books/程序员的自我修养.org
** 重定位

#+begin_src bash
objdump -d a.o

a.o:     file format elf32-i386


Disassembly of section .text:

00000000 <main>:
   0:	8d 4c 24 04          	lea    0x4(%esp),%ecx
   4:	83 e4 f0             	and    $0xfffffff0,%esp
   7:	ff 71 fc             	pushl  -0x4(%ecx)
   a:	55                   	push   %ebp
   b:	89 e5                	mov    %esp,%ebp
   d:	51                   	push   %ecx
   e:	83 ec 14             	sub    $0x14,%esp
  11:	c7 45 f4 64 00 00 00 	movl   $0x64,-0xc(%ebp)
  18:	83 ec 08             	sub    $0x8,%esp
  1b:	68 00 00 00 00       	push   $0x0
  20:	8d 45 f4             	lea    -0xc(%ebp),%eax
  23:	50                   	push   %eax
  24:	e8 fc ff ff ff       	call   25 <main+0x25>
  29:	83 c4 10             	add    $0x10,%esp
  2c:	b8 00 00 00 00       	mov    $0x0,%eax
  31:	8b 4d fc             	mov    -0x4(%ebp),%ecx
  34:	c9                   	leave  
  35:	8d 61 fc             	lea    -0x4(%ecx),%esp
  38:	c3                   	ret 
#+end_src

- 68 *00 00 00 00*, 这个是shared的地址，重定位前是0
- e8 *fc ff ff ff*, 这个是swap的地址，重定位前是-4相对偏移，也就是本身

#+begin_src bash
objdump -d ab

ab:     file format elf32-i386


Disassembly of section .text:

08048094 <main>:
 8048094:	8d 4c 24 04          	lea    0x4(%esp),%ecx
 8048098:	83 e4 f0             	and    $0xfffffff0,%esp
 804809b:	ff 71 fc             	pushl  -0x4(%ecx)
 804809e:	55                   	push   %ebp
 804809f:	89 e5                	mov    %esp,%ebp
 80480a1:	51                   	push   %ecx
 80480a2:	83 ec 14             	sub    $0x14,%esp
 80480a5:	c7 45 f4 64 00 00 00 	movl   $0x64,-0xc(%ebp)
 80480ac:	83 ec 08             	sub    $0x8,%esp
 80480af:	68 00 a0 04 08       	push   $0x804a000
 80480b4:	8d 45 f4             	lea    -0xc(%ebp),%eax
 80480b7:	50                   	push   %eax
 80480b8:	e8 10 00 00 00       	call   80480cd <swap>
 80480bd:	83 c4 10             	add    $0x10,%esp
 80480c0:	b8 00 00 00 00       	mov    $0x0,%eax
 80480c5:	8b 4d fc             	mov    -0x4(%ebp),%ecx
 80480c8:	c9                   	leave  
 80480c9:	8d 61 fc             	lea    -0x4(%ecx),%esp
 80480cc:	c3                   	ret   


080480cd <swap>:
 80480cd:	55                   	push   %ebp
#+end_src

- 68 *00 a0 04 08*, 这个是shared的地址，重定位后是0x0804a000
- e8 *10 00 00 00*, 这个是swap的地址，重定位前是+0x10相对偏移，也就是swap的开始

** 重定位表

- ".rel." 开头是重定位表
- 段表里的info指定要重定位的段
- 组成
| r_offset | 相对偏移                                                                                       |
| r_info   | 低8位为重定位类型， R_386_32为绝对寻址，R_386_PC32为相对寻址修正, 高24位为符号在符号表里的下标 |
- 重定位项在符号表里的类型为UND
- 对于弱符号，由于不知道最终大小是多少，所以不能放在bss段，要放在COMMON段等链接时决议，这说明不在COMMON段的全局变量符号都是强符号

#+begin_src bash

readelf -r a.o

Relocation section '.rel.text' at offset 0x1a8 contains 2 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
0000001c  00000901 R_386_32          00000000   shared
00000025  00000a02 R_386_PC32        00000000   swap

Relocation section '.rel.eh_frame' at offset 0x1b8 contains 1 entry:
 Offset     Info    Type            Sym.Value  Sym. Name
00000020  00000202 R_386_PC32        00000000   .text

#+end_src

C++特性编译实现
- template，虚函数表，每个实例在单独一个段中，链接时Link Once，实现重复代码消除
- -ffunction-sections和-fdata-sections可能实现函数级链接而非文件级链接
- 全局对象构造和析构分别存在.init和.fini段在main前和后执行

ABI
| Name | Desc           |
|------+----------------|
| API  | 源代码级的接口 |
| ABI  | 二进制级的接口 |

objdump -t 查看静态库符号表
ar -t      查看打包文件
ar -x      解压
gcc -static 静态链接库
gcc --verbose 打印详细信息

