程序员的自我修养.html

<div id="outline-container-org6a34959" class="outline-3">
<h3 id="org6a34959"><span class="section-number-3">4.1</span> 重定位</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-bash">objdump -d a.o

a.o:     file format elf32-i386


Disassembly of section .text:

00000000 &lt;main&gt;:
   0:   8d 4c 24 04             lea    0x4(%esp),%ecx
   4:   83 e4 f0                and    $<span style="color: #FD971F;">0</span>xfffffff0,%esp
   7:   ff 71 fc                pushl  -0x4(%ecx)
   a:   55                      push   %ebp
   b:   89 e5                   mov    %esp,%ebp
   d:   51                      push   %ecx
   e:   83 ec 14                sub    $<span style="color: #FD971F;">0</span>x14,%esp
  11:   c7 45 f4 64 00 00 00    movl   $<span style="color: #FD971F;">0</span>x64,-0xc(%ebp)
  18:   83 ec 08                sub    $<span style="color: #FD971F;">0</span>x8,%esp
  1b:   68 00 00 00 00          push   $<span style="color: #FD971F;">0</span>x0
  20:   8d 45 f4                lea    -0xc(%ebp),%eax
  23:   50                      push   %eax
  24:   e8 fc ff ff ff          call   25 &lt;main+0x25&gt;
  29:   83 c4 10                add    $<span style="color: #FD971F;">0</span>x10,%esp
  2c:   b8 00 00 00 00          mov    $<span style="color: #FD971F;">0</span>x0,%eax
  31:   8b 4d fc                mov    -0x4(%ebp),%ecx
  34:   c9                      leave  
  35:   8d 61 fc                lea    -0x4(%ecx),%esp
  38:   c3                      ret 
</pre>
</div>

<ul class="org-ul">
<li>68 <b>00 00 00 00</b>, 这个是shared的地址，重定位前是0<br /></li>
<li>e8 <b>fc ff ff ff</b>, 这个是swap的地址，重定位前是-4相对偏移，也就是本身<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">objdump -d ab

ab:     file format elf32-i386


Disassembly of section .text:

08048094 &lt;main&gt;:
 8048094:   8d 4c 24 04             lea    0x4(%esp),%ecx
 8048098:   83 e4 f0                and    $<span style="color: #FD971F;">0</span>xfffffff0,%esp
 804809b:   ff 71 fc                pushl  -0x4(%ecx)
 804809e:   55                      push   %ebp
 804809f:   89 e5                   mov    %esp,%ebp
 80480a1:   51                      push   %ecx
 80480a2:   83 ec 14                sub    $<span style="color: #FD971F;">0</span>x14,%esp
 80480a5:   c7 45 f4 64 00 00 00    movl   $<span style="color: #FD971F;">0</span>x64,-0xc(%ebp)
 80480ac:   83 ec 08                sub    $<span style="color: #FD971F;">0</span>x8,%esp
 80480af:   68 00 a0 04 08          push   $<span style="color: #FD971F;">0</span>x804a000
 80480b4:   8d 45 f4                lea    -0xc(%ebp),%eax
 80480b7:   50                      push   %eax
 80480b8:   e8 10 00 00 00          call   80480cd &lt;swap&gt;
 80480bd:   83 c4 10                add    $<span style="color: #FD971F;">0</span>x10,%esp
 80480c0:   b8 00 00 00 00          mov    $<span style="color: #FD971F;">0</span>x0,%eax
 80480c5:   8b 4d fc                mov    -0x4(%ebp),%ecx
 80480c8:   c9                      leave  
 80480c9:   8d 61 fc                lea    -0x4(%ecx),%esp
 80480cc:   c3                      ret   


080480cd &lt;swap&gt;:
 80480cd:   55                      push   %ebp
</pre>
</div>

<ul class="org-ul">
<li>68 <b>00 a0 04 08</b>, 这个是shared的地址，重定位后是0x0804a000<br /></li>
<li>e8 <b>10 00 00 00</b>, 这个是swap的地址，重定位前是+0x10相对偏移，也就是swap的开始<br /></li>
</ul>
</div>
</div>

<div id="outline-container-org8bd3340" class="outline-3">
<h3 id="org8bd3340"><span class="section-number-3">4.2</span> 重定位表</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>".rel." 开头是重定位表<br /></li>
<li>段表里的info指定要重定位的段<br /></li>
<li>组成<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">r_offset</td>
<td class="org-left">相对偏移</td>
</tr>

<tr>
<td class="org-left">r_info</td>
<td class="org-left">低8位为重定位类型， R_386_32为绝对寻址，R_386_PC32为相对寻址修正, 高24位为符号在符号表里的下标</td>
</tr>
</tbody>
</table>
<ul class="org-ul">
<li>重定位项在符号表里的类型为UND<br /></li>
<li>对于弱符号，由于不知道最终大小是多少，所以不能放在bss段，要放在COMMON段等链接时决议，这说明不在COMMON段的全局变量符号都是强符号<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash">
readelf -r a.o

Relocation section <span style="color: #E6DB74;">'.rel.text'</span> at offset 0x1a8 contains 2 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
0000001c  00000901 R_386_32          00000000   shared
00000025  00000a02 R_386_PC32        00000000   swap

Relocation section <span style="color: #E6DB74;">'.rel.eh_frame'</span> at offset 0x1b8 contains 1 entry:
 Offset     Info    Type            Sym.Value  Sym. Name
00000020  00000202 R_386_PC32        00000000   .text

</pre>
</div>

<p>
C++特性编译实现<br />
</p>
<ul class="org-ul">
<li>template，虚函数表，每个实例在单独一个段中，链接时Link Once，实现重复代码消除<br /></li>
<li>-ffunction-sections和-fdata-sections可能实现函数级链接而非文件级链接<br /></li>
<li>全局对象构造和析构分别存在.init和.fini段在main前和后执行<br /></li>
</ul>

<p>
ABI<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Desc</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">API</td>
<td class="org-left">源代码级的接口</td>
</tr>

<tr>
<td class="org-left">ABI</td>
<td class="org-left">二进制级的接口</td>
</tr>
</tbody>
</table>

<p>
objdump -t 查看静态库符号表<br />
ar -t      查看打包文件<br />
ar -x      解压<br />
gcc -static 静态链接库<br />
gcc &#x2013;verbose 打印详细信息<br />
</p>
</div>
</div>
