books/程序员的自我修养.org
** 链接控制脚本
使用命令控制链接过程
#+begin_src c
  # gcc -m32 -c -fno-builtin tiny.c
  # ld -static -e nomain -o tiny tiny.o -m elf_i386
  char *str = "Hello world!\n";

  void print()
  {
      asm("movl $13, %%edx \n\t"
          "movl %0, %%ecx \n\t"
          "movl $0, %%ebx \n\t"
          "movl $4, %%eax \n\t"
          "int $0x80      \n\t"
          ::"r"(str):"edx","ecx","ebx");
  }

  void exit()
  {
      asm("movl $42, %ebx \n\t"
          "movl $1, %eax  \n\t"
          "int $0x80      \n\t");
  }

  void nomain()
  {
      print();
      exit();
  }
#+end_src
#+begin_src bash
readelf -h tiny
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2's complement, little endian
  Version:                           1 (current)
  OS/ABI:                            UNIX - System V
  ABI Version:                       0
  Type:                              EXEC (Executable file)
  Machine:                           Intel 80386
  Version:                           0x1
  Entry point address:               0x80480c6
  Start of program headers:          52 (bytes into file)
  Start of section headers:          4544 (bytes into file)
  Flags:                             0x0
  Size of this header:               52 (bytes)
  Size of program headers:           32 (bytes)
  Number of program headers:         3
  Size of section headers:           40 (bytes)
  Number of section headers:         9
  Section header string table index: 8

readelf -S tiny
There are 9 section headers, starting at offset 0x11c0:

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .text             PROGBITS        08048094 000094 000042 00  AX  0   0  1
  [ 2] .rodata           PROGBITS        080480d6 0000d6 00000e 00   A  0   0  1
  [ 3] .eh_frame         PROGBITS        080480e4 0000e4 00007c 00   A  0   0  4
  [ 4] .data             PROGBITS        0804a000 001000 000004 00  WA  0   0  4
  [ 5] .comment          PROGBITS        00000000 001004 00002c 01  MS  0   0  1
  [ 6] .symtab           SYMTAB          00000000 001030 000100 10      7   9  4
  [ 7] .strtab           STRTAB          00000000 001130 00004c 00      0   0  1
  [ 8] .shstrtab         STRTAB          00000000 00117c 000042 00      0   0  1
Key to Flags:
  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),
  L (link order), O (extra OS processing required), G (group), T (TLS),
  C (compressed), x (unknown), o (OS specific), E (exclude),
  p (processor specific)
objdump -s -d tiny

tiny:     file format elf32-i386

Contents of section .text:
 8048094 5589e553 a100a004 08ba0d00 000089c1  U..S............
 80480a4 bb000000 00b80400 0000cd80 905b5dc3  .............[].
 80480b4 5589e5bb 2a000000 b8010000 00cd8090  U...*...........
 80480c4 5dc35589 e5e8c6ff ffffe8e1 ffffff90  ].U.............
 80480d4 5dc3                                 ].              
Contents of section .rodata:
 80480d6 48656c6c 6f20776f 726c6421 0a00      Hello world!..  
Contents of section .eh_frame:
 80480e4 14000000 00000000 017a5200 017c0801  .........zR..|..
 80480f4 1b0c0404 88010000 20000000 1c000000  ........ .......
 8048104 90ffffff 20000000 00410e08 8502420d  .... ....A....B.
 8048114 05418303 5ac341c5 0c040400 1c000000  .A..Z.A.........
 8048124 40000000 8cffffff 12000000 00410e08  @............A..
 8048134 8502420d 054ec50c 04040000 1c000000  ..B..N..........
 8048144 60000000 7effffff 10000000 00410e08  `...~........A..
 8048154 8502420d 054cc50c 04040000           ..B..L......    
Contents of section .data:
 804a000 d6800408                             ....            
Contents of section .comment:
 0000 4743433a 2028474e 55292038 2e332e31  GCC: (GNU) 8.3.1
 0010 20323031 39303530 37202852 65642048   20190507 (Red H
 0020 61742038 2e332e31 2d342900           at 8.3.1-4).    

Disassembly of section .text:

08048094 <print>:
 8048094:	55                   	push   %ebp
 8048095:	89 e5                	mov    %esp,%ebp
 8048097:	53                   	push   %ebx
 8048098:	a1 00 a0 04 08       	mov    0x804a000,%eax
 804809d:	ba 0d 00 00 00       	mov    $0xd,%edx
 80480a2:	89 c1                	mov    %eax,%ecx
 80480a4:	bb 00 00 00 00       	mov    $0x0,%ebx
 80480a9:	b8 04 00 00 00       	mov    $0x4,%eax
 80480ae:	cd 80                	int    $0x80
 80480b0:	90                   	nop
 80480b1:	5b                   	pop    %ebx
 80480b2:	5d                   	pop    %ebp
 80480b3:	c3                   	ret    

080480b4 <exit>:
 80480b4:	55                   	push   %ebp
 80480b5:	89 e5                	mov    %esp,%ebp
 80480b7:	bb 2a 00 00 00       	mov    $0x2a,%ebx
 80480bc:	b8 01 00 00 00       	mov    $0x1,%eax
 80480c1:	cd 80                	int    $0x80
 80480c3:	90                   	nop
 80480c4:	5d                   	pop    %ebp
 80480c5:	c3                   	ret    

080480c6 <nomain>:
 80480c6:	55                   	push   %ebp
 80480c7:	89 e5                	mov    %esp,%ebp
 80480c9:	e8 c6 ff ff ff       	call   8048094 <print>
 80480ce:	e8 e1 ff ff ff       	call   80480b4 <exit>
 80480d3:	90                   	nop
 80480d4:	5d                   	pop    %ebp
 80480d5:	c3                   	ret   
#+end_src

使用链接脚本

- 设置当前虚拟地址
- 设置tinytext段，包含.text .data .rodata
- 丢弃.comment段

#+begin_src bash
  # ld -static -T tiny.lds -o tiny tiny.o -m elf_i386
  # tinytext段是WAX属性，因为融合了数据段和代码段
  ENTRY(nomain)

  SECTIONS
  {
      . = 0x08048000 + SIZEOF_HEADERS;
      tinytext  : {*(.text) *(.data) *(.rodata)}
      /DISCARD/ : {*(.comment)}
  }
#+end_src

*可执行文件中，符号表和字符串表是可选的,可被strip,但是段表字符串表为必须*

#+begin_src bash
readelf -h tiny
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2's complement, little endian
  Version:                           1 (current)
  OS/ABI:                            UNIX - System V
  ABI Version:                       0
  Type:                              EXEC (Executable file)
  Machine:                           Intel 80386
  Version:                           0x1
  Entry point address:               0x8048122
  Start of program headers:          52 (bytes into file)
  Start of section headers:          588 (bytes into file)
  Flags:                             0x0
  Size of this header:               52 (bytes)
  Size of program headers:           32 (bytes)
  Number of program headers:         2
  Size of section headers:           40 (bytes)
  Number of section headers:         6
  Section header string table index: 5
readelf -S tiny
There are 6 section headers, starting at offset 0x24c:

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .eh_frame         PROGBITS        08048074 000074 00007c 00   A  0   0  4
  [ 2] tinytext          PROGBITS        080480f0 0000f0 000056 00 WAX  0   0  4
  [ 3] .symtab           SYMTAB          00000000 000148 0000a0 10      4   6  4
  [ 4] .strtab           STRTAB          00000000 0001e8 000034 00      0   0  1
  [ 5] .shstrtab         STRTAB          00000000 00021c 00002e 00      0   0  1
Key to Flags:
  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),
  L (link order), O (extra OS processing required), G (group), T (TLS),
  C (compressed), x (unknown), o (OS specific), E (exclude),
  p (processor specific)

strip tiny
readelf -S tiny
There are 4 section headers, starting at offset 0x164:

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .eh_frame         PROGBITS        08048074 000074 00007c 00   A  0   0  4
  [ 2] tinytext          PROGBITS        080480f0 0000f0 000056 00 WAX  0   0  4
  [ 3] .shstrtab         STRTAB          00000000 000146 00001e 00      0   0  1
Key to Flags:
  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),
  L (link order), O (extra OS processing required), G (group), T (TLS),
  C (compressed), x (unknown), o (OS specific), E (exclude),
  p (processor specific)

#+end_src

语法
- 语句间用";"作分割符
- 表达式与运算符和C一样
+ - * / += -= *= & | >> <<
- 注释和C一样, \slash**\slash
| 命令语句               | 说明                                 |
|------------------------+--------------------------------------|
| ENTRY(symbol)          | 指定入口地址                         |
| STARTUP(filename)      | 文件filename作为链接过程的第一个输入 |
| SEARCH_DIR(path)       | ld库查找路径                         |
| INPUT(file, file, ...) | 链接过程的输入文件                   |
| INCLUDE filename       | 包含filename进链接脚本               |
| PROVIDE(symbol)        | 定义某个符号                         |

在sections中，重要的是file(sections)
#+begin_src bash
SECTIONS
{
    ...
    secname : { file(sections) file(sections) ... }
}
#+end_src
- file1.o(.data) 选中file1.o里的.data段
- file1.o(.data .rodata) 或 file1.o(.data, .rodata) 选中file1.o里的.data和.rodata
- file1.o 选中file1.o的所有段
- *(.data) 所有输入文件(目标文件)里的.data
- [a-z]*(.text*[A-Z]) 类似正则

*代码中解析可执行文件可用bfd库*
#+begin_src c
  /* gcc t.c -lbfd */
  #include <stdio.h>
  #include <bfd.h>
  int main(int argc, char *argv[])
  {
      const char **t = bfd_target_list();
      while(*t) {
          printf("%s\n", *t);
          t++;
      }
      return 0;
  }
#+end_src

