程序员的自我修养.html

<div id="outline-container-org69c1ab0" class="outline-3">
<h3 id="org69c1ab0"><span class="section-number-3">4.3</span> 链接控制脚本</h3>
<div class="outline-text-3" id="text-4-3">
<p>
使用命令控制链接过程<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;"># gcc</span> -m32 -c -fno-builtin tiny.c
<span style="color: #F92672;"># ld</span> -<span style="color: #F92672;">static</span> -e nomain -o tiny tiny.o -m elf_i386
<span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">str</span> = <span style="color: #E6DB74;">"Hello world!\n"</span>;

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">print</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">asm</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"movl $13, %%edx \n\t"</span>
        <span style="color: #E6DB74;">"movl %0, %%ecx \n\t"</span>
        <span style="color: #E6DB74;">"movl $0, %%ebx \n\t"</span>
        <span style="color: #E6DB74;">"movl $4, %%eax \n\t"</span>
        <span style="color: #E6DB74;">"int $0x80      \n\t"</span>
        ::<span style="color: #E6DB74;">"r"</span><span style="color: #A6E22E;">(</span>str<span style="color: #A6E22E;">)</span>:<span style="color: #E6DB74;">"edx"</span>,<span style="color: #E6DB74;">"ecx"</span>,<span style="color: #E6DB74;">"ebx"</span><span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">exit</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">asm</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"movl $42, %ebx \n\t"</span>
        <span style="color: #E6DB74;">"movl $1, %eax  \n\t"</span>
        <span style="color: #E6DB74;">"int $0x80      \n\t"</span><span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">nomain</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">print</span><span style="color: #66D9EF;">()</span>;
    <span style="color: #A6E22E; font-weight: bold;">exit</span><span style="color: #66D9EF;">()</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
<div class="org-src-container">
<pre class="src src-bash">readelf -h tiny
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2<span style="color: #E6DB74;">'s complement, little endian</span>
<span style="color: #E6DB74;">  Version:                           1 (current)</span>
<span style="color: #E6DB74;">  OS/ABI:                            UNIX - System V</span>
<span style="color: #E6DB74;">  ABI Version:                       0</span>
<span style="color: #E6DB74;">  Type:                              EXEC (Executable file)</span>
<span style="color: #E6DB74;">  Machine:                           Intel 80386</span>
<span style="color: #E6DB74;">  Version:                           0x1</span>
<span style="color: #E6DB74;">  Entry point address:               0x80480c6</span>
<span style="color: #E6DB74;">  Start of program headers:          52 (bytes into file)</span>
<span style="color: #E6DB74;">  Start of section headers:          4544 (bytes into file)</span>
<span style="color: #E6DB74;">  Flags:                             0x0</span>
<span style="color: #E6DB74;">  Size of this header:               52 (bytes)</span>
<span style="color: #E6DB74;">  Size of program headers:           32 (bytes)</span>
<span style="color: #E6DB74;">  Number of program headers:         3</span>
<span style="color: #E6DB74;">  Size of section headers:           40 (bytes)</span>
<span style="color: #E6DB74;">  Number of section headers:         9</span>
<span style="color: #E6DB74;">  Section header string table index: 8</span>

<span style="color: #E6DB74;">readelf -S tiny</span>
<span style="color: #E6DB74;">There are 9 section headers, starting at offset 0x11c0:</span>

<span style="color: #E6DB74;">Section Headers:</span>
<span style="color: #E6DB74;">  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al</span>
<span style="color: #E6DB74;">  [ 0]                   NULL            00000000 000000 000000 00      0   0  0</span>
<span style="color: #E6DB74;">  [ 1] .text             PROGBITS        08048094 000094 000042 00  AX  0   0  1</span>
<span style="color: #E6DB74;">  [ 2] .rodata           PROGBITS        080480d6 0000d6 00000e 00   A  0   0  1</span>
<span style="color: #E6DB74;">  [ 3] .eh_frame         PROGBITS        080480e4 0000e4 00007c 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [ 4] .data             PROGBITS        0804a000 001000 000004 00  WA  0   0  4</span>
<span style="color: #E6DB74;">  [ 5] .comment          PROGBITS        00000000 001004 00002c 01  MS  0   0  1</span>
<span style="color: #E6DB74;">  [ 6] .symtab           SYMTAB          00000000 001030 000100 10      7   9  4</span>
<span style="color: #E6DB74;">  [ 7] .strtab           STRTAB          00000000 001130 00004c 00      0   0  1</span>
<span style="color: #E6DB74;">  [ 8] .shstrtab         STRTAB          00000000 00117c 000042 00      0   0  1</span>
<span style="color: #E6DB74;">Key to Flags:</span>
<span style="color: #E6DB74;">  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),</span>
<span style="color: #E6DB74;">  L (link order), O (extra OS processing required), G (group), T (TLS),</span>
<span style="color: #E6DB74;">  C (compressed), x (unknown), o (OS specific), E (exclude),</span>
<span style="color: #E6DB74;">  p (processor specific)</span>
<span style="color: #E6DB74;">objdump -s -d tiny</span>

<span style="color: #E6DB74;">tiny:     file format elf32-i386</span>

<span style="color: #E6DB74;">Contents of section .text:</span>
<span style="color: #E6DB74;"> 8048094 5589e553 a100a004 08ba0d00 000089c1  U..S............</span>
<span style="color: #E6DB74;"> 80480a4 bb000000 00b80400 0000cd80 905b5dc3  .............[].</span>
<span style="color: #E6DB74;"> 80480b4 5589e5bb 2a000000 b8010000 00cd8090  U...*...........</span>
<span style="color: #E6DB74;"> 80480c4 5dc35589 e5e8c6ff ffffe8e1 ffffff90  ].U.............</span>
<span style="color: #E6DB74;"> 80480d4 5dc3                                 ].              </span>
<span style="color: #E6DB74;">Contents of section .rodata:</span>
<span style="color: #E6DB74;"> 80480d6 48656c6c 6f20776f 726c6421 0a00      Hello world!..  </span>
<span style="color: #E6DB74;">Contents of section .eh_frame:</span>
<span style="color: #E6DB74;"> 80480e4 14000000 00000000 017a5200 017c0801  .........zR..|..</span>
<span style="color: #E6DB74;"> 80480f4 1b0c0404 88010000 20000000 1c000000  ........ .......</span>
<span style="color: #E6DB74;"> 8048104 90ffffff 20000000 00410e08 8502420d  .... ....A....B.</span>
<span style="color: #E6DB74;"> 8048114 05418303 5ac341c5 0c040400 1c000000  .A..Z.A.........</span>
<span style="color: #E6DB74;"> 8048124 40000000 8cffffff 12000000 00410e08  @............A..</span>
<span style="color: #E6DB74;"> 8048134 8502420d 054ec50c 04040000 1c000000  ..B..N..........</span>
<span style="color: #E6DB74;"> 8048144 60000000 7effffff 10000000 00410e08  `...~........A..</span>
<span style="color: #E6DB74;"> 8048154 8502420d 054cc50c 04040000           ..B..L......    </span>
<span style="color: #E6DB74;">Contents of section .data:</span>
<span style="color: #E6DB74;"> 804a000 d6800408                             ....            </span>
<span style="color: #E6DB74;">Contents of section .comment:</span>
<span style="color: #E6DB74;"> 0000 4743433a 2028474e 55292038 2e332e31  GCC: (GNU) 8.3.1</span>
<span style="color: #E6DB74;"> 0010 20323031 39303530 37202852 65642048   20190507 (Red H</span>
<span style="color: #E6DB74;"> 0020 61742038 2e332e31 2d342900           at 8.3.1-4).    </span>

<span style="color: #E6DB74;">Disassembly of section .text:</span>

<span style="color: #E6DB74;">08048094 &lt;print&gt;:</span>
<span style="color: #E6DB74;"> 8048094:   55                      push   %ebp</span>
<span style="color: #E6DB74;"> 8048095:   89 e5                   mov    %esp,%ebp</span>
<span style="color: #E6DB74;"> 8048097:   53                      push   %ebx</span>
<span style="color: #E6DB74;"> 8048098:   a1 00 a0 04 08          mov    0x804a000,%eax</span>
<span style="color: #E6DB74;"> 804809d:   ba 0d 00 00 00          mov    $0xd,%edx</span>
<span style="color: #E6DB74;"> 80480a2:   89 c1                   mov    %eax,%ecx</span>
<span style="color: #E6DB74;"> 80480a4:   bb 00 00 00 00          mov    $0x0,%ebx</span>
<span style="color: #E6DB74;"> 80480a9:   b8 04 00 00 00          mov    $0x4,%eax</span>
<span style="color: #E6DB74;"> 80480ae:   cd 80                   int    $0x80</span>
<span style="color: #E6DB74;"> 80480b0:   90                      nop</span>
<span style="color: #E6DB74;"> 80480b1:   5b                      pop    %ebx</span>
<span style="color: #E6DB74;"> 80480b2:   5d                      pop    %ebp</span>
<span style="color: #E6DB74;"> 80480b3:   c3                      ret    </span>

<span style="color: #E6DB74;">080480b4 &lt;exit&gt;:</span>
<span style="color: #E6DB74;"> 80480b4:   55                      push   %ebp</span>
<span style="color: #E6DB74;"> 80480b5:   89 e5                   mov    %esp,%ebp</span>
<span style="color: #E6DB74;"> 80480b7:   bb 2a 00 00 00          mov    $0x2a,%ebx</span>
<span style="color: #E6DB74;"> 80480bc:   b8 01 00 00 00          mov    $0x1,%eax</span>
<span style="color: #E6DB74;"> 80480c1:   cd 80                   int    $0x80</span>
<span style="color: #E6DB74;"> 80480c3:   90                      nop</span>
<span style="color: #E6DB74;"> 80480c4:   5d                      pop    %ebp</span>
<span style="color: #E6DB74;"> 80480c5:   c3                      ret    </span>

<span style="color: #E6DB74;">080480c6 &lt;nomain&gt;:</span>
<span style="color: #E6DB74;"> 80480c6:   55                      push   %ebp</span>
<span style="color: #E6DB74;"> 80480c7:   89 e5                   mov    %esp,%ebp</span>
<span style="color: #E6DB74;"> 80480c9:   e8 c6 ff ff ff          call   8048094 &lt;print&gt;</span>
<span style="color: #E6DB74;"> 80480ce:   e8 e1 ff ff ff          call   80480b4 &lt;exit&gt;</span>
<span style="color: #E6DB74;"> 80480d3:   90                      nop</span>
<span style="color: #E6DB74;"> 80480d4:   5d                      pop    %ebp</span>
<span style="color: #E6DB74;"> 80480d5:   c3                      ret   </span>
</pre>
</div>

<p>
使用链接脚本<br />
</p>

<ul class="org-ul">
<li>设置当前虚拟地址<br /></li>
<li>设置tinytext段，包含.text .data .rodata<br /></li>
<li>丢弃.comment段<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-bash"><span style="color: #75715E;"># </span><span style="color: #E6DB74;">ld -static -T tiny.lds -o tiny tiny.o -m elf_i386</span>
<span style="color: #75715E;"># </span><span style="color: #E6DB74;">tinytext&#27573;&#26159;WAX&#23646;&#24615;&#65292;&#22240;&#20026;&#34701;&#21512;&#20102;&#25968;&#25454;&#27573;&#21644;&#20195;&#30721;&#27573;</span>
<span style="color: #A6E22E; font-size: 130%;">ENTRY</span>(nomain)

SECTIONS
{
    <span style="color: #F92672;">.</span> = 0x08048000 + SIZEOF_HEADERS;
    tinytext  : {*(.text) *(.data) *(.rodata)}
    /DISCARD/ : {*(.comment)}
}
</pre>
</div>

<p>
<b>可执行文件中，符号表和字符串表是可选的,可被strip,但是段表字符串表为必须</b><br />
</p>

<div class="org-src-container">
<pre class="src src-bash">readelf -h tiny
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00 
  Class:                             ELF32
  Data:                              2<span style="color: #E6DB74;">'s complement, little endian</span>
<span style="color: #E6DB74;">  Version:                           1 (current)</span>
<span style="color: #E6DB74;">  OS/ABI:                            UNIX - System V</span>
<span style="color: #E6DB74;">  ABI Version:                       0</span>
<span style="color: #E6DB74;">  Type:                              EXEC (Executable file)</span>
<span style="color: #E6DB74;">  Machine:                           Intel 80386</span>
<span style="color: #E6DB74;">  Version:                           0x1</span>
<span style="color: #E6DB74;">  Entry point address:               0x8048122</span>
<span style="color: #E6DB74;">  Start of program headers:          52 (bytes into file)</span>
<span style="color: #E6DB74;">  Start of section headers:          588 (bytes into file)</span>
<span style="color: #E6DB74;">  Flags:                             0x0</span>
<span style="color: #E6DB74;">  Size of this header:               52 (bytes)</span>
<span style="color: #E6DB74;">  Size of program headers:           32 (bytes)</span>
<span style="color: #E6DB74;">  Number of program headers:         2</span>
<span style="color: #E6DB74;">  Size of section headers:           40 (bytes)</span>
<span style="color: #E6DB74;">  Number of section headers:         6</span>
<span style="color: #E6DB74;">  Section header string table index: 5</span>
<span style="color: #E6DB74;">readelf -S tiny</span>
<span style="color: #E6DB74;">There are 6 section headers, starting at offset 0x24c:</span>

<span style="color: #E6DB74;">Section Headers:</span>
<span style="color: #E6DB74;">  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al</span>
<span style="color: #E6DB74;">  [ 0]                   NULL            00000000 000000 000000 00      0   0  0</span>
<span style="color: #E6DB74;">  [ 1] .eh_frame         PROGBITS        08048074 000074 00007c 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [ 2] tinytext          PROGBITS        080480f0 0000f0 000056 00 WAX  0   0  4</span>
<span style="color: #E6DB74;">  [ 3] .symtab           SYMTAB          00000000 000148 0000a0 10      4   6  4</span>
<span style="color: #E6DB74;">  [ 4] .strtab           STRTAB          00000000 0001e8 000034 00      0   0  1</span>
<span style="color: #E6DB74;">  [ 5] .shstrtab         STRTAB          00000000 00021c 00002e 00      0   0  1</span>
<span style="color: #E6DB74;">Key to Flags:</span>
<span style="color: #E6DB74;">  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),</span>
<span style="color: #E6DB74;">  L (link order), O (extra OS processing required), G (group), T (TLS),</span>
<span style="color: #E6DB74;">  C (compressed), x (unknown), o (OS specific), E (exclude),</span>
<span style="color: #E6DB74;">  p (processor specific)</span>

<span style="color: #E6DB74;">strip tiny</span>
<span style="color: #E6DB74;">readelf -S tiny</span>
<span style="color: #E6DB74;">There are 4 section headers, starting at offset 0x164:</span>

<span style="color: #E6DB74;">Section Headers:</span>
<span style="color: #E6DB74;">  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al</span>
<span style="color: #E6DB74;">  [ 0]                   NULL            00000000 000000 000000 00      0   0  0</span>
<span style="color: #E6DB74;">  [ 1] .eh_frame         PROGBITS        08048074 000074 00007c 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [ 2] tinytext          PROGBITS        080480f0 0000f0 000056 00 WAX  0   0  4</span>
<span style="color: #E6DB74;">  [ 3] .shstrtab         STRTAB          00000000 000146 00001e 00      0   0  1</span>
<span style="color: #E6DB74;">Key to Flags:</span>
<span style="color: #E6DB74;">  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),</span>
<span style="color: #E6DB74;">  L (link order), O (extra OS processing required), G (group), T (TLS),</span>
<span style="color: #E6DB74;">  C (compressed), x (unknown), o (OS specific), E (exclude),</span>
<span style="color: #E6DB74;">  p (processor specific)</span>

</pre>
</div>

<p>
语法<br />
</p>
<ul class="org-ul">
<li>语句间用";"作分割符<br /></li>
<li>表达式与运算符和C一样<br /></li>
<li>- * / += -= *= &amp; | &gt;&gt; &lt;&lt;<br /></li>
<li>注释和C一样, /**/<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">命令语句</th>
<th scope="col" class="org-left">说明</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">ENTRY(symbol)</td>
<td class="org-left">指定入口地址</td>
</tr>

<tr>
<td class="org-left">STARTUP(filename)</td>
<td class="org-left">文件filename作为链接过程的第一个输入</td>
</tr>

<tr>
<td class="org-left">SEARCH_DIR(path)</td>
<td class="org-left">ld库查找路径</td>
</tr>

<tr>
<td class="org-left">INPUT(file, file, &#x2026;)</td>
<td class="org-left">链接过程的输入文件</td>
</tr>

<tr>
<td class="org-left">INCLUDE filename</td>
<td class="org-left">包含filename进链接脚本</td>
</tr>

<tr>
<td class="org-left">PROVIDE(symbol)</td>
<td class="org-left">定义某个符号</td>
</tr>
</tbody>
</table>

<p>
在sections中，重要的是file(sections)<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">SECTIONS
{
    ...
    secname : { file(sections) file(sections) ... }
}
</pre>
</div>
<ul class="org-ul">
<li>file1.o(.data) 选中file1.o里的.data段<br /></li>
<li>file1.o(.data .rodata) 或 file1.o(.data, .rodata) 选中file1.o里的.data和.rodata<br /></li>
<li>file1.o 选中file1.o的所有段<br /></li>
<li>*(.data) 所有输入文件(目标文件)里的.data<br /></li>
<li>[a-z]*(.text*[A-Z]) 类似正则<br /></li>
</ul>

<p>
<b>代码中解析可执行文件可用bfd库</b><br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #75715E;">/* </span><span style="color: #E6DB74;">gcc t.c -lbfd </span><span style="color: #75715E;">*/</span>
<span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">stdio.h</span><span style="color: #AE81FF;">&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">bfd.h</span><span style="color: #AE81FF;">&gt;</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span><span style="color: #66D9EF;">[]</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">const</span> <span style="color: #66D9EF;">char</span> **<span style="color: #FD971F;">t</span> = <span style="color: #A6E22E; font-weight: bold;">bfd_target_list</span><span style="color: #66D9EF;">()</span>;
    <span style="color: #A6E22E; font-weight: bold;">while</span><span style="color: #66D9EF;">(</span>*t<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"%s\n"</span>, *t<span style="color: #A6E22E;">)</span>;
        t++;
    <span style="color: #66D9EF;">}</span>
    <span style="color: #F92672;">return</span> 0;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
</div>
