books/程序员的自我修养.org
* 第五章 WindowPE/COFF
略

* 第六章 可执行方主席件的装载与进程
默认32位CPU linux进程虚拟地址空间
| 0x00000000 - 0xBFFFFFFF | User Process     |
| 0xC0000000 - 0xFFFFFFFF | Operating System |

PAE(Physical Address Extension) 虚拟地址空间32位不变,物理地址为36位
- 使用mmap，不同时间用相同虚拟地址空间映射不同的物理地址

装载 - 所需内存大于物理内存时从磁盘换入, 实际使用会降低性能，所以 *实时性要求高的都关掉了*
- 覆盖装入(Overlay) - 早期解决方案
1. 手工编写辅助代码管理内存覆盖
2. 树状结构，任何模块到根为调用路径
3. 禁止跨树间调用
- 页映射(Paging), 为主流操作系统所用
1. 默认4K一页
2. 以页为单位分割虚拟和物理内存
3. linux下流程为 产生缺页中断，kernel查看页映射，如果存在，则从磁盘换入，被换出的页有算法

进程建立
- 创建虚拟空间
复制父进程的页映射，设为只读，产生页错误再去设置物理内存与虚拟内存的映射(没有exec前)，称为写时复制
- 读取可执行文件头，建立虚拟空间与可执行文件映射关系
exec时，建立虚拟内存和文件的映射，这样产生缺页时，如果访问的是可执行文件里的段,可以知道程序需要的页在文件中的位置，称之为VMA
- CPU指令寄存器设为可执行文件的entry point，运行

