程序员的自我修养.html

<div id="outline-container-org661cd46" class="outline-2">
<h2 id="org661cd46"><span class="section-number-2">5</span> 第五章 WindowPE/COFF</h2>
<div class="outline-text-2" id="text-5">
<p>
略<br />
</p>
</div>
</div>

<div id="outline-container-orgc6b49ce" class="outline-2">
<h2 id="orgc6b49ce"><span class="section-number-2">6</span> 第六章 可执行方主席件的装载与进程</h2>
<div class="outline-text-2" id="text-6">
<p>
默认32位CPU linux进程虚拟地址空间<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">0x00000000 - 0xBFFFFFFF</td>
<td class="org-left">User Process</td>
</tr>

<tr>
<td class="org-left">0xC0000000 - 0xFFFFFFFF</td>
<td class="org-left">Operating System</td>
</tr>
</tbody>
</table>

<p>
PAE(Physical Address Extension) 虚拟地址空间32位不变,物理地址为36位<br />
</p>
<ul class="org-ul">
<li>使用mmap，不同时间用相同虚拟地址空间映射不同的物理地址<br /></li>
</ul>

<p>
装载 - 所需内存大于物理内存时从磁盘换入, 实际使用会降低性能，所以 <b>实时性要求高的都关掉了</b><br />
</p>
<ul class="org-ul">
<li>覆盖装入(Overlay) - 早期解决方案<br /></li>
<li>手工编写辅助代码管理内存覆盖<br /></li>
<li>树状结构，任何模块到根为调用路径<br /></li>
<li>禁止跨树间调用<br /></li>
<li>页映射(Paging), 为主流操作系统所用<br /></li>
<li>默认4K一页<br /></li>
<li>以页为单位分割虚拟和物理内存<br /></li>
<li>linux下流程为 产生缺页中断，kernel查看页映射，如果存在，则从磁盘换入，被换出的页有算法<br /></li>
</ul>

<p>
进程建立<br />
</p>
<ul class="org-ul">
<li>创建虚拟空间<br /></li>
</ul>
<p>
复制父进程的页映射，设为只读，产生页错误再去设置物理内存与虚拟内存的映射(没有exec前)，称为写时复制<br />
</p>
<ul class="org-ul">
<li>读取可执行文件头，建立虚拟空间与可执行文件映射关系<br /></li>
</ul>
<p>
exec时，建立虚拟内存和文件的映射，这样产生缺页时，如果访问的是可执行文件里的段,可以知道程序需要的页在文件中的位置，称之为VMA<br />
</p>
<ul class="org-ul">
<li>CPU指令寄存器设为可执行文件的entry point，运行<br /></li>
</ul>
</div>
