books/程序员的自我修养.org
** 进程虚存空间分布
操作系统装载时只关心页的权限，所以不同段同一个权限可在同一个段，即由Section统一成Segment，操作系统以Segment为单位进行装载
| 基于Section | 链接视图 |
| 基于Segment | 装载视图 |

#+begin_src c
  /* gcc -m32 1.c -Wno-implicit-function-declaration */
  #include <stdio.h>
  int main(int argc, char *argv[])
  {
      while (1) {
          sleep(1000);
      }
      return 0;
  }
#+end_src

- LOAD类型会被映射
- 一般起码有两个段,一个是可读可执行，一个是可读可写
- memse比filesz大，是因为bss段
- kernel load的实际mapping可能和elf里的VMA不一一对应，但只要保证权限和所有需要装载的地址都对就可以
- ELF里的程序头表结构
| Name     | Description                 |
|----------+-----------------------------|
| p_type   | 类型, LOAD为1               |
| p_offset | 文件偏移                    |
| p_vaddr  | Segment虚拟地址             |
| p_paddr  | 一般和vaddr一致             |
| p_filesz | 文件占用长度                |
| p_memse  | 虚拟地址空间长度，不装载为0 |
| p_flags  | 权限                        |
| p_align  | 对齐                        |

#+begin_src bash
readelf -h a.out
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00
  Class:                             ELF32
  Data:                              2's complement, little endian
  Version:                           1 (current)
  OS/ABI:                            UNIX - System V
  ABI Version:                       0
  Type:                              EXEC (Executable file)
  Machine:                           Intel 80386
  Version:                           0x1
  Entry point address:               0x8048370
  Start of program headers:          52 (bytes into file)
  Start of section headers:          13692 (bytes into file)
  Flags:                             0x0
  Size of this header:               52 (bytes)
  Size of program headers:           32 (bytes)
  Number of program headers:         9
  Size of section headers:           40 (bytes)
  Number of section headers:         30
  Section header string table index: 29

readelf -S a.out
There are 30 section headers, starting at offset 0x357c:

Section Headers:
  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al
  [ 0]                   NULL            00000000 000000 000000 00      0   0  0
  [ 1] .interp           PROGBITS        08048154 000154 000013 00   A  0   0  1
  [ 2] .note.ABI-tag     NOTE            08048168 000168 000020 00   A  0   0  4
  [ 3] .note.gnu.build-i NOTE            08048188 000188 000024 00   A  0   0  4
  [ 4] .gnu.hash         GNU_HASH        080481ac 0001ac 000020 04   A  5   0  4
  [ 5] .dynsym           DYNSYM          080481cc 0001cc 000070 10   A  6   1  4
  [ 6] .dynstr           STRTAB          0804823c 00023c 000081 00   A  0   0  1
  [ 7] .gnu.version      VERSYM          080482be 0002be 00000e 02   A  5   0  2
  [ 8] .gnu.version_r    VERNEED         080482cc 0002cc 000020 00   A  6   1  4
  [ 9] .rel.dyn          REL             080482ec 0002ec 000018 08   A  5   0  4
  [10] .rel.plt          REL             08048304 000304 000010 08  AI  5  22  4
  [11] .init             PROGBITS        08048314 000314 000024 00  AX  0   0  4
  [12] .plt              PROGBITS        08048340 000340 000030 04  AX  0   0 16
  [13] .text             PROGBITS        08048370 000370 0001c5 00  AX  0   0 16
  [14] .fini             PROGBITS        08048538 000538 000018 00  AX  0   0  4
  [15] .rodata           PROGBITS        08048550 000550 00000c 00   A  0   0  4
  [16] .eh_frame_hdr     PROGBITS        0804855c 00055c 00003c 00   A  0   0  4
  [17] .eh_frame         PROGBITS        08048598 000598 0000ec 00   A  0   0  4
  [18] .init_array       INIT_ARRAY      08049f04 000f04 000004 04  WA  0   0  4
  [19] .fini_array       FINI_ARRAY      08049f08 000f08 000004 04  WA  0   0  4
  [20] .dynamic          DYNAMIC         08049f0c 000f0c 0000e8 08  WA  6   0  4
  [21] .got              PROGBITS        08049ff4 000ff4 00000c 04  WA  0   0  4
  [22] .got.plt          PROGBITS        0804a000 001000 000014 04  WA  0   0  4
  [23] .data             PROGBITS        0804a014 001014 000004 00  WA  0   0  1
  [24] .bss              NOBITS          0804a018 001018 000004 00  WA  0   0  1
  [25] .comment          PROGBITS        00000000 001018 00002c 01  MS  0   0  1
  [26] .gnu.build.attrib NOTE            0804a01c 001044 00172c 00      0   0  4
  [27] .symtab           SYMTAB          00000000 002770 000690 10     28  82  4
  [28] .strtab           STRTAB          00000000 002e00 000665 00      0   0  1
  [29] .shstrtab         STRTAB          00000000 003465 000117 00      0   0  1
Key to Flags:
  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),
  L (link order), O (extra OS processing required), G (group), T (TLS),
  C (compressed), x (unknown), o (OS specific), E (exclude),
  p (processor specific)

readelf -l a.out

Elf file type is EXEC (Executable file)
Entry point 0x8048370
There are 9 program headers, starting at offset 52

Program Headers:
  Type           Offset   VirtAddr   PhysAddr   FileSiz MemSiz  Flg Align
  PHDR           0x000034 0x08048034 0x08048034 0x00120 0x00120 R   0x4
  INTERP         0x000154 0x08048154 0x08048154 0x00013 0x00013 R   0x1
      [Requesting program interpreter: /lib/ld-linux.so.2]
  LOAD           0x000000 0x08048000 0x08048000 0x00684 0x00684 R E 0x1000
  LOAD           0x000f04 0x08049f04 0x08049f04 0x00114 0x00118 RW  0x1000
  DYNAMIC        0x000f0c 0x08049f0c 0x08049f0c 0x000e8 0x000e8 RW  0x4
  NOTE           0x000168 0x08048168 0x08048168 0x00044 0x00044 R   0x4
  GNU_EH_FRAME   0x00055c 0x0804855c 0x0804855c 0x0003c 0x0003c R   0x4
  GNU_STACK      0x000000 0x00000000 0x00000000 0x00000 0x00000 RW  0x10
  GNU_RELRO      0x000f04 0x08049f04 0x08049f04 0x000fc 0x000fc R   0x1

 Section to Segment mapping:
  Segment Sections...
   00     
   01     .interp 
   02     .interp .note.ABI-tag .note.gnu.build-id .gnu.hash .dynsym .dynstr .gnu.version .gnu.version_r .rel.dyn .rel.plt .init .plt .text .fini .rodata .eh_frame_hdr .eh_frame 
   03     .init_array .fini_array .dynamic .got .got.plt .data .bss 
   04     .dynamic 
   05     .note.ABI-tag .note.gnu.build-id 
   06     .eh_frame_hdr 
   07     
   08     .init_array .fini_array .dynamic .got

./a.out &
[1] 22024
cat /proc/22024/map
map_files/ maps       
[xuali2@sha-isbu-ed15n xuali2]$cat /proc/22024/maps
08048000-08049000 r-xp 00000000 00:41 94267115                           /auto/isbu_crdc_sw1/offlinediag/users/xuali2/a.out
08049000-0804a000 r--p 00000000 00:41 94267115                           /auto/isbu_crdc_sw1/offlinediag/users/xuali2/a.out
0804a000-0804b000 rw-p 00001000 00:41 94267115                           /auto/isbu_crdc_sw1/offlinediag/users/xuali2/a.out
f7d75000-f7f16000 r-xp 00000000 fd:00 8820257                            /usr/lib/libc-2.28.so
f7f16000-f7f17000 ---p 001a1000 fd:00 8820257                            /usr/lib/libc-2.28.so
f7f17000-f7f19000 r--p 001a1000 fd:00 8820257                            /usr/lib/libc-2.28.so
f7f19000-f7f1a000 rw-p 001a3000 fd:00 8820257                            /usr/lib/libc-2.28.so
f7f1a000-f7f1f000 rw-p 00000000 00:00 0 
f7f39000-f7f3c000 r--p 00000000 00:00 0                                  [vvar]
f7f3c000-f7f3e000 r-xp 00000000 00:00 0                                  [vdso]
f7f3e000-f7f66000 r-xp 00000000 fd:00 8820250                            /usr/lib/ld-2.28.so
f7f66000-f7f67000 r--p 00027000 fd:00 8820250                            /usr/lib/ld-2.28.so
f7f67000-f7f68000 rw-p 00028000 fd:00 8820250                             /usr/lib/ld-2.28.so
ffd33000-ffd54000 rw-p 00000000 00:00 0                                  [stack]
#+end_src

*可将同一个物理页面映射多次，每次权限不一致，这样防止大量的内部碎片*
例子:
| Name     | Size | Physical Addr | File Offset | Virtual addr offset |
|----------+------+---------------+-------------+---------------------|
| Segment0 | 2K   |        0x0000 |           0 |                   0 |
| Segment1 | 2K   |        0x1000 |       0x800 |                   0 |
变为
| Name     | Size | Physical Addr | File Offset | Virtual addr offset |
|----------+------+---------------+-------------+---------------------|
| Segment0 | 2K   |        0x0000 |           0 |                   0 |
| Segment1 | 2K   |        0x0000 |       0x800 |               0x800 |
这样，节约了一个页

*p_vaddr % align == p_offset % align*, 这样可能尽可能的在相邻segment间共享一个物理页

*对于多次映射大段物理内存，不能一个用4K分页，一个以16K分页，这种会报错*

内核加载ELF的过程load_elf_binary()
- 检测ELF文件有效性
- 寻找".interp"动态链接段，设置动态链接器的路径
- 根据ELF头，建立映射代码、数据、只读的数据结构
- 初始化ELF进程环境
- 将系统调用的返回地址修改成ELF可执行文件入口点，这样回到用户态时新程序开始执行
动态链接的ELF入口是动态链接器
静态链接的ELF入口是文件头里的entry

