程序员的自我修养.html

<div id="outline-container-org1da1e70" class="outline-3">
<h3 id="org1da1e70"><span class="section-number-3">6.1</span> 进程虚存空间分布</h3>
<div class="outline-text-3" id="text-6-1">
<p>
操作系统装载时只关心页的权限，所以不同段同一个权限可在同一个段，即由Section统一成Segment，操作系统以Segment为单位进行装载<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">基于Section</td>
<td class="org-left">链接视图</td>
</tr>

<tr>
<td class="org-left">基于Segment</td>
<td class="org-left">装载视图</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #75715E;">/* </span><span style="color: #E6DB74;">gcc -m32 1.c -Wno-implicit-function-declaration </span><span style="color: #75715E;">*/</span>
<span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">stdio.h</span><span style="color: #AE81FF;">&gt;</span>
<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span><span style="color: #66D9EF;">[]</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">while</span> <span style="color: #66D9EF;">(</span>1<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #A6E22E; font-weight: bold;">sleep</span><span style="color: #A6E22E;">(</span>1000<span style="color: #A6E22E;">)</span>;
    <span style="color: #66D9EF;">}</span>
    <span style="color: #F92672;">return</span> 0;
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<ul class="org-ul">
<li>LOAD类型会被映射<br /></li>
<li>一般起码有两个段,一个是可读可执行，一个是可读可写<br /></li>
<li>memse比filesz大，是因为bss段<br /></li>
<li>kernel load的实际mapping可能和elf里的VMA不一一对应，但只要保证权限和所有需要装载的地址都对就可以<br /></li>
<li>ELF里的程序头表结构<br /></li>
</ul>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Description</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">p_type</td>
<td class="org-left">类型, LOAD为1</td>
</tr>

<tr>
<td class="org-left">p_offset</td>
<td class="org-left">文件偏移</td>
</tr>

<tr>
<td class="org-left">p_vaddr</td>
<td class="org-left">Segment虚拟地址</td>
</tr>

<tr>
<td class="org-left">p_paddr</td>
<td class="org-left">一般和vaddr一致</td>
</tr>

<tr>
<td class="org-left">p_filesz</td>
<td class="org-left">文件占用长度</td>
</tr>

<tr>
<td class="org-left">p_memse</td>
<td class="org-left">虚拟地址空间长度，不装载为0</td>
</tr>

<tr>
<td class="org-left">p_flags</td>
<td class="org-left">权限</td>
</tr>

<tr>
<td class="org-left">p_align</td>
<td class="org-left">对齐</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-bash">readelf -h a.out
ELF Header:
  Magic:   7f 45 4c 46 01 01 01 00 00 00 00 00 00 00 00 00
  Class:                             ELF32
  Data:                              2<span style="color: #E6DB74;">'s complement, little endian</span>
<span style="color: #E6DB74;">  Version:                           1 (current)</span>
<span style="color: #E6DB74;">  OS/ABI:                            UNIX - System V</span>
<span style="color: #E6DB74;">  ABI Version:                       0</span>
<span style="color: #E6DB74;">  Type:                              EXEC (Executable file)</span>
<span style="color: #E6DB74;">  Machine:                           Intel 80386</span>
<span style="color: #E6DB74;">  Version:                           0x1</span>
<span style="color: #E6DB74;">  Entry point address:               0x8048370</span>
<span style="color: #E6DB74;">  Start of program headers:          52 (bytes into file)</span>
<span style="color: #E6DB74;">  Start of section headers:          13692 (bytes into file)</span>
<span style="color: #E6DB74;">  Flags:                             0x0</span>
<span style="color: #E6DB74;">  Size of this header:               52 (bytes)</span>
<span style="color: #E6DB74;">  Size of program headers:           32 (bytes)</span>
<span style="color: #E6DB74;">  Number of program headers:         9</span>
<span style="color: #E6DB74;">  Size of section headers:           40 (bytes)</span>
<span style="color: #E6DB74;">  Number of section headers:         30</span>
<span style="color: #E6DB74;">  Section header string table index: 29</span>

<span style="color: #E6DB74;">readelf -S a.out</span>
<span style="color: #E6DB74;">There are 30 section headers, starting at offset 0x357c:</span>

<span style="color: #E6DB74;">Section Headers:</span>
<span style="color: #E6DB74;">  [Nr] Name              Type            Addr     Off    Size   ES Flg Lk Inf Al</span>
<span style="color: #E6DB74;">  [ 0]                   NULL            00000000 000000 000000 00      0   0  0</span>
<span style="color: #E6DB74;">  [ 1] .interp           PROGBITS        08048154 000154 000013 00   A  0   0  1</span>
<span style="color: #E6DB74;">  [ 2] .note.ABI-tag     NOTE            08048168 000168 000020 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [ 3] .note.gnu.build-i NOTE            08048188 000188 000024 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [ 4] .gnu.hash         GNU_HASH        080481ac 0001ac 000020 04   A  5   0  4</span>
<span style="color: #E6DB74;">  [ 5] .dynsym           DYNSYM          080481cc 0001cc 000070 10   A  6   1  4</span>
<span style="color: #E6DB74;">  [ 6] .dynstr           STRTAB          0804823c 00023c 000081 00   A  0   0  1</span>
<span style="color: #E6DB74;">  [ 7] .gnu.version      VERSYM          080482be 0002be 00000e 02   A  5   0  2</span>
<span style="color: #E6DB74;">  [ 8] .gnu.version_r    VERNEED         080482cc 0002cc 000020 00   A  6   1  4</span>
<span style="color: #E6DB74;">  [ 9] .rel.dyn          REL             080482ec 0002ec 000018 08   A  5   0  4</span>
<span style="color: #E6DB74;">  [10] .rel.plt          REL             08048304 000304 000010 08  AI  5  22  4</span>
<span style="color: #E6DB74;">  [11] .init             PROGBITS        08048314 000314 000024 00  AX  0   0  4</span>
<span style="color: #E6DB74;">  [12] .plt              PROGBITS        08048340 000340 000030 04  AX  0   0 16</span>
<span style="color: #E6DB74;">  [13] .text             PROGBITS        08048370 000370 0001c5 00  AX  0   0 16</span>
<span style="color: #E6DB74;">  [14] .fini             PROGBITS        08048538 000538 000018 00  AX  0   0  4</span>
<span style="color: #E6DB74;">  [15] .rodata           PROGBITS        08048550 000550 00000c 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [16] .eh_frame_hdr     PROGBITS        0804855c 00055c 00003c 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [17] .eh_frame         PROGBITS        08048598 000598 0000ec 00   A  0   0  4</span>
<span style="color: #E6DB74;">  [18] .init_array       INIT_ARRAY      08049f04 000f04 000004 04  WA  0   0  4</span>
<span style="color: #E6DB74;">  [19] .fini_array       FINI_ARRAY      08049f08 000f08 000004 04  WA  0   0  4</span>
<span style="color: #E6DB74;">  [20] .dynamic          DYNAMIC         08049f0c 000f0c 0000e8 08  WA  6   0  4</span>
<span style="color: #E6DB74;">  [21] .got              PROGBITS        08049ff4 000ff4 00000c 04  WA  0   0  4</span>
<span style="color: #E6DB74;">  [22] .got.plt          PROGBITS        0804a000 001000 000014 04  WA  0   0  4</span>
<span style="color: #E6DB74;">  [23] .data             PROGBITS        0804a014 001014 000004 00  WA  0   0  1</span>
<span style="color: #E6DB74;">  [24] .bss              NOBITS          0804a018 001018 000004 00  WA  0   0  1</span>
<span style="color: #E6DB74;">  [25] .comment          PROGBITS        00000000 001018 00002c 01  MS  0   0  1</span>
<span style="color: #E6DB74;">  [26] .gnu.build.attrib NOTE            0804a01c 001044 00172c 00      0   0  4</span>
<span style="color: #E6DB74;">  [27] .symtab           SYMTAB          00000000 002770 000690 10     28  82  4</span>
<span style="color: #E6DB74;">  [28] .strtab           STRTAB          00000000 002e00 000665 00      0   0  1</span>
<span style="color: #E6DB74;">  [29] .shstrtab         STRTAB          00000000 003465 000117 00      0   0  1</span>
<span style="color: #E6DB74;">Key to Flags:</span>
<span style="color: #E6DB74;">  W (write), A (alloc), X (execute), M (merge), S (strings), I (info),</span>
<span style="color: #E6DB74;">  L (link order), O (extra OS processing required), G (group), T (TLS),</span>
<span style="color: #E6DB74;">  C (compressed), x (unknown), o (OS specific), E (exclude),</span>
<span style="color: #E6DB74;">  p (processor specific)</span>

<span style="color: #E6DB74;">readelf -l a.out</span>

<span style="color: #E6DB74;">Elf file type is EXEC (Executable file)</span>
<span style="color: #E6DB74;">Entry point 0x8048370</span>
<span style="color: #E6DB74;">There are 9 program headers, starting at offset 52</span>

<span style="color: #E6DB74;">Program Headers:</span>
<span style="color: #E6DB74;">  Type           Offset   VirtAddr   PhysAddr   FileSiz MemSiz  Flg Align</span>
<span style="color: #E6DB74;">  PHDR           0x000034 0x08048034 0x08048034 0x00120 0x00120 R   0x4</span>
<span style="color: #E6DB74;">  INTERP         0x000154 0x08048154 0x08048154 0x00013 0x00013 R   0x1</span>
<span style="color: #E6DB74;">      [Requesting program interpreter: /lib/ld-linux.so.2]</span>
<span style="color: #E6DB74;">  LOAD           0x000000 0x08048000 0x08048000 0x00684 0x00684 R E 0x1000</span>
<span style="color: #E6DB74;">  LOAD           0x000f04 0x08049f04 0x08049f04 0x00114 0x00118 RW  0x1000</span>
<span style="color: #E6DB74;">  DYNAMIC        0x000f0c 0x08049f0c 0x08049f0c 0x000e8 0x000e8 RW  0x4</span>
<span style="color: #E6DB74;">  NOTE           0x000168 0x08048168 0x08048168 0x00044 0x00044 R   0x4</span>
<span style="color: #E6DB74;">  GNU_EH_FRAME   0x00055c 0x0804855c 0x0804855c 0x0003c 0x0003c R   0x4</span>
<span style="color: #E6DB74;">  GNU_STACK      0x000000 0x00000000 0x00000000 0x00000 0x00000 RW  0x10</span>
<span style="color: #E6DB74;">  GNU_RELRO      0x000f04 0x08049f04 0x08049f04 0x000fc 0x000fc R   0x1</span>

<span style="color: #E6DB74;"> Section to Segment mapping:</span>
<span style="color: #E6DB74;">  Segment Sections...</span>
<span style="color: #E6DB74;">   00     </span>
<span style="color: #E6DB74;">   01     .interp </span>
<span style="color: #E6DB74;">   02     .interp .note.ABI-tag .note.gnu.build-id .gnu.hash .dynsym .dynstr .gnu.version .gnu.version_r .rel.dyn .rel.plt .init .plt .text .fini .rodata .eh_frame_hdr .eh_frame </span>
<span style="color: #E6DB74;">   03     .init_array .fini_array .dynamic .got .got.plt .data .bss </span>
<span style="color: #E6DB74;">   04     .dynamic </span>
<span style="color: #E6DB74;">   05     .note.ABI-tag .note.gnu.build-id </span>
<span style="color: #E6DB74;">   06     .eh_frame_hdr </span>
<span style="color: #E6DB74;">   07     </span>
<span style="color: #E6DB74;">   08     .init_array .fini_array .dynamic .got</span>

<span style="color: #E6DB74;">./a.out &amp;</span>
<span style="color: #E6DB74;">[1] 22024</span>
<span style="color: #E6DB74;">cat /proc/22024/map</span>
<span style="color: #E6DB74;">map_files/ maps       </span>
<span style="color: #E6DB74;">[xuali2@sha-isbu-ed15n xuali2]$cat /proc/22024/maps</span>
<span style="color: #E6DB74;">08048000-08049000 r-xp 00000000 00:41 94267115                           /auto/isbu_crdc_sw1/offlinediag/users/xuali2/a.out</span>
<span style="color: #E6DB74;">08049000-0804a000 r--p 00000000 00:41 94267115                           /auto/isbu_crdc_sw1/offlinediag/users/xuali2/a.out</span>
<span style="color: #E6DB74;">0804a000-0804b000 rw-p 00001000 00:41 94267115                           /auto/isbu_crdc_sw1/offlinediag/users/xuali2/a.out</span>
<span style="color: #E6DB74;">f7d75000-f7f16000 r-xp 00000000 fd:00 8820257                            /usr/lib/libc-2.28.so</span>
<span style="color: #E6DB74;">f7f16000-f7f17000 ---p 001a1000 fd:00 8820257                            /usr/lib/libc-2.28.so</span>
<span style="color: #E6DB74;">f7f17000-f7f19000 r--p 001a1000 fd:00 8820257                            /usr/lib/libc-2.28.so</span>
<span style="color: #E6DB74;">f7f19000-f7f1a000 rw-p 001a3000 fd:00 8820257                            /usr/lib/libc-2.28.so</span>
<span style="color: #E6DB74;">f7f1a000-f7f1f000 rw-p 00000000 00:00 0 </span>
<span style="color: #E6DB74;">f7f39000-f7f3c000 r--p 00000000 00:00 0                                  [vvar]</span>
<span style="color: #E6DB74;">f7f3c000-f7f3e000 r-xp 00000000 00:00 0                                  [vdso]</span>
<span style="color: #E6DB74;">f7f3e000-f7f66000 r-xp 00000000 fd:00 8820250                            /usr/lib/ld-2.28.so</span>
<span style="color: #E6DB74;">f7f66000-f7f67000 r--p 00027000 fd:00 8820250                            /usr/lib/ld-2.28.so</span>
<span style="color: #E6DB74;">f7f67000-f7f68000 rw-p 00028000 fd:00 8820250                             /usr/lib/ld-2.28.so</span>
<span style="color: #E6DB74;">ffd33000-ffd54000 rw-p 00000000 00:00 0                                  [stack]</span>
</pre>
</div>

<p>
<b>可将同一个物理页面映射多次，每次权限不一致，这样防止大量的内部碎片</b><br />
例子:<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-right">Physical Addr</th>
<th scope="col" class="org-right">File Offset</th>
<th scope="col" class="org-right">Virtual addr offset</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Segment0</td>
<td class="org-left">2K</td>
<td class="org-right">0x0000</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Segment1</td>
<td class="org-left">2K</td>
<td class="org-right">0x1000</td>
<td class="org-right">0x800</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>
<p>
变为<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Size</th>
<th scope="col" class="org-right">Physical Addr</th>
<th scope="col" class="org-right">File Offset</th>
<th scope="col" class="org-right">Virtual addr offset</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Segment0</td>
<td class="org-left">2K</td>
<td class="org-right">0x0000</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-left">Segment1</td>
<td class="org-left">2K</td>
<td class="org-right">0x0000</td>
<td class="org-right">0x800</td>
<td class="org-right">0x800</td>
</tr>
</tbody>
</table>
<p>
这样，节约了一个页<br />
</p>

<p>
<b>p_vaddr % align == p_offset % align</b>, 这样可能尽可能的在相邻segment间共享一个物理页<br />
</p>

<p>
<b>对于多次映射大段物理内存，不能一个用4K分页，一个以16K分页，这种会报错</b><br />
</p>

<p>
内核加载ELF的过程load_elf_binary()<br />
</p>
<ul class="org-ul">
<li>检测ELF文件有效性<br /></li>
<li>寻找".interp"动态链接段，设置动态链接器的路径<br /></li>
<li>根据ELF头，建立映射代码、数据、只读的数据结构<br /></li>
<li>初始化ELF进程环境<br /></li>
<li>将系统调用的返回地址修改成ELF可执行文件入口点，这样回到用户态时新程序开始执行<br /></li>
</ul>
<p>
动态链接的ELF入口是动态链接器<br />
静态链接的ELF入口是文件头里的entry<br />
</p>
</div>
</div>
</div>
