books/程序员的自我修养.org
* 第七章 动态链接

区别于静态链接，将链接这个过程推迟到装载时

foobar为so中的函数，则编译时会将符号引用标记为一个动态链接的符号，不进行地址重定位，改为装载时进行
#+begin_src c

//lib.h
#ifndef LIB_H
#define LIB_H

void foobar(int i);

#endif /* LIB_H */

//lib.c
//gcc -fPIC -shared -o lib.so -m32 lib.c
#include <stdio.h>

void foobar(int i)
{
    printf("dump from lib.so %d\n", i);
}

//p1.c
//gcc -o p1 p1.c ./lib.so -m32
#include "lib.h"

int main(int argc, char *argv[])
{
    foobar(1);
    return 0;
}

//p2.c
//gcc -o p2 p2.c ./lib.so -m32
#include "lib.h"

int main(int argc, char *argv[])
{
    foobar(2);
    return 0;
}
#+end_src

so的最终装载地址在编译时不确定
#+begin_src bash
readelf -l lib.so 

Elf file type is DYN (Shared object file)
Entry point 0x390
There are 7 program headers, starting at offset 52

Program Headers:
  Type           Offset   VirtAddr   PhysAddr   FileSiz MemSiz  Flg Align
  LOAD           0x000000 0x00000000 0x00000000 0x0058c 0x0058c R E 0x1000
  LOAD           0x000f04 0x00001f04 0x00001f04 0x00110 0x00114 RW  0x1000
  DYNAMIC        0x000f10 0x00001f10 0x00001f10 0x000e0 0x000e0 RW  0x4
  NOTE           0x000114 0x00000114 0x00000114 0x00024 0x00024 R   0x4
  GNU_EH_FRAME   0x0004f0 0x000004f0 0x000004f0 0x00024 0x00024 R   0x4
  GNU_STACK      0x000000 0x00000000 0x00000000 0x00000 0x00000 RW  0x10
  GNU_RELRO      0x000f04 0x00001f04 0x00001f04 0x000fc 0x000fc R   0x1

 Section to Segment mapping:
  Segment Sections...
   00     .note.gnu.build-id .gnu.hash .dynsym .dynstr .gnu.version .gnu.version_r .rel.dyn .rel.plt .init .plt .text .fini .rodata .eh_frame_hdr .eh_frame 
   01     .init_array .fini_array .data.rel.ro .dynamic .got .got.plt .bss 
   02     .dynamic 
   03     .note.gnu.build-id 
   04     .eh_frame_hdr 
   05     
   06     .init_array .fini_array .data.rel.ro .dynamic .got
#+end_src

*so在编译时不能假设自已在进程虚拟空间中的位置*, 早期有静态共享库，即地址由操作系统分配(固定装载地址)，但很难保证地址不冲突

*so代码段是多个进程共享的，但是数据段是多个副本*

装载时重定位(-shared 而不-fPIC)说的是在装载时确定符号的绝对地址，并遍历所有对此符号引用并重定位，问题是代码段如果共享，不能保证所有进程用同一个绝对地址，这样无法做到代码段共享，所以将对绝对地址的一次引用变成二次引用，将可变的绝对地址放在数据段中，即为延迟绑定

