程序员的自我修养.html

<div id="outline-container-org2d03b84" class="outline-2">
<h2 id="org2d03b84"><span class="section-number-2">7</span> 第七章 动态链接</h2>
<div class="outline-text-2" id="text-7">
<p>
区别于静态链接，将链接这个过程推迟到装载时<br />
</p>

<p>
foobar为so中的函数，则编译时会将符号引用标记为一个动态链接的符号，不进行地址重定位，改为装载时进行<br />
</p>
<div class="org-src-container">
<pre class="src src-c">
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">lib.h</span>
<span style="color: #F92672;">#if</span><span style="color: #F92672; font-weight: bold;">n</span><span style="color: #F92672;">def</span> LIB_H
<span style="color: #F92672;">#define</span> <span style="color: #FD971F;">LIB_H</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">foobar</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span><span style="color: #AE81FF;">)</span>;

<span style="color: #F92672;">#endif</span> <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">LIB_H </span><span style="color: #75715E;">*/</span>

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">lib.c</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">gcc -fPIC -shared -o lib.so -m32 lib.c</span>
<span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">stdio.h</span><span style="color: #AE81FF;">&gt;</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">foobar</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">i</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"dump from lib.so %d\n"</span>, i<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">p1.c</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">gcc -o p1 p1.c ./lib.so -m32</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"lib.h"</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span><span style="color: #66D9EF;">[]</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">foobar</span><span style="color: #66D9EF;">(</span>1<span style="color: #66D9EF;">)</span>;
    <span style="color: #F92672;">return</span> 0;
<span style="color: #AE81FF;">}</span>

<span style="color: #75715E;">//</span><span style="color: #E6DB74;">p2.c</span>
<span style="color: #75715E;">//</span><span style="color: #E6DB74;">gcc -o p2 p2.c ./lib.so -m32</span>
<span style="color: #F92672;">#include</span> <span style="color: #E6DB74;">"lib.h"</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span><span style="color: #66D9EF;">[]</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">foobar</span><span style="color: #66D9EF;">(</span>2<span style="color: #66D9EF;">)</span>;
    <span style="color: #F92672;">return</span> 0;
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
so的最终装载地址在编译时不确定<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">readelf -l lib.so 

Elf file type is DYN (Shared object file)
Entry point 0x390
There are 7 program headers, starting at offset 52

Program Headers:
  Type           Offset   VirtAddr   PhysAddr   FileSiz MemSiz  Flg Align
  LOAD           0x000000 0x00000000 0x00000000 0x0058c 0x0058c R E 0x1000
  LOAD           0x000f04 0x00001f04 0x00001f04 0x00110 0x00114 RW  0x1000
  DYNAMIC        0x000f10 0x00001f10 0x00001f10 0x000e0 0x000e0 RW  0x4
  NOTE           0x000114 0x00000114 0x00000114 0x00024 0x00024 R   0x4
  GNU_EH_FRAME   0x0004f0 0x000004f0 0x000004f0 0x00024 0x00024 R   0x4
  GNU_STACK      0x000000 0x00000000 0x00000000 0x00000 0x00000 RW  0x10
  GNU_RELRO      0x000f04 0x00001f04 0x00001f04 0x000fc 0x000fc R   0x1

 Section to Segment mapping:
  Segment Sections...
   00     .note.gnu.build-id .gnu.hash .dynsym .dynstr .gnu.version .gnu.version_r .rel.dyn .rel.plt .init .plt .text .fini .rodata .eh_frame_hdr .eh_frame 
   01     .init_array .fini_array .data.rel.ro .dynamic .got .got.plt .bss 
   02     .dynamic 
   03     .note.gnu.build-id 
   04     .eh_frame_hdr 
   05     
   06     .init_array .fini_array .data.rel.ro .dynamic .got
</pre>
</div>

<p>
<b>so在编译时不能假设自已在进程虚拟空间中的位置</b>, 早期有静态共享库，即地址由操作系统分配(固定装载地址)，但很难保证地址不冲突<br />
</p>

<p>
<b>so代码段是多个进程共享的，但是数据段是多个副本</b><br />
</p>

<p>
装载时重定位(-shared 而不-fPIC)说的是在装载时确定符号的绝对地址，并遍历所有对此符号引用并重定位，问题是代码段如果共享，不能保证所有进程用同一个绝对地址，这样无法做到代码段共享，所以将对绝对地址的一次引用变成二次引用，将可变的绝对地址放在数据段中，即为延迟绑定<br />
</p>
</div>
