books/程序员的自我修养.org
** 地址无关代码(fPIC)
#+begin_src c
  /* gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration */
  static int a;
  extern int b;
  extern void ext();

  static void bar() //书里面没加static，写的有问题
  {
      a = 1; //模块内数据访问
      b = 2; //模块间数据访问
  }

  void foo()
  {
      bar(); //模块内调用
      ext(); //模块间调用
  }
#+end_src

#+begin_src asm

0000047d <bar>:
 47d:	55                   	push   %ebp
 47e:	89 e5                	mov    %esp,%ebp
 480:	e8 41 00 00 00       	call   4c6 <__x86.get_pc_thunk.ax>
 485:	05 7b 1b 00 00       	add    $0x1b7b,%eax
 48a:	c7 80 18 00 00 00 01 	movl   $0x1,0x18(%eax) ;;模块内数据访问
 491:	00 00 00 
 494:	8b 80 f0 ff ff ff    	mov    -0x10(%eax),%eax
 49a:	c7 00 02 00 00 00    	movl   $0x2,(%eax)  ;;模块间数据访问
 4a0:	90                   	nop
 4a1:	5d                   	pop    %ebp
 4a2:	c3                   	ret    

000004a3 <foo>:
 4a3:	55                   	push   %ebp
 4a4:	89 e5                	mov    %esp,%ebp
 4a6:	53                   	push   %ebx
 4a7:	83 ec 04             	sub    $0x4,%esp
 4aa:	e8 d1 fe ff ff       	call   380 <__x86.get_pc_thunk.bx>
 4af:	81 c3 51 1b 00 00    	add    $0x1b51,%ebx
 4b5:	e8 c3 ff ff ff       	call   47d <bar> ;;模块内调用
 4ba:	e8 b1 fe ff ff       	call   370 <ext@plt> ;;模块间调用
 4bf:	90                   	nop
 4c0:	83 c4 04             	add    $0x4,%esp
 4c3:	5b                   	pop    %ebx
 4c4:	5d                   	pop    %ebp
 4c5:	c3                   	ret
#+end_src

- 模块内调用或跳转
call   47d <bar> 相对寻址，不用做重定位

- 模块内数据访问
*__x86.get_pc_thunk.ax* 这个函数将PC值存入了eax，则a的地址是0x485 + 0x1b7b + 0x18 = 0x2018，用这种相对寻址也不用重定位
#+begin_src bash
readelf -s lib.so  |grep a
...
    33: 00002018     4 OBJECT  LOCAL  DEFAULT   21 a
...
#+end_src

- 模块间数据访问
在数据段中建立全局偏移表(Global Offset Table),即.got
如上图, 0x485 + 0x1b7b - 0x10 = 0x1ff0，即为.got段b地址的存储
#+begin_src bash
readelf -S lib.so
  [19] .got              PROGBITS        00001fec 000fec 000014 04  WA  0   0  4

readelf -r lib.so
...
00001ff0  00000206 R_386_GLOB_DAT    00000000   b
...
#+end_src

- 模块间函数调用
和模块间数据访问一样，可用call .got里的函数地址，但上面用了延时绑定，下面详述

readelf -d lib.so 查看.dynamic段里的信息，如果有TEXTREL段则不是PIC

全局变量(没有static修饰)当作模块间访问，即通过.got间接索引

- 其他情况
#+begin_src c
static int a;
static int *p = &a;
#+end_src
这样的话p的值为变成装载时重定位，如图0x2018偏移生成一个重定位项
#+begin_src bash
readelf -r lib.so

Relocation section '.rel.dyn' at offset 0x2f8 contains 9 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
00001f00  00000008 R_386_RELATIVE   
00001f04  00000008 R_386_RELATIVE   
00001f08  00000008 R_386_RELATIVE   
00002018  00000008 R_386_RELATIVE   

[xuali2@sha-isbu-ed15n xuali2]$readelf -s lib.so |grep p
   Num:    Value  Size Type    Bind   Vis      Ndx Name
   Num:    Value  Size Type    Bind   Vis      Ndx Name
    29: 0000201c     1 OBJECT  LOCAL  DEFAULT   22 completed.7199
    35: 00002018     4 OBJECT  LOCAL  DEFAULT   21 p
#+end_src

