程序员的自我修养.html

<div id="outline-container-org26c82c1" class="outline-3">
<h3 id="org26c82c1"><span class="section-number-3">7.1</span> 地址无关代码(fPIC)</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-c"><span style="color: #75715E;">/* </span><span style="color: #E6DB74;">gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration </span><span style="color: #75715E;">*/</span>
<span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span>;
<span style="color: #F92672;">extern</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span>;
<span style="color: #F92672;">extern</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">ext</span><span style="color: #AE81FF;">()</span>;

<span style="color: #F92672;">static</span> <span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">bar</span><span style="color: #AE81FF;">()</span> <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#20070;&#37324;&#38754;&#27809;&#21152;static&#65292;&#20889;&#30340;&#26377;&#38382;&#39064;</span>
<span style="color: #AE81FF;">{</span>
    a = 1; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#27169;&#22359;&#20869;&#25968;&#25454;&#35775;&#38382;</span>
    b = 2; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#27169;&#22359;&#38388;&#25968;&#25454;&#35775;&#38382;</span>
<span style="color: #AE81FF;">}</span>

<span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">foo</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #A6E22E; font-weight: bold;">bar</span><span style="color: #66D9EF;">()</span>; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#27169;&#22359;&#20869;&#35843;&#29992;</span>
    <span style="color: #A6E22E; font-weight: bold;">ext</span><span style="color: #66D9EF;">()</span>; <span style="color: #75715E;">//</span><span style="color: #E6DB74;">&#27169;&#22359;&#38388;&#35843;&#29992;</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-asm">
<span style="color: #A6E22E; font-size: 130%;">0000047d</span> &lt;bar&gt;:
 <span style="color: #F92672;">47d</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">47e</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">480</span>:   e8 41 00 00 00          call   4c6 &lt;__x86.get_pc_thunk.ax&gt;
 <span style="color: #F92672;">485</span>:   05 7b 1b 00 00          add    $0x1b7b,<span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">48a</span>:   c7 80 18 00 00 00 01    movl   $0x1,0x18(<span style="color: #FD971F;">%eax</span>) <span style="color: #75715E;">;;</span><span style="color: #E6DB74;">&#27169;&#22359;&#20869;&#25968;&#25454;&#35775;&#38382;</span>
 <span style="color: #F92672;">491</span>:   00 00 00 
 <span style="color: #F92672;">494</span>:   8b 80 f0 ff ff ff       mov    -0x10(<span style="color: #FD971F;">%eax</span>),<span style="color: #FD971F;">%eax</span>
 <span style="color: #F92672;">49a</span>:   c7 00 02 00 00 00       movl   $0x2,(<span style="color: #FD971F;">%eax</span>)  <span style="color: #75715E;">;;</span><span style="color: #E6DB74;">&#27169;&#22359;&#38388;&#25968;&#25454;&#35775;&#38382;</span>
 <span style="color: #F92672;">4a0</span>:   90                      nop
 <span style="color: #F92672;">4a1</span>:   5d                      pop    <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">4a2</span>:   c3                      ret    

<span style="color: #A6E22E; font-size: 130%;">000004a3</span> &lt;foo&gt;:
 <span style="color: #F92672;">4a3</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">4a4</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">4a6</span>:   53                      push   <span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">4a7</span>:   83 ec 04                sub    $0x4,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">4aa</span>:   e8 d1 fe ff ff          call   380 &lt;__x86.get_pc_thunk.bx&gt;
 <span style="color: #F92672;">4af</span>:   81 c3 51 1b 00 00       add    $0x1b51,<span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">4b5</span>:   e8 c3 ff ff ff          call   47d &lt;bar&gt; <span style="color: #75715E;">;;</span><span style="color: #E6DB74;">&#27169;&#22359;&#20869;&#35843;&#29992;</span>
 <span style="color: #F92672;">4ba</span>:   e8 b1 fe ff ff          call   370 <a href="mailto:ext%40plt">&lt;ext@plt&gt;</a> <span style="color: #75715E;">;;</span><span style="color: #E6DB74;">&#27169;&#22359;&#38388;&#35843;&#29992;</span>
 <span style="color: #F92672;">4bf</span>:   90                      nop
 <span style="color: #F92672;">4c0</span>:   83 c4 04                add    $0x4,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">4c3</span>:   5b                      pop    <span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">4c4</span>:   5d                      pop    <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">4c5</span>:   c3                      ret
</pre>
</div>

<ul class="org-ul">
<li>模块内调用或跳转<br /></li>
</ul>
<p>
call   47d &lt;bar&gt; 相对寻址，不用做重定位<br />
</p>

<ul class="org-ul">
<li>模块内数据访问<br /></li>
</ul>
<p>
<b>__x86.get_pc_thunk.ax</b> 这个函数将PC值存入了eax，则a的地址是0x485 + 0x1b7b + 0x18 = 0x2018，用这种相对寻址也不用重定位<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">readelf -s lib.so  |grep a
...
    33: 00002018     4 OBJECT  LOCAL  DEFAULT   21 a
...
</pre>
</div>

<ul class="org-ul">
<li>模块间数据访问<br /></li>
</ul>
<p>
在数据段中建立全局偏移表(Global Offset Table),即.got<br />
如上图, 0x485 + 0x1b7b - 0x10 = 0x1ff0，即为.got段b地址的存储<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">readelf -S lib.so
  [19] .got              PROGBITS        00001fec 000fec 000014 04  WA  0   0  4

readelf -r lib.so
...
00001ff0  00000206 R_386_GLOB_DAT    00000000   b
...
</pre>
</div>

<ul class="org-ul">
<li>模块间函数调用<br /></li>
</ul>
<p>
和模块间数据访问一样，可用call .got里的函数地址，但上面用了延时绑定，下面详述<br />
</p>

<p>
readelf -d lib.so 查看.dynamic段里的信息，如果有TEXTREL段则不是PIC<br />
</p>

<p>
全局变量(没有static修饰)当作模块间访问，即通过.got间接索引<br />
</p>

<ul class="org-ul">
<li>其他情况<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span>;
<span style="color: #F92672;">static</span> <span style="color: #66D9EF;">int</span> *<span style="color: #FD971F;">p</span> = &amp;a;
</pre>
</div>
<p>
这样的话p的值为变成装载时重定位，如图0x2018偏移生成一个重定位项<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">readelf -r lib.so

Relocation section <span style="color: #E6DB74;">'.rel.dyn'</span> at offset 0x2f8 contains 9 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
00001f00  00000008 R_386_RELATIVE   
00001f04  00000008 R_386_RELATIVE   
00001f08  00000008 R_386_RELATIVE   
00002018  00000008 R_386_RELATIVE   

[xuali2@sha-isbu-ed15n xuali2]$<span style="color: #FD971F;">readelf</span> -s lib.so |grep p
   Num:    Value  Size Type    Bind   Vis      Ndx Name
   Num:    Value  Size Type    Bind   Vis      Ndx Name
    29: 0000201c     1 OBJECT  LOCAL  DEFAULT   22 completed.7199
    35: 00002018     4 OBJECT  LOCAL  DEFAULT   21 p
</pre>
</div>
</div>
</div>
