books/程序员的自我修养.org
** 延迟绑定(Procedure Linkage Table)
lazy binding 是指 *函数第一次被用到时才进行绑定*
原因是为了加块程序启动速度，很多函数并不会用到，全部重定位没有必要
*当年程序调优第一步就是全部静态链接*

#+begin_src asm
objdump -d lib.so
Disassembly of section .plt:

00000350 <.plt>:
 350:	ff b3 04 00 00 00    	pushl  0x4(%ebx)
 356:	ff a3 08 00 00 00    	jmp    *0x8(%ebx)
 35c:	00 00                	add    %al,(%eax)
	...

00000370 <ext@plt>:
 370:	ff a3 10 00 00 00    	jmp    *0x10(%ebx)
 376:	68 08 00 00 00       	push   $0x8
 37b:	e9 d0 ff ff ff       	jmp    350 <.plt>

000004a3 <foo>:
 4a3:	55                   	push   %ebp
 4a4:	89 e5                	mov    %esp,%ebp
 4a6:	53                   	push   %ebx
 4a7:	83 ec 04             	sub    $0x4,%esp
 4aa:	e8 d1 fe ff ff       	call   380 <__x86.get_pc_thunk.bx>
 4af:	81 c3 51 1b 00 00    	add    $0x1b51,%ebx
 4b5:	e8 c3 ff ff ff       	call   47d <bar>
 4ba:	e8 b1 fe ff ff       	call   370 <ext@plt>
#+end_src

#+begin_src bash
    46: 00002000     0 OBJECT  LOCAL  DEFAULT   20 _GLOBAL_OFFSET_TABLE_

 [10] .plt              PROGBITS        00000350 000350 000030 04  AX  0   0 16

 [20] .got.plt          PROGBITS        00002000 001000 000014 04  WA  0   0  4

Contents of section .got.plt:
 2000 0c1f0000 00000000 00000000 66030000  ............f...
 2010 76030000                             v... 

Relocation section '.rel.plt' at offset 0x31c contains 2 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
0000200c  00000307 R_386_JUMP_SLOT   00000000   __cxa_finalize@GLIBC_2.1.3
00002010  00000507 R_386_JUMP_SLOT   00000000   ext

  [18] .dynamic          DYNAMIC         00001f0c 000f0c 0000e0 08  WA  4   0  4
#+end_src
如上:
1. ext@plt时ebx = 0x4af + 0x1b51 = 0x2000,为全局偏移表的首地址，在.got.plt中, *@plt的代码是.plt里
2. jmp    *0x10(%ebx), 默认值是0x376，即下一跳地址，绑定后其值为重定位的地址，注意这个是小端76030000即为0x376
3. push   $0x8, 为.rel.plt里的偏移，一个重定位项是8个字节
4. GLOBAL\under{}OFFSET\under{}TABLE表中第一项0x1f0c是.dymanic的地址,第二项0是本模块ID,第三项是\under{}dl\under{}runtime\under{}resolve()的地址，用来解析bar的实际地址,其中第二项和第三项是运行时由动态链接器初始化
5. 所以0x350开头的两行，第一个是push moduleID,第二个是调用\under{}dl\under{}runtime\under{}resolve
6. 如下为运行时状态
0xf7f564af + 0x1b51 = 0xf7f58000为_GLOBAL_OFFSET_TABLE_的首地址
第一项.dynamic不load到内存，所以不管
第二项0xf7f59000为moduleID
第三项0xf7f75d10为_dl_runtime_resolve的地址
第五项为ext的地址
#+begin_src bash
(gdb) disassemble foo
Dump of assembler code for function foo:
   0xf7f564a3 <+0>:	push   %ebp
   0xf7f564a4 <+1>:	mov    %esp,%ebp
   0xf7f564a6 <+3>:	push   %ebx
   0xf7f564a7 <+4>:	sub    $0x4,%esp
   0xf7f564aa <+7>:	call   0xf7f56380 <__x86.get_pc_thunk.bx>
   0xf7f564af <+12>:	add    $0x1b51,%ebx
   0xf7f564b5 <+18>:	call   0xf7f5647d <bar>
   0xf7f564ba <+23>:	call   0xf7f56370 <ext@plt>
   0xf7f564bf <+28>:	nop
   0xf7f564c0 <+29>:	add    $0x4,%esp
   0xf7f564c3 <+32>:	pop    %ebx
   0xf7f564c4 <+33>:	pop    %ebp
   0xf7f564c5 <+34>:	ret    
End of assembler dump.
(gdb) p/x ((unsigned int *)0xf7f58000)[0]
$12 = 0x1f0c
(gdb) p/x ((unsigned int *)0xf7f58000)[1]
$13 = 0xf7f59000
(gdb) p/x ((unsigned int *)0xf7f58000)[2]
$14 = 0xf7f75d10
(gdb) p/x ((unsigned int *)0xf7f58000)[3]
$15 = 0xf7f56366

(gdb) disassemble 0xf7f56370
Dump of assembler code for function ext@plt:
   0xf7f56370 <+0>:	jmp    *0x10(%ebx)
   0xf7f56376 <+6>:	push   $0x8
   0xf7f5637b <+11>:	jmp    0xf7f56350
End of assembler dump.
(gdb) disassemble 0xf7f75d10

Dump of assembler code for function _dl_runtime_resolve:
   0xf7f75d10 <+0>:	repz nop %ebx
   0xf7f75d14 <+4>:	push   %eax
   0xf7f75d15 <+5>:	push   %ecx
   0xf7f75d16 <+6>:	push   %edx
   0xf7f75d17 <+7>:	mov    0x10(%esp),%edx
   0xf7f75d1b <+11>:	mov    0xc(%esp),%eax
   0xf7f75d1f <+15>:	call   0xf7f6fe90 <_dl_fixup>
   0xf7f75d24 <+20>:	pop    %edx
   0xf7f75d25 <+21>:	mov    (%esp),%ecx
   0xf7f75d28 <+24>:	mov    %eax,(%esp)
   0xf7f75d2b <+27>:	mov    0x4(%esp),%eax
   0xf7f75d2f <+31>:	ret    $0xc
End of assembler dump.

(gdb) p/x ((unsigned int *)0xf7f58000)[4]
$16 = 0x804857d
(gdb) disassemble 0x804857d
Dump of assembler code for function ext:
   0x0804857d <+0>:	push   %ebp
   0x0804857e <+1>:	mov    %esp,%ebp
   0x08048580 <+3>:	mov    $0x0,%eax
   0x08048585 <+8>:	pop    %ebp
   0x08048586 <+9>:	ret    
End of assembler dump.

(gdb) x/64xb 0xf7f56350
0xf7f56350:	0xff	0xb3	0x04	0x00	0x00	0x00	0xff	0xa3
0xf7f56358:	0x08	0x00	0x00	0x00	0x00	0x00	0x00	0x00
#+end_src

