程序员的自我修养.html

<div id="outline-container-org8a72a29" class="outline-3">
<h3 id="org8a72a29"><span class="section-number-3">7.2</span> 延迟绑定(Procedure Linkage Table)</h3>
<div class="outline-text-3" id="text-7-2">
<p>
lazy binding 是指 <b>函数第一次被用到时才进行绑定</b><br />
原因是为了加块程序启动速度，很多函数并不会用到，全部重定位没有必要<br />
<b>当年程序调优第一步就是全部静态链接</b><br />
</p>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #A6E22E; font-size: 130%;">objdump</span> -d lib.so
<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .plt:

<span style="color: #A6E22E; font-size: 130%;">00000350</span> &lt;.plt&gt;:
 <span style="color: #F92672;">350</span>:   ff b3 04 00 00 00       pushl  0x4(<span style="color: #FD971F;">%ebx</span>)
 <span style="color: #F92672;">356</span>:   ff a3 08 00 00 00       jmp    *0x8(<span style="color: #FD971F;">%ebx</span>)
 <span style="color: #F92672;">35c</span>:   00 00                   add    <span style="color: #FD971F;">%al</span>,(<span style="color: #FD971F;">%eax</span>)
    ...

<span style="color: #A6E22E; font-size: 130%;">00000370</span> <a href="mailto:ext%40plt">&lt;ext@plt&gt;</a>:
 <span style="color: #F92672;">370</span>:   ff a3 10 00 00 00       jmp    *0x10(<span style="color: #FD971F;">%ebx</span>)
 <span style="color: #F92672;">376</span>:   68 08 00 00 00          push   $0x8
 <span style="color: #F92672;">37b</span>:   e9 d0 ff ff ff          jmp    350 &lt;.plt&gt;

<span style="color: #A6E22E; font-size: 130%;">000004a3</span> &lt;foo&gt;:
 <span style="color: #F92672;">4a3</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">4a4</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
 <span style="color: #F92672;">4a6</span>:   53                      push   <span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">4a7</span>:   83 ec 04                sub    $0x4,<span style="color: #FD971F;">%esp</span>
 <span style="color: #F92672;">4aa</span>:   e8 d1 fe ff ff          call   380 &lt;__x86.get_pc_thunk.bx&gt;
 <span style="color: #F92672;">4af</span>:   81 c3 51 1b 00 00       add    $0x1b51,<span style="color: #FD971F;">%ebx</span>
 <span style="color: #F92672;">4b5</span>:   e8 c3 ff ff ff          call   47d &lt;bar&gt;
 <span style="color: #F92672;">4ba</span>:   e8 b1 fe ff ff          call   370 <a href="mailto:ext%40plt">&lt;ext@plt&gt;</a>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-bash">    46: 00002000     0 OBJECT  LOCAL  DEFAULT   20 _GLOBAL_OFFSET_TABLE_

 [10] .plt              PROGBITS        00000350 000350 000030 04  AX  0   0 16

 [20] .got.plt          PROGBITS        00002000 001000 000014 04  WA  0   0  4

Contents of section .got.plt:
 2000 0c1f0000 00000000 00000000 66030000  ............f...
 2010 76030000                             v... 

Relocation section <span style="color: #E6DB74;">'.rel.plt'</span> at offset 0x31c contains 2 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
0000200c  00000307 R_386_JUMP_SLOT   00000000   __cxa_finalize@GLIBC_2.1.3
00002010  00000507 R_386_JUMP_SLOT   00000000   ext

  [18] .dynamic          DYNAMIC         00001f0c 000f0c 0000e0 08  WA  4   0  4
</pre>
</div>
<p>
如上:<br />
</p>
<ol class="org-ol">
<li>ext@plt时ebx = 0x4af + 0x1b51 = 0x2000,为全局偏移表的首地址，在.got.plt中, *@plt的代码是.plt里<br /></li>
<li>jmp    *0x10(%ebx), 默认值是0x376，即下一跳地址，绑定后其值为重定位的地址，注意这个是小端76030000即为0x376<br /></li>
<li>push   $0x8, 为.rel.plt里的偏移，一个重定位项是8个字节<br /></li>
<li>GLOBAL_OFFSET_TABLE表中第一项0x1f0c是.dymanic的地址,第二项0是本模块ID,第三项是_dl_runtime_resolve()的地址，用来解析bar的实际地址,其中第二项和第三项是运行时由动态链接器初始化<br /></li>
<li>所以0x350开头的两行，第一个是push moduleID,第二个是调用_dl_runtime_resolve<br /></li>
<li>如下为运行时状态<br /></li>
</ol>
<p>
0xf7f564af + 0x1b51 = 0xf7f58000为_GLOBAL_OFFSET_TABLE_的首地址<br />
第一项.dynamic不load到内存，所以不管<br />
第二项0xf7f59000为moduleID<br />
第三项0xf7f75d10为_dl_runtime_resolve的地址<br />
第五项为ext的地址<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">(gdb) disassemble foo
Dump of assembler code for <span style="color: #F92672;">function</span> <span style="color: #A6E22E; font-size: 130%;">foo</span>:
   0xf7f564a3 &lt;+0&gt;: push   %ebp
   0xf7f564a4 &lt;+1&gt;: mov    %esp,%ebp
   0xf7f564a6 &lt;+3&gt;: push   %ebx
   0xf7f564a7 &lt;+4&gt;: sub    $<span style="color: #FD971F;">0</span>x4,%esp
   0xf7f564aa &lt;+7&gt;: call   0xf7f56380 &lt;__x86.get_pc_thunk.bx&gt;
   0xf7f564af &lt;+12&gt;:    add    $<span style="color: #FD971F;">0</span>x1b51,%ebx
   0xf7f564b5 &lt;+18&gt;:    call   0xf7f5647d &lt;bar&gt;
   0xf7f564ba &lt;+23&gt;:    call   0xf7f56370 <a href="mailto:ext%40plt">&lt;ext@plt&gt;</a>
   0xf7f564bf &lt;+28&gt;:    nop
   0xf7f564c0 &lt;+29&gt;:    add    $<span style="color: #FD971F;">0</span>x4,%esp
   0xf7f564c3 &lt;+32&gt;:    pop    %ebx
   0xf7f564c4 &lt;+33&gt;:    pop    %ebp
   0xf7f564c5 &lt;+34&gt;:    ret    
End of assembler dump.
(gdb) p/x ((unsigned int *)0xf7f58000)[0]
$<span style="color: #FD971F;">12</span> = 0x1f0c
(gdb) p/x ((unsigned int *)0xf7f58000)[1]
$<span style="color: #FD971F;">13</span> = 0xf7f59000
(gdb) p/x ((unsigned int *)0xf7f58000)[2]
$<span style="color: #FD971F;">14</span> = 0xf7f75d10
(gdb) p/x ((unsigned int *)0xf7f58000)[3]
$<span style="color: #FD971F;">15</span> = 0xf7f56366

(gdb) disassemble 0xf7f56370
Dump of assembler code for <span style="color: #F92672;">function</span> <span style="color: #A6E22E; font-size: 130%;">ext</span>@plt:
   0xf7f56370 &lt;+0&gt;: jmp    *0x10(%ebx)
   0xf7f56376 &lt;+6&gt;: push   $<span style="color: #FD971F;">0</span>x8
   0xf7f5637b &lt;+11&gt;:    jmp    0xf7f56350
End of assembler dump.
(gdb) disassemble 0xf7f75d10

Dump of assembler code for <span style="color: #F92672;">function</span> <span style="color: #A6E22E; font-size: 130%;">_dl_runtime_resolve</span>:
   0xf7f75d10 &lt;+0&gt;: repz nop %ebx
   0xf7f75d14 &lt;+4&gt;: push   %eax
   0xf7f75d15 &lt;+5&gt;: push   %ecx
   0xf7f75d16 &lt;+6&gt;: push   %edx
   0xf7f75d17 &lt;+7&gt;: mov    0x10(%esp),%edx
   0xf7f75d1b &lt;+11&gt;:    mov    0xc(%esp),%eax
   0xf7f75d1f &lt;+15&gt;:    call   0xf7f6fe90 &lt;_dl_fixup&gt;
   0xf7f75d24 &lt;+20&gt;:    pop    %edx
   0xf7f75d25 &lt;+21&gt;:    mov    (%esp),%ecx
   0xf7f75d28 &lt;+24&gt;:    mov    %eax,(%esp)
   0xf7f75d2b &lt;+27&gt;:    mov    0x4(%esp),%eax
   0xf7f75d2f &lt;+31&gt;:    ret    $<span style="color: #FD971F;">0</span>xc
End of assembler dump.

(gdb) p/x ((unsigned int *)0xf7f58000)[4]
$<span style="color: #FD971F;">16</span> = 0x804857d
(gdb) disassemble 0x804857d
Dump of assembler code for <span style="color: #F92672;">function</span> <span style="color: #A6E22E; font-size: 130%;">ext</span>:
   0x0804857d &lt;+0&gt;: push   %ebp
   0x0804857e &lt;+1&gt;: mov    %esp,%ebp
   0x08048580 &lt;+3&gt;: mov    $<span style="color: #FD971F;">0</span>x0,%eax
   0x08048585 &lt;+8&gt;: pop    %ebp
   0x08048586 &lt;+9&gt;: ret    
End of assembler dump.

(gdb) x/64xb 0xf7f56350
0xf7f56350: 0xff    0xb3    0x04    0x00    0x00    0x00    0xff    0xa3
0xf7f56358: 0x08    0x00    0x00    0x00    0x00    0x00    0x00    0x00
</pre>
</div>
</div>
</div>
