books/程序员的自我修养.org
** 动态链接器

.interp段存放动态链接器的路径
#+begin_src bash
objdump -s a.out 

a.out:     file format elf32-i386

Contents of section .interp:
 8048154 2f6c6962 2f6c642d 6c696e75 782e736f  /lib/ld-linux.so
 8048164 2e3200                               .2. 

readelf -l a.out  |grep interpreter
      [Requesting program interpreter: /lib/ld-linux.so.2]
#+end_src

.dynamic段存放动态链接基本信息
#+begin_src bash
readelf -d a.out

Dynamic section at offset 0xf04 contains 25 entries:
  Tag        Type                         Name/Value
 0x00000001 (NEEDED)                     Shared library: [./lib.so]
 0x00000001 (NEEDED)                     Shared library: [libc.so.6]
 0x0000000c (INIT)                       0x80483d0
 0x0000000d (FINI)                       0x8048628
 0x00000019 (INIT_ARRAY)                 0x8049efc
 0x0000001b (INIT_ARRAYSZ)               4 (bytes)
 0x0000001a (FINI_ARRAY)                 0x8049f00
 0x0000001c (FINI_ARRAYSZ)               4 (bytes)
 0x6ffffef5 (GNU_HASH)                   0x80481ac
 0x00000005 (STRTAB)                     0x80482b8
 0x00000006 (SYMTAB)                     0x80481e8
 0x0000000a (STRSZ)                      172 (bytes)
 0x0000000b (SYMENT)                     16 (bytes)
 0x00000015 (DEBUG)                      0x0
 0x00000003 (PLTGOT)                     0x804a000
 0x00000002 (PLTRELSZ)                   24 (bytes)
 0x00000014 (PLTREL)                     REL
 0x00000017 (JMPREL)                     0x80483b8
 0x00000011 (REL)                        0x80483a0
 0x00000012 (RELSZ)                      24 (bytes)
 0x00000013 (RELENT)                     8 (bytes)
 0x6ffffffe (VERNEED)                    0x8048380
 0x6fffffff (VERNEEDNUM)                 1
 0x6ffffff0 (VERSYM)                     0x8048364
 0x00000000 (NULL)                       0x0
#+end_src

ldd 查看依赖关系
#+begin_src bash
ldd a.out
	linux-gate.so.1 (0xf7f87000)
	./lib.so (0xf7f7f000)
	libc.so.6 => /lib/libc.so.6 (0xf7dbd000)
	/lib/ld-linux.so.2 (0xf7f89000)
#+end_src

.dynsym - 动态链接相关的符号
.dynstr - 动态链接符号字符串表

#+begin_src bash
readelf -sD lib.so 

Symbol table of `.gnu.hash' for image:
  Num Buc:    Value  Size   Type   Bind Vis      Ndx Name
    7   0: 00002014     0 NOTYPE  GLOBAL DEFAULT  20 _edata
    8   0: 000004a3    35 FUNC    GLOBAL DEFAULT  11 foo
    9   0: 0000201c     0 NOTYPE  GLOBAL DEFAULT  21 _end
   10   1: 00002014     0 NOTYPE  GLOBAL DEFAULT  21 __bss_start
#+end_src

.rel.dyn - .got重定位表
.rel.plt - .got.plt重定位表

R_386_GLOB_DAT,R_386_JUMP_SLOT  - 直接填入符号地址
R_386_RELATIVE                  - 基址重置

#+begin_src bash
readelf -r lib.so 

Relocation section '.rel.dyn' at offset 0x2dc contains 8 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
00001f00  00000008 R_386_RELATIVE   
00001f04  00000008 R_386_RELATIVE   
00001f08  00000008 R_386_RELATIVE   
00001fec  00000106 R_386_GLOB_DAT    00000000   _ITM_deregisterTMClone
00001ff0  00000206 R_386_GLOB_DAT    00000000   b
00001ff4  00000306 R_386_GLOB_DAT    00000000   __cxa_finalize@GLIBC_2.1.3
00001ff8  00000406 R_386_GLOB_DAT    00000000   __gmon_start__
00001ffc  00000606 R_386_GLOB_DAT    00000000   _ITM_registerTMCloneTa

Relocation section '.rel.plt' at offset 0x31c contains 2 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
0000200c  00000307 R_386_JUMP_SLOT   00000000   __cxa_finalize@GLIBC_2.1.3
00002010  00000507 R_386_JUMP_SLOT   00000000   ext

  [19] .got              PROGBITS        00001fec 000fec 000014 04  WA  0   0  4
  [20] .got.plt          PROGBITS        00002000 001000 000014 04  WA  0   0  4
#+end_src

如果不用PIC编译，重定位表不在.got.plt，而在.text中(绝对地址寻址)

#+begin_src bash
gcc -shared -o lib2.so -m32 lib.c -Wno-implicit-function-declaration
readelf -r lib2.so

Relocation section '.rel.dyn' at offset 0x2dc contains 10 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
00000482  00000008 R_386_RELATIVE   
00001efc  00000008 R_386_RELATIVE   
00001f00  00000008 R_386_RELATIVE   
00001f04  00000008 R_386_RELATIVE   
0000048c  00000201 R_386_32          00000000   b
000004a3  00000502 R_386_PC32        00000000   ext
00001ff0  00000106 R_386_GLOB_DAT    00000000   _ITM_deregisterTMClone
00001ff4  00000306 R_386_GLOB_DAT    00000000   __cxa_finalize@GLIBC_2.1.3
00001ff8  00000406 R_386_GLOB_DAT    00000000   __gmon_start__
00001ffc  00000606 R_386_GLOB_DAT    00000000   _ITM_registerTMCloneTa

Relocation section '.rel.plt' at offset 0x32c contains 1 entry:
 Offset     Info    Type            Sym.Value  Sym. Name
0000200c  00000307 R_386_JUMP_SLOT   00000000   __cxa_finalize@GLIBC_2.1.3

[11] .text             PROGBITS        00000380 000380 00012a 00  AX  0   0 16
#+end_src

动态链接器的工作流程
- 自举
自举代码为了防止套娃，不能依赖别的so，不能使用全局和静态变量，不能使用函数调用
- 装载共享对象
全局符号介入(Global Symbol Interpose) - 多个so里有同名的全局符号
*第一个符号载入后，后面相同的符号被忽略*
- 重定位和初始化
so里的.init和.finit由动态链接器执行

ld-linux.so.2也可单独执行
kernel并不关心是EXEC还是DYN
#+begin_src bash
/lib/ld-linux.so.2
Usage: ld.so [OPTION]... EXECUTABLE-FILE [ARGS-FOR-PROGRAM...]
You have invoked `ld.so', the helper program for shared library executables.
This program usually lives in the file `/lib/ld.so', and special directives
in executable files using ELF shared libraries tell the system's program
loader to load the helper program from this file.  This helper program loads
the shared libraries needed by the program executable, prepares the program
to run, and runs it.  You may invoke this helper program directly from the
command line to load and run an ELF executable file; this is like executing
that file itself, but always uses this helper program from the file you
specified, instead of the helper program file specified in the executable
file you run.  This is mostly of use for maintainers to test new versions
of this helper program; chances are you did not intend to run this program.

  --list                list all dependencies and how they are resolved
  --verify              verify that given object really is a dynamically linked
			object we can handle
  --inhibit-cache       Do not use /etc/ld.so.cache
  --library-path PATH   use given PATH instead of content of the environment
			variable LD_LIBRARY_PATH
  --inhibit-rpath LIST  ignore RUNPATH and RPATH information in object names
			in LIST
  --audit LIST          use objects named in LIST as auditors
#+end_src


动态装载库
- dlopen  打开一个动态库
- dlsym   查找符号,以打开动态库句柄为根节点进行查找
- dlerror 查看是否有错
- dlclose 卸载动态库，引用计数为0才取消映射关系，之前会运行".finit"的代码

*有些gcc编译的默认参数是--enable-default-pie 需要额外加上-no-pie，使其生成EXEC而不是DYN*
#+begin_src c
#include <stdio.h>
#include <dlfcn.h>

/* gcc t.c -m32 -ldl -no-pie */
/* ./a.out /lib32/libm-2.28.so  */
/* 1.000000 */

int main(int argc, char *argv[])
{
    void *handle;
    double (*func)(double);
    char *error;

    handle = dlopen(argv[1], RTLD_NOW);
    if (!handle) {
        printf("failed to open lib\n");
        return -1;
    }

    func = dlsym(handle, "sin");
    if ((error = dlerror()) != NULL) {
        printf("error %s\n", error);
        dlclose(handle);
    }

    printf("%f\n", func(3.1415926 / 2));
    dlclose(handle);
    return 0;
}
#+end_src

