程序员的自我修养.html

<div id="outline-container-org4e3a628" class="outline-3">
<h3 id="org4e3a628"><span class="section-number-3">7.3</span> 动态链接器</h3>
<div class="outline-text-3" id="text-7-3">
<p>
.interp段存放动态链接器的路径<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">objdump -s a.out 

a.out:     file format elf32-i386

Contents of section .interp:
 8048154 2f6c6962 2f6c642d 6c696e75 782e736f  /lib/ld-linux.so
 8048164 2e3200                               .2. 

readelf -l a.out  |grep interpreter
      [Requesting program interpreter: /lib/ld-linux.so.2]
</pre>
</div>

<p>
.dynamic段存放动态链接基本信息<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">readelf -d a.out

Dynamic section at offset 0xf04 contains 25 entries:
  Tag        Type                         Name/Value
 0x00000001 (NEEDED)                     Shared library: [./lib.so]
 0x00000001 (NEEDED)                     Shared library: [libc.so.6]
 0x0000000c (INIT)                       0x80483d0
 0x0000000d (FINI)                       0x8048628
 0x00000019 (INIT_ARRAY)                 0x8049efc
 0x0000001b (INIT_ARRAYSZ)               4 (bytes)
 0x0000001a (FINI_ARRAY)                 0x8049f00
 0x0000001c (FINI_ARRAYSZ)               4 (bytes)
 0x6ffffef5 (GNU_HASH)                   0x80481ac
 0x00000005 (STRTAB)                     0x80482b8
 0x00000006 (SYMTAB)                     0x80481e8
 0x0000000a (STRSZ)                      172 (bytes)
 0x0000000b (SYMENT)                     16 (bytes)
 0x00000015 (DEBUG)                      0x0
 0x00000003 (PLTGOT)                     0x804a000
 0x00000002 (PLTRELSZ)                   24 (bytes)
 0x00000014 (PLTREL)                     REL
 0x00000017 (JMPREL)                     0x80483b8
 0x00000011 (REL)                        0x80483a0
 0x00000012 (RELSZ)                      24 (bytes)
 0x00000013 (RELENT)                     8 (bytes)
 0x6ffffffe (VERNEED)                    0x8048380
 0x6fffffff (VERNEEDNUM)                 1
 0x6ffffff0 (VERSYM)                     0x8048364
 0x00000000 (NULL)                       0x0
</pre>
</div>

<p>
ldd 查看依赖关系<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">ldd a.out
    linux-gate.so.1 (0xf7f87000)
    ./lib.so (0xf7f7f000)
    libc.so.6 =&gt; /lib/libc.so.6 (0xf7dbd000)
    /lib/ld-linux.so.2 (0xf7f89000)
</pre>
</div>

<p>
.dynsym - 动态链接相关的符号<br />
.dynstr - 动态链接符号字符串表<br />
</p>

<div class="org-src-container">
<pre class="src src-bash">readelf -sD lib.so 

Symbol table of <span style="color: #AE81FF; font-weight: bold;">`.gnu.hash' for image:</span>
<span style="color: #AE81FF; font-weight: bold;">  Num Buc:    Value  Size   Type   Bind Vis      Ndx Name</span>
<span style="color: #AE81FF; font-weight: bold;">    7   0: 00002014     0 NOTYPE  GLOBAL DEFAULT  20 _edata</span>
<span style="color: #AE81FF; font-weight: bold;">    8   0: 000004a3    35 FUNC    GLOBAL DEFAULT  11 foo</span>
<span style="color: #AE81FF; font-weight: bold;">    9   0: 0000201c     0 NOTYPE  GLOBAL DEFAULT  21 _end</span>
<span style="color: #AE81FF; font-weight: bold;">   10   1: 00002014     0 NOTYPE  GLOBAL DEFAULT  21 __bss_start</span>
</pre>
</div>

<p>
.rel.dyn - .got重定位表<br />
.rel.plt - .got.plt重定位表<br />
</p>

<p>
R_386_GLOB_DAT,R_386_JUMP_SLOT  - 直接填入符号地址<br />
R_386_RELATIVE                  - 基址重置<br />
</p>

<div class="org-src-container">
<pre class="src src-bash">readelf -r lib.so 

Relocation section <span style="color: #E6DB74;">'.rel.dyn'</span> at offset 0x2dc contains 8 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
00001f00  00000008 R_386_RELATIVE   
00001f04  00000008 R_386_RELATIVE   
00001f08  00000008 R_386_RELATIVE   
00001fec  00000106 R_386_GLOB_DAT    00000000   _ITM_deregisterTMClone
00001ff0  00000206 R_386_GLOB_DAT    00000000   b
00001ff4  00000306 R_386_GLOB_DAT    00000000   __cxa_finalize@GLIBC_2.1.3
00001ff8  00000406 R_386_GLOB_DAT    00000000   __gmon_start__
00001ffc  00000606 R_386_GLOB_DAT    00000000   _ITM_registerTMCloneTa

Relocation section <span style="color: #E6DB74;">'.rel.plt'</span> at offset 0x31c contains 2 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
0000200c  00000307 R_386_JUMP_SLOT   00000000   __cxa_finalize@GLIBC_2.1.3
00002010  00000507 R_386_JUMP_SLOT   00000000   ext

  [19] .got              PROGBITS        00001fec 000fec 000014 04  WA  0   0  4
  [20] .got.plt          PROGBITS        00002000 001000 000014 04  WA  0   0  4
</pre>
</div>

<p>
如果不用PIC编译，重定位表不在.got.plt，而在.text中(绝对地址寻址)<br />
</p>

<div class="org-src-container">
<pre class="src src-bash">gcc -shared -o lib2.so -m32 lib.c -Wno-implicit-function-declaration
readelf -r lib2.so

Relocation section <span style="color: #E6DB74;">'.rel.dyn'</span> at offset 0x2dc contains 10 entries:
 Offset     Info    Type            Sym.Value  Sym. Name
00000482  00000008 R_386_RELATIVE   
00001efc  00000008 R_386_RELATIVE   
00001f00  00000008 R_386_RELATIVE   
00001f04  00000008 R_386_RELATIVE   
0000048c  00000201 R_386_32          00000000   b
000004a3  00000502 R_386_PC32        00000000   ext
00001ff0  00000106 R_386_GLOB_DAT    00000000   _ITM_deregisterTMClone
00001ff4  00000306 R_386_GLOB_DAT    00000000   __cxa_finalize@GLIBC_2.1.3
00001ff8  00000406 R_386_GLOB_DAT    00000000   __gmon_start__
00001ffc  00000606 R_386_GLOB_DAT    00000000   _ITM_registerTMCloneTa

Relocation section <span style="color: #E6DB74;">'.rel.plt'</span> at offset 0x32c contains 1 entry:
 Offset     Info    Type            Sym.Value  Sym. Name
0000200c  00000307 R_386_JUMP_SLOT   00000000   __cxa_finalize@GLIBC_2.1.3

[11] .text             PROGBITS        00000380 000380 00012a 00  AX  0   0 16
</pre>
</div>

<p>
动态链接器的工作流程<br />
</p>
<ul class="org-ul">
<li>自举<br /></li>
</ul>
<p>
自举代码为了防止套娃，不能依赖别的so，不能使用全局和静态变量，不能使用函数调用<br />
</p>
<ul class="org-ul">
<li>装载共享对象<br /></li>
</ul>
<p>
全局符号介入(Global Symbol Interpose) - 多个so里有同名的全局符号<br />
<b>第一个符号载入后，后面相同的符号被忽略</b><br />
</p>
<ul class="org-ul">
<li>重定位和初始化<br /></li>
</ul>
<p>
so里的.init和.finit由动态链接器执行<br />
</p>

<p>
ld-linux.so.2也可单独执行<br />
kernel并不关心是EXEC还是DYN<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">/lib/ld-linux.so.2
Usage: ld.so [OPTION]... EXECUTABLE-FILE [ARGS-FOR-PROGRAM...]
You have invoked <span style="color: #AE81FF; font-weight: bold;">`ld.so', the helper program for shared library executables.</span>
<span style="color: #AE81FF; font-weight: bold;">This program usually lives in the file `</span>/lib/ld.so<span style="color: #E6DB74;">', and special directives</span>
<span style="color: #E6DB74;">in executable files using ELF shared libraries tell the system'</span>s program
loader to load the helper program from this file.  This helper program loads
the shared libraries needed by the program executable, prepares the program
to run, and runs it.  You may invoke this helper program directly from the
<span style="color: #F92672;">command</span> line to load and run an ELF executable file; this is like executing
that file itself, but always uses this helper program from the file you
specified, instead of the helper program file specified<span style="color: #F92672;"> in</span> the executable
file you run.  This is mostly of use for maintainers to test new versions
of this helper program; chances are you did not intend to run this program.

  --list                list all dependencies and how they are resolved
  --verify              verify that given object really is a dynamically linked
            object we can handle
  --inhibit-cache       Do not use /etc/ld.so.cache
  --library-path PATH   use given PATH instead of content of the environment
            variable LD_LIBRARY_PATH
  --inhibit-rpath LIST  ignore RUNPATH and RPATH information<span style="color: #F92672;"> in</span> object names
            <span style="color: #F92672;">in</span> LIST
  --audit LIST          use objects named<span style="color: #F92672;"> in</span> LIST as auditors
</pre>
</div>


<p>
动态装载库<br />
</p>
<ul class="org-ul">
<li>dlopen  打开一个动态库<br /></li>
<li>dlsym   查找符号,以打开动态库句柄为根节点进行查找<br /></li>
<li>dlerror 查看是否有错<br /></li>
<li>dlclose 卸载动态库，引用计数为0才取消映射关系，之前会运行".finit"的代码<br /></li>
</ul>

<p>
<b>有些gcc编译的默认参数是&#x2013;enable-default-pie 需要额外加上-no-pie，使其生成EXEC而不是DYN</b><br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">stdio.h</span><span style="color: #AE81FF;">&gt;</span>
<span style="color: #F92672;">#include</span> <span style="color: #AE81FF;">&lt;</span><span style="color: #E6DB74;">dlfcn.h</span><span style="color: #AE81FF;">&gt;</span>

<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">gcc t.c -m32 -ldl -no-pie </span><span style="color: #75715E;">*/</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">./a.out /lib32/libm-2.28.so  </span><span style="color: #75715E;">*/</span>
<span style="color: #75715E;">/* </span><span style="color: #E6DB74;">1.000000 </span><span style="color: #75715E;">*/</span>

<span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">main</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span>, <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">argv</span><span style="color: #66D9EF;">[]</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">void</span> *<span style="color: #FD971F;">handle</span>;
    <span style="color: #66D9EF;">double</span> <span style="color: #66D9EF;">(</span>*<span style="color: #A6E22E; font-size: 130%;">func</span><span style="color: #66D9EF;">)(</span><span style="color: #66D9EF;">double</span><span style="color: #66D9EF;">)</span>;
    <span style="color: #66D9EF;">char</span> *<span style="color: #FD971F;">error</span>;

    handle = <span style="color: #A6E22E; font-weight: bold;">dlopen</span><span style="color: #66D9EF;">(</span>argv<span style="color: #A6E22E;">[</span>1<span style="color: #A6E22E;">]</span>, RTLD_NOW<span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #E6DB74; font-weight: bold;">!</span>handle<span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"failed to open lib\n"</span><span style="color: #A6E22E;">)</span>;
        <span style="color: #F92672;">return</span> -1;
    <span style="color: #66D9EF;">}</span>

    func = <span style="color: #A6E22E; font-weight: bold;">dlsym</span><span style="color: #66D9EF;">(</span>handle, <span style="color: #E6DB74;">"sin"</span><span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">if</span> <span style="color: #66D9EF;">(</span><span style="color: #A6E22E;">(</span>error = <span style="color: #A6E22E; font-weight: bold;">dlerror</span><span style="color: #E6DB74;">()</span><span style="color: #A6E22E;">)</span> != <span style="color: #AE81FF;">NULL</span><span style="color: #66D9EF;">)</span> <span style="color: #66D9EF;">{</span>
        <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #A6E22E;">(</span><span style="color: #E6DB74;">"error %s\n"</span>, error<span style="color: #A6E22E;">)</span>;
        <span style="color: #A6E22E; font-weight: bold;">dlclose</span><span style="color: #A6E22E;">(</span>handle<span style="color: #A6E22E;">)</span>;
    <span style="color: #66D9EF;">}</span>

    <span style="color: #A6E22E; font-weight: bold;">printf</span><span style="color: #66D9EF;">(</span><span style="color: #E6DB74;">"%f\n"</span>, <span style="color: #A6E22E; font-weight: bold;">func</span><span style="color: #A6E22E;">(</span>3.1415926 / 2<span style="color: #A6E22E;">)</span><span style="color: #66D9EF;">)</span>;
    <span style="color: #A6E22E; font-weight: bold;">dlclose</span><span style="color: #66D9EF;">(</span>handle<span style="color: #66D9EF;">)</span>;
    <span style="color: #F92672;">return</span> 0;
<span style="color: #AE81FF;">}</span>
</pre>
</div>
</div>
</div>
</div>
