books/程序员的自我修养.org
* 第八章 共享库的组织
so兼容性以ABI为准
版本号 libname.so.x.y.z
- x 主版本,重大升级
- y 次版本,增量升级
- z 发布版本号,修正
去掉.y.z，即为SONAME,用作.dynamic段里依赖关系,ldconfig可以建立相关的软链接
#+begin_src bash
gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration -Xlinker --version-script lib.ver -Wl,-soname,my_soname
readelf -d lib.so

Dynamic section at offset 0xef4 contains 27 entries:
  Tag        Type                         Name/Value
 0x00000001 (NEEDED)                     Shared library: [libc.so.6]
 0x0000000e (SONAME)                     Library soname: [my_soname]
#+end_src
链接名则更为简单，gcc -lXXX 相当于gcc libXXX.so.x
#+begin_src bash
ls -ll /lib/libc.so.6 
lrwxrwxrwx. 1 root root 12 Jul 23  2019 /lib/libc.so.6 -> libc-2.28.so
#+end_src
基于符号的版本机制，用于解决SONAME次版本号交会问题
#+begin_src bash
#file - lib.ver
#gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration -Xlinker --version-script lib.ver
VERS_1.2 {
    global:
        foo;
    local:
        *;
};

#gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration -Xlinker --version-script lib.ver
VERS_1.1 {
    global:
        foo;
    local:
        *;
};
./a.out
./a.out: ./lib.so: version `VERS_1.2' not found (required by ./a.out)
#+end_src
如上图，如果用VERS_1.1编译出的so再执行依赖它的可执行文件，会出错

*FHS*, linux目录组织标准

.so根据DT_NEED里的路径查找
- 绝对路径
- 相对路径
1. 环境变量 LD\under{}LIBRARY\under{}PATH
2. /etc/ld.so.cache <- 由ldconfig生成
3. /usr/lib /lib
此外，也可ld -rpath链接时指定路径，这样会在.dynamic里生成RPATH这个变量
#+begin_src bash
ld -rpath /auto/isbu_crdc/offlinediag/users/xuali2 1.o ./lib.so -m32 -m elf_i386
readelf -d a.out 

Dynamic section at offset 0xf50 contains 17 entries:
  Tag        Type                         Name/Value
 0x00000001 (NEEDED)                     Shared library: [my_soname]
 0x0000000f (RPATH)                      Library rpath: [/auto/isbu_crdc/offlinediag/users/xuali2]
#+end_src

环境变量LD\under{}PRELOAD可以预加载共享库，无论是否有依赖
环境变量LD\under{}DEBUG用来debug
#+begin_src bash
LD_DEBUG=files ./a.out 
     11762:	
     11762:	file=./lib.so [0];  needed by ./a.out [0]
     11762:	file=./lib.so [0];  generating link map
     11762:	  dynamic: 0xf7f51efc  base: 0xf7f50000   size: 0x0000201c
     11762:	    entry: 0xf7f50380  phdr: 0xf7f50034  phnum:          7
     11762:	
     11762:	
     11762:	file=libc.so.6 [0];  needed by ./a.out [0]
     11762:	file=libc.so.6 [0];  generating link map
     11762:	  dynamic: 0xf7f31d6c  base: 0xf7d8e000   size: 0x001a7780
     11762:	    entry: 0xf7da8650  phdr: 0xf7d8e034  phnum:         10
     11762:	
     11762:	./lib.so: error: version lookup error: version `VERS_1.2' not found (required by ./a.out) (continued)
./a.out: ./lib.so: version `VERS_1.2' not found (required by ./a.out)
#+end_src

* 第九章 Windows下的动态链接
略

* 第十章 内存
*以下都基于x86 CPU*
