程序员的自我修养.html

<div id="outline-container-org79ee3c9" class="outline-2">
<h2 id="org79ee3c9"><span class="section-number-2">8</span> 第八章 共享库的组织</h2>
<div class="outline-text-2" id="text-8">
<p>
so兼容性以ABI为准<br />
版本号 libname.so.x.y.z<br />
</p>
<ul class="org-ul">
<li>x 主版本,重大升级<br /></li>
<li>y 次版本,增量升级<br /></li>
<li>z 发布版本号,修正<br /></li>
</ul>
<p>
去掉.y.z，即为SONAME,用作.dynamic段里依赖关系,ldconfig可以建立相关的软链接<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration -Xlinker --version-script lib.ver -Wl,-soname,my_soname
readelf -d lib.so

Dynamic section at offset 0xef4 contains 27 entries:
  Tag        Type                         Name/Value
 0x00000001 (NEEDED)                     Shared library: [libc.so.6]
 0x0000000e (SONAME)                     Library soname: [my_soname]
</pre>
</div>
<p>
链接名则更为简单，gcc -lXXX 相当于gcc libXXX.so.x<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">ls -ll /lib/libc.so.6 
lrwxrwxrwx. 1 root root 12 Jul 23  2019 /lib/libc.so.6 -&gt; libc-2.28.so
</pre>
</div>
<p>
基于符号的版本机制，用于解决SONAME次版本号交会问题<br />
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #75715E;">#</span><span style="color: #E6DB74;">file - lib.ver</span>
<span style="color: #75715E;">#</span><span style="color: #E6DB74;">gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration -Xlinker --version-script lib.ver</span>
VERS_1.2 {
    global:
        foo;
    <span style="color: #F92672;">local</span>:
        *;
};

<span style="color: #75715E;">#</span><span style="color: #E6DB74;">gcc -fPIC -shared -o lib.so -m32 lib.c -Wno-implicit-function-declaration -Xlinker --version-script lib.ver</span>
VERS_1.1 {
    global:
        foo;
    <span style="color: #F92672;">local</span>:
        *;
};
./a.out
./a.out: ./lib.so: version <span style="color: #AE81FF; font-weight: bold;">`VERS_1.2' not found (required by ./a.out)</span>
</pre>
</div>
<p>
如上图，如果用VERS_1.1编译出的so再执行依赖它的可执行文件，会出错<br />
</p>

<p>
<b>FHS</b>, linux目录组织标准<br />
</p>

<p>
.so根据DT_NEED里的路径查找<br />
</p>
<ul class="org-ul">
<li>绝对路径<br /></li>
<li>相对路径<br /></li>
<li>环境变量 LD_LIBRARY_PATH<br /></li>
<li>/etc/ld.so.cache &lt;- 由ldconfig生成<br /></li>
<li>/usr/lib /lib<br /></li>
</ul>
<p>
此外，也可ld -rpath链接时指定路径，这样会在.dynamic里生成RPATH这个变量<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">ld -rpath /auto/isbu_crdc/offlinediag/users/xuali2 1.o ./lib.so -m32 -m elf_i386
readelf -d a.out 

Dynamic section at offset 0xf50 contains 17 entries:
  Tag        Type                         Name/Value
 0x00000001 (NEEDED)                     Shared library: [my_soname]
 0x0000000f (RPATH)                      Library rpath: [/auto/isbu_crdc/offlinediag/users/xuali2]
</pre>
</div>

<p>
环境变量LD_PRELOAD可以预加载共享库，无论是否有依赖<br />
环境变量LD_DEBUG用来debug<br />
</p>
<div class="org-src-container">
<pre class="src src-bash"><span style="color: #FD971F;">LD_DEBUG</span>=files ./a.out 
     11762: 
     11762: <span style="color: #FD971F;">file</span>=./lib.so [0];  needed by ./a.out [0]
     11762: <span style="color: #FD971F;">file</span>=./lib.so [0];  generating link map
     11762:   dynamic: 0xf7f51efc  base: 0xf7f50000   size: 0x0000201c
     11762:     entry: 0xf7f50380  phdr: 0xf7f50034  phnum:          7
     11762: 
     11762: 
     11762: <span style="color: #FD971F;">file</span>=libc.so.6 [0];  needed by ./a.out [0]
     11762: <span style="color: #FD971F;">file</span>=libc.so.6 [0];  generating link map
     11762:   dynamic: 0xf7f31d6c  base: 0xf7d8e000   size: 0x001a7780
     11762:     entry: 0xf7da8650  phdr: 0xf7d8e034  phnum:         10
     11762: 
     11762: ./lib.so: error: version lookup error: version <span style="color: #AE81FF; font-weight: bold;">`VERS_1.2' not found (required by ./a.out) (continued)</span>
<span style="color: #AE81FF; font-weight: bold;">./a.out: ./lib.so: version `</span>VERS_1.2<span style="color: #E6DB74;">' not found (required by ./a.out)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org73a0099" class="outline-2">
<h2 id="org73a0099"><span class="section-number-2">9</span> 第九章 Windows下的动态链接</h2>
<div class="outline-text-2" id="text-9">
<p>
略<br />
</p>
</div>
</div>
