books/程序员的自我修养.org
** 栈
- 函数的返回地址和参数(现在很多体系结构，如powerpc, mips64, x64都是寄存器直接传参，参数多了才放入栈)
- 临时变量(编译优化也会直接用寄存器)
- 保存的上下文，函数调用前后不变的寄存器

#+begin_src c
int foo(int a)
{
    int b = a - 1;
    return b;
}
#+end_src

- esp指向栈顶
- ebp索引变量
#+begin_src asm
  00000000 <foo>:
     0:	55                   	push   %ebp ; 将ebp入栈, esp = esp - 2, [esp] = %ebp
     1:	89 e5                	mov    %esp,%ebp ; epb = esp, *epb = *esp = old ebp
     3:	83 ec 10             	sub    $0x10,%esp ; 开栈
     6:	8b 45 08             	mov    0x8(%ebp),%eax ; 取实参a 0(%ebp) = old ebp 4(%ebp) = old pc
     9:	83 e8 01             	sub    $0x1,%eax      ; 自增
     c:	89 45 fc             	mov    %eax,-0x4(%ebp) ; b = a - 1;
     f:	8b 45 fc             	mov    -0x4(%ebp),%eax ; 返回值eax
    12:	c9                   	leave                  ; 相当于mov ebp esp, pop ebp, 相对的有个指令是ENTER == push ebp, mov esp ebp
    13:	c3                   	ret                    ; 退出 恢复 eip
#+end_src

调用惯例
默认用cdecl，以下call\under{}foo为cdecl方式
#+begin_src c
void call_foo(void)
{
    int c = 5;
    foo(c);
}
#+end_src

#+begin_src asm
  00000014 <call_foo>:
    14:	55                   	push   %ebp
    15:	89 e5                	mov    %esp,%ebp
    17:	83 ec 10             	sub    $0x10,%esp
    1a:	c7 45 fc 05 00 00 00 	movl   $0x5,-0x4(%ebp)
    21:	ff 75 fc             	pushl  -0x4(%ebp) ;传参
    24:	e8 fc ff ff ff       	call   25 <call_foo+0x11> ;调用foo 相当于 push eip, jmp foo
    29:	83 c4 04             	add    $0x4,%esp          ;将参数出栈
    2c:	90                   	nop
    2d:	c9                   	leave  
    2e:	c3                   	ret 
#+end_src

| 调用惯例 | 实参出栈方 | 参数传递                       |
|----------+------------+--------------------------------|
| cdecl    | 函数调用方 | 从右至左                       |
| stdcall  | 函数本身   | 从右至左                       |
| fastcall | 函数本身   | 寄存器，更多的参数从右至左入栈 |
| pascal   | 函数本身   | 从左至右                       |

返回长节字类型会使用栈而不是寄存器，所以应避免
#+begin_src c
struct big {
    char buf[128];
};

struct big foo(void)
{
    struct big b;
    b.buf[0] = 0;
    return b;
}


#+end_src

#+begin_src asm
    00000000 <foo>:
       0:	55                   	push   %ebp
       1:	89 e5                	mov    %esp,%ebp
       3:	57                   	push   %edi
       4:	56                   	push   %esi
       5:	53                   	push   %ebx
       6:	83 c4 80             	add    $0xffffff80,%esp ; esp = esp - 128
       9:	c6 85 74 ff ff ff 00 	movb   $0x0,-0x8c(%ebp) ;b.buf[0] = 0;
      10:	8b 45 08             	mov    0x8(%ebp),%eax   ;return b;
      13:	89 c2                	mov    %eax,%edx
      15:	8d 85 74 ff ff ff    	lea    -0x8c(%ebp),%eax
      1b:	b9 80 00 00 00       	mov    $0x80,%ecx
      20:	8b 18                	mov    (%eax),%ebx
      22:	89 1a                	mov    %ebx,(%edx)
      24:	8b 5c 08 fc          	mov    -0x4(%eax,%ecx,1),%ebx
      28:	89 5c 0a fc          	mov    %ebx,-0x4(%edx,%ecx,1)
      2c:	8d 5a 04             	lea    0x4(%edx),%ebx
      2f:	83 e3 fc             	and    $0xfffffffc,%ebx
      32:	29 da                	sub    %ebx,%edx
      34:	29 d0                	sub    %edx,%eax
      36:	01 d1                	add    %edx,%ecx
      38:	83 e1 fc             	and    $0xfffffffc,%ecx
      3b:	c1 e9 02             	shr    $0x2,%ecx
      3e:	89 ca                	mov    %ecx,%edx
      40:	89 df                	mov    %ebx,%edi
      42:	89 c6                	mov    %eax,%esi
      44:	89 d1                	mov    %edx,%ecx
      46:	f3 a5                	rep movsl %ds:(%esi),%es:(%edi) ;
      48:	8b 45 08             	mov    0x8(%ebp),%eax
      4b:	83 ec 80             	sub    $0xffffff80,%esp
      4e:	5b                   	pop    %ebx
      4f:	5e                   	pop    %esi
      50:	5f                   	pop    %edi
      51:	5d                   	pop    %ebp
      52:	c2 04 00             	ret    $0x4 ;pop 4个字节，看来大参数用了stdcall

  00000055 <call_foo>:
    55:	55                   	push   %ebp
    56:	89 e5                	mov    %esp,%ebp
    58:	83 c4 80             	add    $0xffffff80,%esp
    5b:	8d 45 80             	lea    -0x80(%ebp),%eax ;传入一个地址给foo去存b
    5e:	50                   	push   %eax
    5f:	e8 fc ff ff ff       	call   60 <call_foo+0xb>
    64:	90                   	nop
    65:	c9                   	leave  
    66:	c3                   	ret  
#+end_src

