程序员的自我修养.html

<div id="outline-container-org17befdf" class="outline-2">
<h2 id="org17befdf"><span class="section-number-2">10</span> 第十章 内存</h2>
<div class="outline-text-2" id="text-10">
<p>
<b>以下都基于x86 CPU</b><br />
</p>
</div>
<div id="outline-container-org1f26e32" class="outline-3">
<h3 id="org1f26e32"><span class="section-number-3">10.1</span> 栈</h3>
<div class="outline-text-3" id="text-10-1">
<ul class="org-ul">
<li>函数的返回地址和参数(现在很多体系结构，如powerpc, mips64, x64都是寄存器直接传参，参数多了才放入栈)<br /></li>
<li>临时变量(编译优化也会直接用寄存器)<br /></li>
<li>保存的上下文，函数调用前后不变的寄存器<br /></li>
</ul>

<div class="org-src-container">
<pre class="src src-c"><span style="color: #66D9EF;">int</span> <span style="color: #A6E22E; font-size: 130%;">foo</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">a</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">b</span> = a - 1;
    <span style="color: #F92672;">return</span> b;
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<ul class="org-ul">
<li>esp指向栈顶<br /></li>
<li>ebp索引变量<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-asm"><span style="color: #A6E22E; font-size: 130%;">00000000</span> &lt;foo&gt;:
   <span style="color: #F92672;">0</span>:   55                      push   <span style="color: #FD971F;">%ebp</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#23558;ebp&#20837;&#26632;, esp = esp - 2, [esp] = %ebp</span>
   <span style="color: #F92672;">1</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">epb = esp, *epb = *esp = old ebp</span>
   <span style="color: #F92672;">3</span>:   83 ec 10                sub    $0x10,<span style="color: #FD971F;">%esp</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#24320;&#26632;</span>
   <span style="color: #F92672;">6</span>:   8b 45 08                mov    0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#21462;&#23454;&#21442;a 0(%ebp) = old ebp 4(%ebp) = old pc</span>
   <span style="color: #F92672;">9</span>:   83 e8 01                sub    $0x1,<span style="color: #FD971F;">%eax</span>      <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#33258;&#22686;</span>
   <span style="color: #F92672;">c</span>:   89 45 fc                mov    <span style="color: #FD971F;">%eax</span>,-0x4(<span style="color: #FD971F;">%ebp</span>) <span style="color: #75715E;">; </span><span style="color: #E6DB74;">b = a - 1;</span>
   <span style="color: #F92672;">f</span>:   8b 45 fc                mov    -0x4(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36820;&#22238;&#20540;eax</span>
  <span style="color: #F92672;">12</span>:   c9                      leave                  <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#30456;&#24403;&#20110;mov ebp esp, pop ebp, &#30456;&#23545;&#30340;&#26377;&#20010;&#25351;&#20196;&#26159;ENTER == push ebp, mov esp ebp</span>
  <span style="color: #F92672;">13</span>:   c3                      ret                    <span style="color: #75715E;">; </span><span style="color: #E6DB74;">&#36864;&#20986; &#24674;&#22797; cs ip</span>
</pre>
</div>

<p>
调用惯例<br />
默认用cdecl，以下call_foo为cdecl方式<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">call_foo</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">void</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">c</span> = 5;
    <span style="color: #A6E22E; font-weight: bold;">foo</span><span style="color: #66D9EF;">(</span>c<span style="color: #66D9EF;">)</span>;
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-asm"><span style="color: #A6E22E; font-size: 130%;">00000014</span> &lt;call_foo&gt;:
  <span style="color: #F92672;">14</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
  <span style="color: #F92672;">15</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
  <span style="color: #F92672;">17</span>:   83 ec 10                sub    $0x10,<span style="color: #FD971F;">%esp</span>
  <span style="color: #F92672;">1a</span>:   c7 45 fc 05 00 00 00    movl   $0x5,-0x4(<span style="color: #FD971F;">%ebp</span>)
  <span style="color: #F92672;">21</span>:   ff 75 fc                pushl  -0x4(<span style="color: #FD971F;">%ebp</span>) <span style="color: #75715E;">;</span><span style="color: #E6DB74;">&#20256;&#21442;</span>
  <span style="color: #F92672;">24</span>:   e8 fc ff ff ff          call   25 &lt;call_foo+0x11&gt; <span style="color: #75715E;">;</span><span style="color: #E6DB74;">&#35843;&#29992;foo &#30456;&#24403;&#20110; push eip, jmp foo</span>
  <span style="color: #F92672;">29</span>:   83 c4 04                add    $0x4,<span style="color: #FD971F;">%esp</span>          <span style="color: #75715E;">;</span><span style="color: #E6DB74;">&#23558;&#21442;&#25968;&#20986;&#26632;</span>
  <span style="color: #F92672;">2c</span>:   90                      nop
  <span style="color: #F92672;">2d</span>:   c9                      leave  
  <span style="color: #F92672;">2e</span>:   c3                      ret 
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">调用惯例</th>
<th scope="col" class="org-left">实参出栈方</th>
<th scope="col" class="org-left">参数传递</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">cdecl</td>
<td class="org-left">函数调用方</td>
<td class="org-left">从右至左</td>
</tr>

<tr>
<td class="org-left">stdcall</td>
<td class="org-left">函数本身</td>
<td class="org-left">从右至左</td>
</tr>

<tr>
<td class="org-left">fastcall</td>
<td class="org-left">函数本身</td>
<td class="org-left">寄存器，更多的参数从右至左入栈</td>
</tr>

<tr>
<td class="org-left">pascal</td>
<td class="org-left">函数本身</td>
<td class="org-left">从左至右</td>
</tr>
</tbody>
</table>

<p>
返回长节字类型会使用栈而不是寄存器，所以应避免<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">big</span> <span style="color: #AE81FF;">{</span>
    <span style="color: #66D9EF;">char</span> <span style="color: #FD971F;">buf</span><span style="color: #66D9EF;">[</span>128<span style="color: #66D9EF;">]</span>;
<span style="color: #AE81FF;">}</span>;

<span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">big</span> <span style="color: #A6E22E; font-size: 130%;">foo</span><span style="color: #AE81FF;">(</span><span style="color: #66D9EF;">void</span><span style="color: #AE81FF;">)</span>
<span style="color: #AE81FF;">{</span>
    <span style="color: #F92672;">struct</span> <span style="color: #66D9EF;">big</span> <span style="color: #FD971F;">b</span>;
    b.buf<span style="color: #66D9EF;">[</span>0<span style="color: #66D9EF;">]</span> = 0;
    <span style="color: #F92672;">return</span> b;
<span style="color: #AE81FF;">}</span>


</pre>
</div>

<div class="org-src-container">
<pre class="src src-asm">  <span style="color: #F92672;">00000000</span> &lt;foo&gt;:
     <span style="color: #F92672;">0</span>: 55                      push   <span style="color: #FD971F;">%ebp</span>
     <span style="color: #F92672;">1</span>: 89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
     <span style="color: #F92672;">3</span>: 57                      push   <span style="color: #FD971F;">%edi</span>
     <span style="color: #F92672;">4</span>: 56                      push   <span style="color: #FD971F;">%esi</span>
     <span style="color: #F92672;">5</span>: 53                      push   <span style="color: #FD971F;">%ebx</span>
     <span style="color: #F92672;">6</span>: 83 c4 80                add    $0xffffff80,<span style="color: #FD971F;">%esp</span> <span style="color: #75715E;">; </span><span style="color: #E6DB74;">esp = esp - 128</span>
     <span style="color: #F92672;">9</span>: c6 85 74 ff ff ff 00    movb   $0x0,-0x8c(<span style="color: #FD971F;">%ebp</span>) <span style="color: #75715E;">;</span><span style="color: #E6DB74;">b.buf[0] = 0;</span>
    <span style="color: #F92672;">10</span>: 8b 45 08                mov    0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>   <span style="color: #75715E;">;</span><span style="color: #E6DB74;">return b;</span>
    <span style="color: #F92672;">13</span>: 89 c2                   mov    <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%edx</span>
    <span style="color: #F92672;">15</span>: 8d 85 74 ff ff ff       lea    -0x8c(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>
    <span style="color: #F92672;">1b</span>: b9 80 00 00 00          mov    $0x80,<span style="color: #FD971F;">%ecx</span>
    <span style="color: #F92672;">20</span>: 8b 18                   mov    (<span style="color: #FD971F;">%eax</span>),<span style="color: #FD971F;">%ebx</span>
    <span style="color: #F92672;">22</span>: 89 1a                   mov    <span style="color: #FD971F;">%ebx</span>,(<span style="color: #FD971F;">%edx</span>)
    <span style="color: #F92672;">24</span>: 8b 5c 08 fc             mov    -0x4(<span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%ecx</span>,1),<span style="color: #FD971F;">%ebx</span>
    <span style="color: #F92672;">28</span>: 89 5c 0a fc             mov    <span style="color: #FD971F;">%ebx</span>,-0x4(<span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%ecx</span>,1)
    <span style="color: #F92672;">2c</span>: 8d 5a 04                lea    0x4(<span style="color: #FD971F;">%edx</span>),<span style="color: #FD971F;">%ebx</span>
    <span style="color: #F92672;">2f</span>: 83 e3 fc                and    $0xfffffffc,<span style="color: #FD971F;">%ebx</span>
    <span style="color: #F92672;">32</span>: 29 da                   sub    <span style="color: #FD971F;">%ebx</span>,<span style="color: #FD971F;">%edx</span>
    <span style="color: #F92672;">34</span>: 29 d0                   sub    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%eax</span>
    <span style="color: #F92672;">36</span>: 01 d1                   add    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%ecx</span>
    <span style="color: #F92672;">38</span>: 83 e1 fc                and    $0xfffffffc,<span style="color: #FD971F;">%ecx</span>
    <span style="color: #F92672;">3b</span>: c1 e9 02                shr    $0x2,<span style="color: #FD971F;">%ecx</span>
    <span style="color: #F92672;">3e</span>: 89 ca                   mov    <span style="color: #FD971F;">%ecx</span>,<span style="color: #FD971F;">%edx</span>
    <span style="color: #F92672;">40</span>: 89 df                   mov    <span style="color: #FD971F;">%ebx</span>,<span style="color: #FD971F;">%edi</span>
    <span style="color: #F92672;">42</span>: 89 c6                   mov    <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%esi</span>
    <span style="color: #F92672;">44</span>: 89 d1                   mov    <span style="color: #FD971F;">%edx</span>,<span style="color: #FD971F;">%ecx</span>
    <span style="color: #F92672;">46</span>: f3 a5                   rep movsl <span style="color: #FD971F;">%ds</span>:(<span style="color: #FD971F;">%esi</span>),<span style="color: #FD971F;">%es</span>:(<span style="color: #FD971F;">%edi</span>) <span style="color: #75715E;">;</span>
    <span style="color: #F92672;">48</span>: 8b 45 08                mov    0x8(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span>
    <span style="color: #F92672;">4b</span>: 83 ec 80                sub    $0xffffff80,<span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">4e</span>: 5b                      pop    <span style="color: #FD971F;">%ebx</span>
    <span style="color: #F92672;">4f</span>: 5e                      pop    <span style="color: #FD971F;">%esi</span>
    <span style="color: #F92672;">50</span>: 5f                      pop    <span style="color: #FD971F;">%edi</span>
    <span style="color: #F92672;">51</span>: 5d                      pop    <span style="color: #FD971F;">%ebp</span>
    <span style="color: #F92672;">52</span>: c2 04 00                ret    $0x4 <span style="color: #75715E;">;</span><span style="color: #E6DB74;">pop 4&#20010;&#23383;&#33410;&#65292;&#30475;&#26469;&#22823;&#21442;&#25968;&#29992;&#20102;stdcall</span>

<span style="color: #A6E22E; font-size: 130%;">00000055</span> &lt;call_foo&gt;:
  <span style="color: #F92672;">55</span>:   55                      push   <span style="color: #FD971F;">%ebp</span>
  <span style="color: #F92672;">56</span>:   89 e5                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ebp</span>
  <span style="color: #F92672;">58</span>:   83 c4 80                add    $0xffffff80,<span style="color: #FD971F;">%esp</span>
  <span style="color: #F92672;">5b</span>:   8d 45 80                lea    -0x80(<span style="color: #FD971F;">%ebp</span>),<span style="color: #FD971F;">%eax</span> <span style="color: #75715E;">;</span><span style="color: #E6DB74;">&#20256;&#20837;&#19968;&#20010;&#22320;&#22336;&#32473;foo&#21435;&#23384;b</span>
  <span style="color: #F92672;">5e</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
  <span style="color: #F92672;">5f</span>:   e8 fc ff ff ff          call   60 &lt;call_foo+0xb&gt;
  <span style="color: #F92672;">64</span>:   90                      nop
  <span style="color: #F92672;">65</span>:   c9                      leave  
  <span style="color: #F92672;">66</span>:   c3                      ret  
</pre>
</div>
</div>
</div>
