books/程序员的自我修养.org
** 堆与内存管理

通用做法是向系统申请页为单位的大块内存，然后在用户态设计数据结构管理及响应业务申请内存

系统调用
- brk
- mmap

堆分配算法
- 空闲链表
空闲块的开头有链表指针，指向下一个或上一个空闲块，产生 *外部碎片*
- 位图
每大块内存按固定大小切片，内部划分一片区域(常为内存头)存放位图表示空闲和已申请块，产生 *内部碎片*
这种在现有系统里被广泛使用并有各种变种，经常按 *固定大小* 分为 8 16 32 64 128 256 等内存池

* 第十一章 运行库
glibc *git://sourceware.org/git/glibc.git*
*以最简单的静态链接为例,同时不能-nostdlib或-nonstartfiles选项编译*

入口函数
- 不是main，一般为_start
- 初始化进程环境，包括堆、I/O、线程、全局变量构造
- 调用main
- main返回后，清理环境，包括析构，关闭I/O等(就算不做操作系统也会帮忙)


流程为 _start -> __libc_start_main -> main -> exit -> _exit
#+begin_src asm
  _start:
      /* Clear the frame pointer.  The ABI suggests this be done, to mark
         the outermost frame obviously.  */
      xorl %ebp, %ebp

      /* Extract the arguments as encoded on the stack and set up
         the arguments for `main': argc, argv.  envp will be determined
         later in __libc_start_main.  */
      popl %esi		/* Pop the argument count.  */
      movl %esp, %ecx		/* argv starts just at the current stack top.*/

      /* Before pushing the arguments align the stack to a 16-byte
      (SSE needs 16-byte alignment) boundary to avoid penalties from
      misaligned accesses.  Thanks to Edward Seidl <seidl@janed.com>
      for pointing this out.  */
      andl $0xfffffff0, %esp
      pushl %eax		/* Push garbage because we allocate
                     28 more bytes.  */

      /* Provide the highest stack address to the user code (for stacks
         which grow downwards).  */
      pushl %esp

      pushl %edx		/* Push address of the shared library
                     termination function.  */

  #ifdef SHARED
      /* Load PIC register.  */
      call 1f
      addl $_GLOBAL_OFFSET_TABLE_, %ebx

      /* Push address of our own entry points to .fini and .init.  */
      leal __libc_csu_fini@GOTOFF(%ebx), %eax
      pushl %eax
      leal __libc_csu_init@GOTOFF(%ebx), %eax
      pushl %eax

      pushl %ecx		/* Push second argument: argv.  */
      pushl %esi		/* Push first argument: argc.  */

      pushl main@GOT(%ebx)

      /* Call the user's main function, and exit with its value.
         But let the libc call main.    */
      call __libc_start_main@PLT
  #else
      /* Push address of our own entry points to .fini and .init.  */
      pushl $__libc_csu_fini
      pushl $__libc_csu_init

      pushl %ecx		/* Push second argument: argv.  */
      pushl %esi		/* Push first argument: argc.  */

      pushl $main

      /* Call the user's main function, and exit with its value.
         But let the libc call main.    */
      call __libc_start_main
  #endif

      hlt			/* Crash if somehow `exit' does return.  */

  _exit:
      movl	4(%esp), %ebx

      /* Try the new syscall first.  */
  #ifdef __NR_exit_group
      movl	$__NR_exit_group, %eax
      ENTER_KERNEL
  #endif

      /* Not available.  Now the old one.  */
      movl	$__NR_exit, %eax
      /* Don't bother using ENTER_KERNEL here.  If the exit_group
         syscall is not available AT_SYSINFO isn't either.  */
      int	$0x80                   ;系统调用，进程退出
#+end_src

上述_start代码相当于
#+begin_src c
void _start()
{
    %ebp = 0;
    int argc = pop from stack
    char **argv = top of stack
    __libc_start_main(main, argc, argv, __libc_csu_init, )
}
#+end_src

在linux中，任何I/O都被抽象成对象
fd -> 内核文件表 -> 内核对象

C标准库ANSI C，最新的好像是C11
