程序员的自我修养.html

<div id="outline-container-org16cd02e" class="outline-3">
<h3 id="org16cd02e"><span class="section-number-3">10.2</span> 堆与内存管理</h3>
<div class="outline-text-3" id="text-10-2">
<p>
通用做法是向系统申请页为单位的大块内存，然后在用户态设计数据结构管理及响应业务申请内存<br />
</p>

<p>
系统调用<br />
</p>
<ul class="org-ul">
<li>brk<br /></li>
<li>mmap<br /></li>
</ul>

<p>
堆分配算法<br />
</p>
<ul class="org-ul">
<li>空闲链表<br /></li>
</ul>
<p>
空闲块的开头有链表指针，指向下一个或上一个空闲块，产生 <b>外部碎片</b><br />
</p>
<ul class="org-ul">
<li>位图<br /></li>
</ul>
<p>
每大块内存按固定大小切片，内部划分一片区域(常为内存头)存放位图表示空闲和已申请块，产生 <b>内部碎片</b><br />
这种在现有系统里被广泛使用并有各种变种，经常按 <b>固定大小</b> 分为 8 16 32 64 128 256 等内存池<br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgcf66636" class="outline-2">
<h2 id="orgcf66636"><span class="section-number-2">11</span> 第十一章 运行库</h2>
<div class="outline-text-2" id="text-11">
<p>
glibc <b>git://sourceware.org/git/glibc.git</b><br />
<b>以最简单的静态链接为例,同时不能-nostdlib或-nonstartfiles选项编译</b><br />
</p>

<p>
入口函数<br />
</p>
<ul class="org-ul">
<li>不是main，一般为_start<br /></li>
<li>初始化进程环境，包括堆、I/O、线程、全局变量构造<br /></li>
<li>调用main<br /></li>
<li>main返回后，清理环境，包括析构，关闭I/O等(就算不做操作系统也会帮忙)<br /></li>
</ul>


<p>
流程为 _start -&gt; __libc_start_main -&gt; main -&gt; exit -&gt; _exit<br />
</p>
<div class="org-src-container">
<pre class="src src-asm"><span style="color: #A6E22E; font-size: 130%;">_start</span>:
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Clear the frame pointer.  The ABI suggests this be done, to mark</span>
<span style="color: #E6DB74;">       the outermost frame obviously.  */</span>
    <span style="color: #F92672;">xorl</span> <span style="color: #FD971F;">%ebp</span>, <span style="color: #FD971F;">%ebp</span>

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Extract the arguments as encoded on the stack and set up</span>
<span style="color: #E6DB74;">       the arguments for `main': argc, argv.  envp will be determined</span>
<span style="color: #E6DB74;">       later in __libc_start_main.  */</span>
    <span style="color: #F92672;">popl</span> <span style="color: #FD971F;">%esi</span>       <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Pop the argument count.  */</span>
    <span style="color: #F92672;">movl</span> <span style="color: #FD971F;">%esp</span>, <span style="color: #FD971F;">%ecx</span>     <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">argv starts just at the current stack top.*/</span>

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Before pushing the arguments align the stack to a 16-byte</span>
<span style="color: #E6DB74;">    (SSE needs 16-byte alignment) boundary to avoid penalties from</span>
<span style="color: #E6DB74;">    misaligned accesses.  Thanks to Edward Seidl <a href="mailto:seidl%40janed.com">&lt;seidl@janed.com&gt;</a></span>
<span style="color: #E6DB74;">    for pointing this out.  */</span>
    <span style="color: #F92672;">andl</span> $0xfffffff0, <span style="color: #FD971F;">%esp</span>
    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%eax</span>      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push garbage because we allocate</span>
<span style="color: #E6DB74;">                   28 more bytes.  */</span>

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Provide the highest stack address to the user code (for stacks</span>
<span style="color: #E6DB74;">       which grow downwards).  */</span>
    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%esp</span>

    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%edx</span>      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push address of the shared library</span>
<span style="color: #E6DB74;">                   termination function.  */</span>

<span style="color: #F92672;">#ifdef</span> <span style="color: #FD971F;">SHARED</span>
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Load PIC register.  */</span>
    <span style="color: #F92672;">call</span> 1f
    <span style="color: #F92672;">addl</span> $_GLOBAL_OFFSET_TABLE_, <span style="color: #FD971F;">%ebx</span>

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push address of our own entry points to .fini and .init.  */</span>
    <span style="color: #F92672;">leal</span> __libc_csu_fini@GOTOFF(<span style="color: #FD971F;">%ebx</span>), <span style="color: #FD971F;">%eax</span>
    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%eax</span>
    <span style="color: #F92672;">leal</span> __libc_csu_init@GOTOFF(<span style="color: #FD971F;">%ebx</span>), <span style="color: #FD971F;">%eax</span>
    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%eax</span>

    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%ecx</span>      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push second argument: argv.  */</span>
    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%esi</span>      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push first argument: argc.  */</span>

    <span style="color: #F92672;">pushl</span> main@GOT(<span style="color: #FD971F;">%ebx</span>)

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Call the user's main function, and exit with its value.</span>
<span style="color: #E6DB74;">       But let the libc call main.    */</span>
    <span style="color: #F92672;">call</span> __libc_start_main@PLT
<span style="color: #F92672;">#else</span>
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push address of our own entry points to .fini and .init.  */</span>
    <span style="color: #F92672;">pushl</span> $__libc_csu_fini
    <span style="color: #F92672;">pushl</span> $__libc_csu_init

    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%ecx</span>      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push second argument: argv.  */</span>
    <span style="color: #F92672;">pushl</span> <span style="color: #FD971F;">%esi</span>      <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Push first argument: argc.  */</span>

    <span style="color: #F92672;">pushl</span> $main

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Call the user's main function, and exit with its value.</span>
<span style="color: #E6DB74;">       But let the libc call main.    */</span>
    <span style="color: #F92672;">call</span> __libc_start_main
<span style="color: #F92672;">#endif</span>

    <span style="color: #F92672;">hlt</span>         <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Crash if somehow `exit' does return.  */</span>

<span style="color: #A6E22E; font-size: 130%;">_exit</span>:
    <span style="color: #F92672;">movl</span>    4(<span style="color: #FD971F;">%esp</span>), <span style="color: #FD971F;">%ebx</span>

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Try the new syscall first.  */</span>
<span style="color: #F92672;">#ifdef</span> <span style="color: #FD971F;">__NR_exit_group</span>
    <span style="color: #F92672;">movl</span>    $__NR_exit_group, <span style="color: #FD971F;">%eax</span>
    <span style="color: #F92672;">ENTER_KERNEL</span>
<span style="color: #F92672;">#endif</span>

    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Not available.  Now the old one.  */</span>
    <span style="color: #F92672;">movl</span>    $__NR_exit, <span style="color: #FD971F;">%eax</span>
    <span style="color: #75715E;">/* </span><span style="color: #E6DB74;">Don't bother using ENTER_KERNEL here.  If the exit_group</span>
<span style="color: #E6DB74;">       syscall is not available AT_SYSINFO isn't either.  */</span>
    <span style="color: #F92672;">int</span> $0x80                   <span style="color: #75715E;">;</span><span style="color: #E6DB74;">&#31995;&#32479;&#35843;&#29992;&#65292;&#36827;&#31243;&#36864;&#20986;</span>
</pre>
</div>

<p>
上述_start代码相当于<br />
</p>
<div class="org-src-container">
<pre class="src src-c"><span style="color: #66D9EF;">void</span> <span style="color: #A6E22E; font-size: 130%;">_start</span><span style="color: #AE81FF;">()</span>
<span style="color: #AE81FF;">{</span>
    %ebp = 0;
    <span style="color: #66D9EF;">int</span> <span style="color: #FD971F;">argc</span> = pop from stack
    <span style="color: #66D9EF;">char</span> **argv = top of stack
    <span style="color: #A6E22E; font-weight: bold;">__libc_start_main</span><span style="color: #66D9EF;">(</span>main, argc, argv, __libc_csu_init, <span style="color: #66D9EF;">)</span>
<span style="color: #AE81FF;">}</span>
</pre>
</div>

<p>
在linux中，任何I/O都被抽象成对象<br />
fd -&gt; 内核文件表 -&gt; 内核对象<br />
</p>

<p>
C标准库ANSI C，最新的好像是C11<br />
</p>
</div>
