books/程序员的自我修养.org
** glibc启动文件
#+begin_src bash
 /usr/lib/gcc/x86_64-linux-gnu/6/collect2 -plugin /usr/lib/gcc/x86_64-linux-gnu/6/liblto_plugin.so -plugin-opt=/usr/lib/gcc/x86_64-linux-gnu/6/lto-wrapper -plugin-opt=-fresolution=/tmp/cchtzGwz.res -plugin-opt=-pass-through=-lgcc -plugin-opt=-pass-through=-lgcc_eh -plugin-opt=-pass-through=-lc --sysroot=/ --build-id -m elf_i386 --hash-style=gnu -static /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crt1.o /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crti.o /usr/lib/gcc/x86_64-linux-gnu/6/32/crtbeginT.o -L/usr/lib/gcc/x86_64-linux-gnu/6/32 -L/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32 -L/lib/../lib32 -L/usr/lib/../lib32 -L/usr/lib/gcc/x86_64-linux-gnu/6 -L/usr/lib/gcc/x86_64-linux-gnu/6/../../.. /tmp/ccA5Dm0B.o --start-group -lgcc -lgcc_eh -lc --end-group /usr/lib/gcc/x86_64-linux-gnu/6/32/crtend.o /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crtn.o
COLLECT_GCC_OPTIONS='-m32' '-static' '-v' '-mtune=generic' '-march=i686'
#+end_src

*ld crt1.o crti.o [user\under{}objects] [system\under{}libraries] crtn.o*, 对比以下汇编，init和.fini段完美构成\under{}init()和\under{}fini()

*注意[user\under{}objects] [system\under{}libraries].init .fini里的代码不能有ret，不然会退出_init函数，这个不像.ctor和.dtor段是存的函数指针*

- crt1.o
#+begin_src asm
/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crt1.o:     file format elf32-i386


Disassembly of section .text:

00000000 <_start>:
   0:	31 ed                	xor    %ebp,%ebp
   2:	5e                   	pop    %esi
   3:	89 e1                	mov    %esp,%ecx
   5:	83 e4 f0             	and    $0xfffffff0,%esp
   8:	50                   	push   %eax
   9:	54                   	push   %esp
   a:	52                   	push   %edx
   b:	e8 23 00 00 00       	call   33 <_start+0x33>
  10:	81 c3 02 00 00 00    	add    $0x2,%ebx
			12: R_386_GOTPC	_GLOBAL_OFFSET_TABLE_
  16:	8d 83 00 00 00 00    	lea    0x0(%ebx),%eax
			18: R_386_GOTOFF	__libc_csu_fini
  1c:	50                   	push   %eax
  1d:	8d 83 00 00 00 00    	lea    0x0(%ebx),%eax
			1f: R_386_GOTOFF	__libc_csu_init
  23:	50                   	push   %eax
  24:	51                   	push   %ecx
  25:	56                   	push   %esi
  26:	8b 83 00 00 00 00    	mov    0x0(%ebx),%eax
			28: R_386_GOT32X	main
  2c:	50                   	push   %eax
  2d:	e8 fc ff ff ff       	call   2e <_start+0x2e>
			2e: R_386_PLT32	__libc_start_main
  32:	f4                   	hlt    
  33:	8b 1c 24             	mov    (%esp),%ebx
  36:	c3                   	ret    
  37:	66 90                	xchg   %ax,%ax
  39:	66 90                	xchg   %ax,%ax
  3b:	66 90                	xchg   %ax,%ax
  3d:	66 90                	xchg   %ax,%ax
  3f:	90                   	nop

00000040 <_dl_relocate_static_pie>:
  40:	c3                   	ret 
#+end_src

- crti.o
#+begin_src asm
objdump -dr /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crti.o

/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crti.o:     file format elf32-i386


Disassembly of section .init:

00000000 <_init>:
   0:	53                   	push   %ebx
   1:	83 ec 08             	sub    $0x8,%esp
   4:	e8 fc ff ff ff       	call   5 <_init+0x5>
			5: R_386_PC32	__x86.get_pc_thunk.bx
   9:	81 c3 02 00 00 00    	add    $0x2,%ebx
			b: R_386_GOTPC	_GLOBAL_OFFSET_TABLE_
   f:	8b 83 00 00 00 00    	mov    0x0(%ebx),%eax
			11: R_386_GOT32X	__gmon_start__
  15:	85 c0                	test   %eax,%eax
  17:	74 02                	je     1b <_init+0x1b>
  19:	ff d0                	call   *%eax

Disassembly of section .gnu.linkonce.t.__x86.get_pc_thunk.bx:

00000000 <__x86.get_pc_thunk.bx>:
   0:	8b 1c 24             	mov    (%esp),%ebx
   3:	c3                   	ret    

Disassembly of section .fini:

00000000 <_fini>:
   0:	53                   	push   %ebx
   1:	83 ec 08             	sub    $0x8,%esp
   4:	e8 fc ff ff ff       	call   5 <_fini+0x5>
			5: R_386_PC32	__x86.get_pc_thunk.bx
   9:	81 c3 02 00 00 00    	add    $0x2,%ebx
			b: R_386_GOTPC	_GLOBAL_OFFSET_TABLE_
#+end_src

- crtn.o
#+begin_src asm
objdump -dr /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crtn.o

/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crtn.o:     file format elf32-i386


Disassembly of section .init:

00000000 <.init>:
   0:	83 c4 08             	add    $0x8,%esp
   3:	5b                   	pop    %ebx
   4:	c3                   	ret    

Disassembly of section .fini:

00000000 <.fini>:
   0:	83 c4 08             	add    $0x8,%esp
   3:	5b                   	pop    %ebx
   4:	c3                   	ret  
#+end_src

- crtbeginT.o 和 crtend.o，C++全局构造和析构

多线程库里对很多不可重入函数加锁或者用了TLS
TLS接口: pthread\under{}key\under{}create(), pthread\under{}getspecific(), pthread\under{}setspecific(), pthread\under{}key\under{}delete()

glibc在处理C++全局构造和析构时, \under{}\under{}libc\under{}start\under{}main -> \under{}\under{}libc\under{}csu\under{}init -> \under{}init -> crtbeginT.o里的\under{}\under{}do\under{}global\under{}ctors\under{}aux -> 初始化.ctors段里函数指针，里面存放的构造函数,并用\under{}\under{}cxa\under{}exit注册了析构
*.dtor原来是做析构的，但是有了__cxa_exit就不用了*

