程序员的自我修养.html
<div id="outline-container-orgdc1316f" class="outline-3">
<h3 id="orgdc1316f"><span class="section-number-3">11.1</span> glibc启动文件</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-bash"> /usr/lib/gcc/x86_64-linux-gnu/6/collect2 -plugin /usr/lib/gcc/x86_64-linux-gnu/6/liblto_plugin.so -plugin-opt=/usr/lib/gcc/x86_64-linux-gnu/6/lto-wrapper -plugin-opt=-fresolution=/tmp/cchtzGwz.res -plugin-opt=-pass-through=-lgcc -plugin-opt=-pass-through=-lgcc_eh -plugin-opt=-pass-through=-lc --sysroot=/ --build-id -m elf_i386 --hash-style=gnu -static /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crt1.o /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crti.o /usr/lib/gcc/x86_64-linux-gnu/6/32/crtbeginT.o -L/usr/lib/gcc/x86_64-linux-gnu/6/32 -L/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32 -L/lib/../lib32 -L/usr/lib/../lib32 -L/usr/lib/gcc/x86_64-linux-gnu/6 -L/usr/lib/gcc/x86_64-linux-gnu/6/../../.. /tmp/ccA5Dm0B.o --start-group -lgcc -lgcc_eh -lc --end-group /usr/lib/gcc/x86_64-linux-gnu/6/32/crtend.o /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crtn.o
<span style="color: #FD971F;">COLLECT_GCC_OPTIONS</span>=<span style="color: #E6DB74;">'-m32'</span> <span style="color: #E6DB74;">'-static'</span> <span style="color: #E6DB74;">'-v'</span> <span style="color: #E6DB74;">'-mtune=generic'</span> <span style="color: #E6DB74;">'-march=i686'</span>
</pre>
</div>

<p>
<b>ld crt1.o crti.o [user_objects] [system_libraries] crtn.o</b>, 对比以下汇编，init和.fini段完美构成_init()和_fini()<br />
</p>

<p>
<b>注意[user_objects] [system_libraries].init .fini里的代码不能有ret，不然会退出_init函数，这个不像.ctor和.dtor段是存的函数指针</b><br />
</p>

<ul class="org-ul">
<li>crt1.o<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-asm">/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crt1.o:     file format elf32-i386


<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .text:

<span style="color: #A6E22E; font-size: 130%;">00000000</span> &lt;_start&gt;:
   <span style="color: #F92672;">0</span>:   31 ed                   xor    <span style="color: #FD971F;">%ebp</span>,<span style="color: #FD971F;">%ebp</span>
   <span style="color: #F92672;">2</span>:   5e                      pop    <span style="color: #FD971F;">%esi</span>
   <span style="color: #F92672;">3</span>:   89 e1                   mov    <span style="color: #FD971F;">%esp</span>,<span style="color: #FD971F;">%ecx</span>
   <span style="color: #F92672;">5</span>:   83 e4 f0                and    $0xfffffff0,<span style="color: #FD971F;">%esp</span>
   <span style="color: #F92672;">8</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
   <span style="color: #F92672;">9</span>:   54                      push   <span style="color: #FD971F;">%esp</span>
   <span style="color: #F92672;">a</span>:   52                      push   <span style="color: #FD971F;">%edx</span>
   <span style="color: #F92672;">b</span>:   e8 23 00 00 00          call   33 &lt;_start+0x33&gt;
  <span style="color: #F92672;">10</span>:   81 c3 02 00 00 00       add    $0x2,<span style="color: #FD971F;">%ebx</span>
            <span style="color: #F92672;">12</span>: R_386_GOTPC _GLOBAL_OFFSET_TABLE_
  <span style="color: #F92672;">16</span>:   8d 83 00 00 00 00       lea    0x0(<span style="color: #FD971F;">%ebx</span>),<span style="color: #FD971F;">%eax</span>
            <span style="color: #F92672;">18</span>: R_386_GOTOFF    __libc_csu_fini
  <span style="color: #F92672;">1c</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
  <span style="color: #F92672;">1d</span>:   8d 83 00 00 00 00       lea    0x0(<span style="color: #FD971F;">%ebx</span>),<span style="color: #FD971F;">%eax</span>
            <span style="color: #F92672;">1f</span>: R_386_GOTOFF    __libc_csu_init
  <span style="color: #F92672;">23</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
  <span style="color: #F92672;">24</span>:   51                      push   <span style="color: #FD971F;">%ecx</span>
  <span style="color: #F92672;">25</span>:   56                      push   <span style="color: #FD971F;">%esi</span>
  <span style="color: #F92672;">26</span>:   8b 83 00 00 00 00       mov    0x0(<span style="color: #FD971F;">%ebx</span>),<span style="color: #FD971F;">%eax</span>
            <span style="color: #F92672;">28</span>: R_386_GOT32X    main
  <span style="color: #F92672;">2c</span>:   50                      push   <span style="color: #FD971F;">%eax</span>
  <span style="color: #F92672;">2d</span>:   e8 fc ff ff ff          call   2e &lt;_start+0x2e&gt;
            <span style="color: #F92672;">2e</span>: R_386_PLT32 __libc_start_main
  <span style="color: #F92672;">32</span>:   f4                      hlt    
  <span style="color: #F92672;">33</span>:   8b 1c 24                mov    (<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%ebx</span>
  <span style="color: #F92672;">36</span>:   c3                      ret    
  <span style="color: #F92672;">37</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
  <span style="color: #F92672;">39</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
  <span style="color: #F92672;">3b</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
  <span style="color: #F92672;">3d</span>:   66 90                   xchg   <span style="color: #FD971F;">%ax</span>,<span style="color: #FD971F;">%ax</span>
  <span style="color: #F92672;">3f</span>:   90                      nop

<span style="color: #A6E22E; font-size: 130%;">00000040</span> &lt;_dl_relocate_static_pie&gt;:
  <span style="color: #F92672;">40</span>:   c3                      ret 
</pre>
</div>

<ul class="org-ul">
<li>crti.o<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-asm"><span style="color: #A6E22E; font-size: 130%;">objdump</span> -dr /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crti.o

/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crti.o:     file format elf32-i386


<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .init:

<span style="color: #A6E22E; font-size: 130%;">00000000</span> &lt;_init&gt;:
   <span style="color: #F92672;">0</span>:   53                      push   <span style="color: #FD971F;">%ebx</span>
   <span style="color: #F92672;">1</span>:   83 ec 08                sub    $0x8,<span style="color: #FD971F;">%esp</span>
   <span style="color: #F92672;">4</span>:   e8 fc ff ff ff          call   5 &lt;_init+0x5&gt;
            <span style="color: #F92672;">5</span>: R_386_PC32   __x86.get_pc_thunk.bx
   <span style="color: #F92672;">9</span>:   81 c3 02 00 00 00       add    $0x2,<span style="color: #FD971F;">%ebx</span>
            <span style="color: #F92672;">b</span>: R_386_GOTPC  _GLOBAL_OFFSET_TABLE_
   <span style="color: #F92672;">f</span>:   8b 83 00 00 00 00       mov    0x0(<span style="color: #FD971F;">%ebx</span>),<span style="color: #FD971F;">%eax</span>
            <span style="color: #F92672;">11</span>: R_386_GOT32X    __gmon_start__
  <span style="color: #F92672;">15</span>:   85 c0                   test   <span style="color: #FD971F;">%eax</span>,<span style="color: #FD971F;">%eax</span>
  <span style="color: #F92672;">17</span>:   74 02                   je     1b &lt;_init+0x1b&gt;
  <span style="color: #F92672;">19</span>:   ff d0                   call   *<span style="color: #FD971F;">%eax</span>

<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .gnu.linkonce.t.__x86.get_pc_thunk.bx:

<span style="color: #A6E22E; font-size: 130%;">00000000</span> &lt;__x86.get_pc_thunk.bx&gt;:
   <span style="color: #F92672;">0</span>:   8b 1c 24                mov    (<span style="color: #FD971F;">%esp</span>),<span style="color: #FD971F;">%ebx</span>
   <span style="color: #F92672;">3</span>:   c3                      ret    

<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .fini:

<span style="color: #A6E22E; font-size: 130%;">00000000</span> &lt;_fini&gt;:
   <span style="color: #F92672;">0</span>:   53                      push   <span style="color: #FD971F;">%ebx</span>
   <span style="color: #F92672;">1</span>:   83 ec 08                sub    $0x8,<span style="color: #FD971F;">%esp</span>
   <span style="color: #F92672;">4</span>:   e8 fc ff ff ff          call   5 &lt;_fini+0x5&gt;
            <span style="color: #F92672;">5</span>: R_386_PC32   __x86.get_pc_thunk.bx
   <span style="color: #F92672;">9</span>:   81 c3 02 00 00 00       add    $0x2,<span style="color: #FD971F;">%ebx</span>
            <span style="color: #F92672;">b</span>: R_386_GOTPC  _GLOBAL_OFFSET_TABLE_
</pre>
</div>

<ul class="org-ul">
<li>crtn.o<br /></li>
</ul>
<div class="org-src-container">
<pre class="src src-asm"><span style="color: #A6E22E; font-size: 130%;">objdump</span> -dr /usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crtn.o

/usr/lib/gcc/x86_64-linux-gnu/6/../../../../lib32/crtn.o:     file format elf32-i386


<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .init:

<span style="color: #A6E22E; font-size: 130%;">00000000</span> &lt;.init&gt;:
   <span style="color: #F92672;">0</span>:   83 c4 08                add    $0x8,<span style="color: #FD971F;">%esp</span>
   <span style="color: #F92672;">3</span>:   5b                      pop    <span style="color: #FD971F;">%ebx</span>
   <span style="color: #F92672;">4</span>:   c3                      ret    

<span style="color: #A6E22E; font-size: 130%;">Disassembly</span> <span style="color: #F92672;">of</span> section .fini:

<span style="color: #A6E22E; font-size: 130%;">00000000</span> &lt;.fini&gt;:
   <span style="color: #F92672;">0</span>:   83 c4 08                add    $0x8,<span style="color: #FD971F;">%esp</span>
   <span style="color: #F92672;">3</span>:   5b                      pop    <span style="color: #FD971F;">%ebx</span>
   <span style="color: #F92672;">4</span>:   c3                      ret  
</pre>
</div>

<ul class="org-ul">
<li>crtbeginT.o 和 crtend.o，C++全局构造和析构<br /></li>
</ul>

<p>
多线程库里对很多不可重入函数加锁或者用了TLS<br />
TLS接口: pthread_key_create(), pthread_getspecific(), pthread_setspecific(), pthread_key_delete()<br />
</p>

<p>
glibc在处理C++全局构造和析构时, __libc_start_main -&gt; __libc_csu_init -&gt; _init -&gt; crtbeginT.o里的__do_global_ctors_aux -&gt; 初始化.ctors段里函数指针，里面存放的构造函数,并用__cxa_exit注册了析构<br />
<b>.dtor原来是做析构的，但是有了__cxa_exit就不用了</b><br />
</p>
</div>
</div>
