books/程序员的自我修养.org
** IO缓冲
glibc的文件读写默认有缓冲模式,可以通过setbuf配置某文件的缓冲
| 缓冲模式 | 常量   | 备注                    |
|----------+--------+-------------------------|
| 无缓冲   | _IONBF | 不使用缓冲              |
| 行缓冲   | _IOLBF | 每收到\n或\r\n时会flush |
| 全缓冲   | _IOFBF | 缓冲满才flush           |
*在内核态，其实也有缓存的概念，例如write写，默认为回写而不是通写，也就是不立即写到硬盘，直到换页检测dirty位才写回*

* 第十二章 系统调用与API
linux使用0x80为系统调用的入口,各个通用寄存器用于传递参数
| EAX | Name | Desc     | 参数          |
|-----+------+----------+---------------|
|   1 | exit | 退出进程 | EBX为退出码   |
|   2 | fork | 复制进程 | EBX为复制参数 |

linux用了CPU两种模式，用户模式和特权模式， *从boot开始的特权到进程0转为用户态后，后面要再次进入特权都需通过中断*

中断,一个硬件或软件发出的请求，区别于CPU轮询(*但实际是CPU每次运行指令后都会去查看是否有中断产生，可认为是中断是硬件的轮询*)

中断分硬中断(来自于外设的异常)和软中断(int指令)

- 解发中断 int 0x80，不同的系统调用用不同的eax值表示，带参数可以用ebx等
- 中断时，用户态切至内核态，找到当前进程的内核栈，将用户态寄存器存入内核栈(SS、ESP、EFLAGS、CS、EIP)
- 从系统调用中返回时用iret

软中断流程，以fork为例: fork-> int 0x80 -> system_call -> sys_fork

_可以用__attribute__((regparm(0)))保证参数用寄存器传递_

此外,intel也有个vdso库(ldd出来的linux-gate.so.1)，里面是系统调用的代码，可以通过访问vdso来使用系统调用
#+begin_src bash
./a.out &
[1] 5030
ldd a.out
	linux-gate.so.1 (0xf779d000)
	libc.so.6 => /lib32/libc.so.6 (0xf7595000)
	/lib/ld-linux.so.2 (0xf779f000)
cat /proc/5030/maps
...
f77d1000-f77d3000 r-xp 00000000 00:00 0                                  [vdso]
...
#+end_src

* 第十三章 运行库实现
MiniCRT,略
