程序员的自我修养.html

<div id="outline-container-org1f19bdc" class="outline-3">
<h3 id="org1f19bdc"><span class="section-number-3">11.2</span> IO缓冲</h3>
<div class="outline-text-3" id="text-11-2">
<p>
glibc的文件读写默认有缓冲模式,可以通过setbuf配置某文件的缓冲<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">缓冲模式</th>
<th scope="col" class="org-left">常量</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">无缓冲</td>
<td class="org-left">_IONBF</td>
<td class="org-left">不使用缓冲</td>
</tr>

<tr>
<td class="org-left">行缓冲</td>
<td class="org-left">_IOLBF</td>
<td class="org-left">每收到或时会flush</td>
</tr>

<tr>
<td class="org-left">全缓冲</td>
<td class="org-left">_IOFBF</td>
<td class="org-left">缓冲满才flush</td>
</tr>
</tbody>
</table>
<p>
<b>在内核态，其实也有缓存的概念，例如write写，默认为回写而不是通写，也就是不立即写到硬盘，直到换页检测dirty位才写回</b><br />
</p>
</div>
</div>
</div>

<div id="outline-container-orgae8c2df" class="outline-2">
<h2 id="orgae8c2df"><span class="section-number-2">12</span> 第十二章 系统调用与API</h2>
<div class="outline-text-2" id="text-12">
<p>
linux使用0x80为系统调用的入口,各个通用寄存器用于传递参数<br />
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">EAX</th>
<th scope="col" class="org-left">Name</th>
<th scope="col" class="org-left">Desc</th>
<th scope="col" class="org-left">参数</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">exit</td>
<td class="org-left">退出进程</td>
<td class="org-left">EBX为退出码</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">fork</td>
<td class="org-left">复制进程</td>
<td class="org-left">EBX为复制参数</td>
</tr>
</tbody>
</table>

<p>
linux用了CPU两种模式，用户模式和特权模式， <b>从boot开始的特权到进程0转为用户态后，后面要再次进入特权都需通过中断</b><br />
</p>

<p>
中断,一个硬件或软件发出的请求，区别于CPU轮询(<b>但实际是CPU每次运行指令后都会去查看是否有中断产生，可认为是中断是硬件的轮询</b>)<br />
</p>

<p>
中断分硬中断(来自于外设的异常)和软中断(int指令)<br />
</p>

<ul class="org-ul">
<li>解发中断 int 0x80，不同的系统调用用不同的eax值表示，带参数可以用ebx等<br /></li>
<li>中断时，用户态切至内核态，找到当前进程的内核栈，将用户态寄存器存入内核栈(SS、ESP、EFLAGS、CS、EIP)<br /></li>
<li>从系统调用中返回时用iret<br /></li>
</ul>

<p>
软中断流程，以fork为例: fork-&gt; int 0x80 -&gt; system_call -&gt; sys_fork<br />
</p>

<p>
<span class="underline">可以用__attribute__((regparm(0)))保证参数用寄存器传递</span><br />
</p>

<p>
此外,intel也有个vdso库(ldd出来的linux-gate.so.1)，里面是系统调用的代码，可以通过访问vdso来使用系统调用<br />
</p>
<div class="org-src-container">
<pre class="src src-bash">./a.out &amp;
[1] 5030
ldd a.out
    linux-gate.so.1 (0xf779d000)
    libc.so.6 =&gt; /lib32/libc.so.6 (0xf7595000)
    /lib/ld-linux.so.2 (0xf779f000)
cat /proc/5030/maps
...
f77d1000-f77d3000 r-xp 00000000 00:00 0                                  [vdso]
...
</pre>
</div>
</div>
</div>

<div id="outline-container-org3441e9e" class="outline-2">
<h2 id="org3441e9e"><span class="section-number-2">13</span> 第十三章 运行库实现</h2>
<div class="outline-text-2" id="text-13">
<p>
MiniCRT,略<br />
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: xuali2</p>
<p class="date">Created: 2020-10-19 一 23:39</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
